Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/backend.po
Languages: ru

source: By default, DRF does not support nested views. This decorator solves this problem.
ru: По умолчанию DRF не поддерживает вложенные view. Данный декоратор решает эту проблему.

source: You need two or more models with nested relationship (Many-to-Many or Many-to-One) and two viewsets. Decorator nests viewset to parent viewset class and generate paths in API.
ru: Вам нужны две или более модели с вложенными отношениями (многие-ко-многим или многие-к-одному) и два viewset'а. Декоратор вкладывает viewset'ы в родительский класс viewset'ов и генерирует пути в API.

source: Name of nested path. Also used as default name for related queryset (see `manager_name`).
ru: Имя вложенного пути. Также используется стандартное имя для связанных queryset'ов (см. `manager_name`).

source: Name of nested primary key field.
ru: Имя вложенного поля первичного ключа.

source: Nested viewset class.
ru: Класс вложенного viewset'а.

source: Flag for allowing to append existed instances.
ru: Флаг, разрешающий добавление существующих экземпляров.

source: Flag for forbidding bulk queries in related manager add method.
ru: Флаг, запрещающий выполнение bulk запросов в методе add связанного менеджера.

source: Name of model-object attr which contains nested queryset.
ru: Имя атрибута объекта модели, который содержит вложенный queryset.

source: List of allowed methods to nested view endpoints.
ru: Список разрешенных методов для endpoint'ов вложенных view.

source: List of allowed subviews or actions to nested view endpoints.
ru: Список разрешенных subviews или экшенов для endpoint'ов вложенных views.

source: List of callable objects which returns filtered queryset of main.
ru: Список вызываемых объектов, которые возвращают отфильтрованный queryset.

source: Some view methods will not call for performance reasons. This also applies to some of the class attributes that are usually initialized in the methods. For example, ``.initial()`` will never call. Each viewset wrapped by nested class with additional logic.
ru: Некоторые методы view не будут вызваны из соображений производительности. Это также применяется к некоторым атрибутам класса, которые обычно инициализируются в методах. Например, ``.initial()`` никогда не будет вызван. Каждый viewset обернут вложенным классом с дополнительной логикой.

source: This code generates api paths:
ru: Данный код генерирует пути api:

source: Decorator which wrap object method to subaction of viewset.
ru: Декоратор, оборачивающий метод объекта в subaction viewset'а.

source: List of allowed HTTP-request methods. Default is ``["post"]``.
ru: Список разрешенных методов HTTP. По умолчанию ``["post"]``.

source: Flag to set method execution to one instance.
ru: Флаг, указывающий, должен ли метод применяться к одному экземпляру.

source: Serializer for this action.
ru: Сериализатор для этого экшена.

source: Tuple or list permission classes.
ru: Кортеж или список permission-классов.

source: API-path name for this action.
ru: Имя API-пути для этого экшена.

source: Description for this action in OpenAPI.
ru: Описание этого экшена в OpenAPI.

source: Allow to use this action in multiactions. Works only with :class:`vstutils.api.serializers.EmptySerializer` as response.
ru: Разрешает использовать этот экшен в мультиэкшенах. Работает только с :class:`vstutils.api.serializers.EmptySerializer` в response.

source: Sets whether the action must be confirmed before being executed.
ru: Задает, должен ли экшен требовать подтверждения перед выполнением.

source: Mark this action as paginated list with all rules and parameters.
ru: Отметить это действие как пагинируемый список со всеми правилами и параметрами.

source: Override action title.
ru: Заменить заголовок действия.

source: Setup action icon classes.
ru: Настроить классы иконок действия.

source: **An ETag** (Entity Tag) is a mechanism defined by the HTTP protocol for web cache validation and to manage resource versions efficiently. It represents a unique identifier for the content of a resource at a given time, allowing client and server to determine if the resource has changed without downloading the entire content. This mechanism significantly reduces bandwidth and improves web performance by enabling conditional requests. Servers send ETags in responses to clients, which can cache these tags along with the resources. On subsequent requests, clients send the cached ETag back to the server in an If-None-Match header. If the resource has not changed (the ETag matches), the server responds with a 304 Not Modified status, indicating that the client's cached version is up-to-date.
ru: **ETag** (Entity Tag) — это механизм, определенный протоколом HTTP для проверки кэша веба и эффективного управления версиями ресурсов. Он представляет собой уникальный идентификатор содержимого ресурса на определенный момент времени, позволяя клиенту и серверу определить, изменился ли ресурс без необходимости загружать весь контент. Этот механизм значительно сокращает использование полосы пропускания и улучшает производительность веба за счет использования условных запросов. Серверы отправляют ETags в ответах клиентам, которые могут кэшировать эти теги вместе с ресурсами. При последующих запросах клиенты отправляют кэшированный ETag обратно на сервер в заголовке If-None-Match. Если ресурс не изменился (ETag совпадает), сервер отвечает статусом 304 Not Modified, указывая, что кэшированная версия клиента актуальна.

source: Beyond GET requests, ETags can also be instrumental in other HTTP methods like PUT or DELETE to ensure consistency and prevent unintended overwrites or deletions, known as "mid-air collision avoidance." By including an ETag in the If-Match header of non-GET requests, clients signal that the operation should proceed only if the resource's current state matches the specified ETag, thus safeguarding against concurrent modifications by different clients. This application of ETags enhances the reliability and integrity of web applications by ensuring that operations are performed on the correct version of a resource.
ru: Помимо GET-запросов, ETags также могут быть полезны в других методах HTTP, таких как PUT или DELETE, для обеспечения согласованности и предотвращения непреднамеренных перезаписей или удалений, известных как «избежание столкновений в воздухе». Включая ETag в заголовок If-Match не-GET запросов, клиенты сигнализируют, что операция должна продолжаться только в том случае, если текущее состояние ресурса соответствует указанному ETag, тем самым защищая от одновременных изменений разными клиентами. Это применение ETags повышает надежность и целостность веб-приложений, гарантируя выполнение операций с корректной версией ресурса.

source: Here is main functionality provided for working with ETag's mechanism:
ru: Вот основные функции, предоставляемые для работы с механизмом ETag:

source: A mixin designed to enhance caching for GET responses in Django REST framework views, leveraging the standard HTTP caching mechanism. It returns a 304 Not Modified status for reading requests like GET or HEAD when the ETag (Entity Tag) in the client's request matches the current resource state, and a 412 Precondition Failed status for writing requests when the condition fails. This approach reduces unnecessary network traffic and load times for unchanged resources, and ensures data consistency for write operations.
ru: Миксин, предназначенный для улучшения кэширования ответов на GET-запросы в представлениях Django REST framework, используя стандартный механизм кэширования HTTP. Он возвращает статус 304 Not Modified для чтения запросов, таких как GET или HEAD, когда ETag (Entity Tag) в запросе клиента совпадает с текущим состоянием ресурса, и статус 412 Precondition Failed для записывающих запросов, когда условие не выполняется. Этот подход снижает ненужный сетевой трафик и время загрузки для неизменных ресурсов, а также обеспечивает согласованность данных для операций записи.

source: The mixin relies on :func:`.get_etag_value` and :func:`.check_request_etag` functions within the `GenericViewSet` context to dynamically generate and validate ETags for resource states. By comparing ETags, it determines whether content has changed since the last request, allowing clients to reuse cached responses when applicable and preventing concurrent write operations from overwriting each other without acknowledgment of updated state.
ru: Миксин использует функции :func:`.get_etag_value` и :func:`.check_request_etag` в контексте `GenericViewSet` для динамического создания и проверки ETag для состояний ресурсов. Сравнивая ETag, он определяет, изменилось ли содержимое с момента последнего запроса, позволяя клиентам повторно использовать кэшированные ответы, когда это применимо, и предотвращая одновременные операции записи от перезаписи друг друга без подтверждения обновленного состояния.

source: This mixin is designed to work with models that inherit from :class:`vstutils.models.BModel`. Usage with other models may not provide the intended caching behavior and could lead to incorrect application behavior.
ru: Этот миксин разработан для работы с моделями, наследующими от :class:`vstutils.models.BModel`. Использование с другими моделями может не обеспечить предполагаемое поведение кэширования и может привести к некорректному поведению приложения.

source: For effective use, ensure model classes are compatible with ETag generation and validation by implementing the :func:`.get_etag_value` method for custom ETag computation. Additionally, the :class:`.GenericViewSet` using this mixin should properly handle ETag headers in client requests to leverage HTTP caching.
ru: Для эффективного использования убедитесь, что классы моделей совместимы с генерацией и проверкой ETag, реализовав метод :func:`.get_etag_value` для пользовательского вычисления ETag. Кроме того, :class:`.GenericViewSet`, использующий этот миксин, должен правильно обрабатывать заголовки ETag в запросах клиентов для использования кэширования HTTP.

source: An additional feature of the ``CachableHeadMixin`` is its automatic inclusion in the generated view from a :class:`vstutils.models.BModel` if the model class has the ``_cache_responses`` class attribute set to ``True``. This enables automatic caching capabilities for models indicating readiness for HTTP-based caching, streamlining the process of optimizing response times and reducing server load for frequently accessed resources.
ru: Дополнительной особенностью ``CachableHeadMixin`` является его автоматическое включение в сгенерированное представление из :class:`vstutils.models.BModel`, если класс модели имеет атрибут класса `_cache_responses`, установленный в ``True``. Это позволяет автоматизировать возможности кэширования для моделей, указывающих на готовность к кэшированию на основе HTTP, оптимизируя процесс сокращения времени ответа и снижения нагрузки на сервер для часто доступных ресурсов.

source: A custom enumeration that defines potential dependencies for ETag generation. It includes:
ru: Пользовательское перечисление, определяющее потенциальные зависимости для генерации ETag. Оно включает:

source: Indicates dependency on the user's language preference.
ru: Указывает на зависимость от языковых предпочтений пользователя.

source: Indicates dependency on the user's session.
ru: Указывает на зависимость от сессии пользователя.

source: Indicates dependency on the user's identity.
ru: Указывает на зависимость от идентичности пользователя.

source: The get_etag_value function is designed to compute a unique ETag value based on the model's state, request parameters, and additional dependencies such as user language, session, and user identity. This function supports both single models and collections of models.
ru: Функция get_etag_value предназначена для вычисления уникального значения ETag на основе состояния модели, параметров запроса и дополнительных зависимостей, таких как язык пользователя, сессия и идентичность пользователя. Эта функция поддерживает как отдельные модели, так и коллекции моделей.

source: An instance of :class:`.GenericViewSet`, responsible for view operations.
ru: Экземпляр :class:`.GenericViewSet`, отвечающий за операции просмотра.

source: The model class for which the ETag value is being generated. This parameter can be a single model class or a collection of model classes (:class:`list`, :class:`tuple`, or :class:`set`). Each model class may optionally implement a class method named ``get_etag_value``.
ru: Класс модели, для которой генерируется значение ETag. Этот параметр может быть одним классом модели или коллекцией классов моделей (:class:`list`, :class:`tuple` или :class:`set`). Каждый класс модели может необязательно реализовать метод класса с именем ``get_etag_value``.

source: The request object from the Django REST framework, containing all the HTTP request information.
ru: Объект запроса из Django REST framework, содержащий всю информацию HTTP-запроса.

source: he primary key of the model instance for which the ETag is being calculated. This can be a specific value (int or str) for single model usage, or a dictionary mapping model classes to their respective primary key values for collections of models.
ru: Первичный ключ экземпляра модели, для которого рассчитывается ETag. Это может быть конкретное значение (int или str) для использования в одной модели или словарь, сопоставляющий классы моделей с их соответствующими значениями первичных ключей для коллекций моделей.

source: The computed ETag value as a hexadecimal string.
ru: Вычисленное значение ETag в виде шестнадцатеричной строки.

source: :class:`str`
ru: :py:class:`str`

source: The function operates differently based on the type of model_class provided:
ru: Функция работает по-разному в зависимости от предоставленного типа model_class:

source: **Collection of Models**: When model_class is a collection, the function computes an ETag by concatenating ETag values of individual models in the collection, using a recursive call for each model. The ETag value for each model is encoded and hashed using Blake2s algorithm.
ru: **Коллекция моделей**: Когда model_class является коллекцией, функция вычисляет ETag, объединяя значения ETag отдельных моделей в коллекции, используя рекурсивный вызов для каждой модели. Значение ETag для каждой модели кодируется и хешируется с использованием алгоритма Blake2s.

source: **Model with ``get_etag_value`` method**: If the model class has a get_etag_value method, the function calls this method to obtain a base ETag value. It then appends language, user ID, and session key information if they are marked as dependencies in the model's ``_cache_response_dependencies`` attribute. This base ETag may be further processed to include the application's full version string and hashed if user or session information is included.
ru: **Модель с методом ``get_etag_value``**: Если класс модели имеет метод get_etag_value, функция вызывает этот метод, чтобы получить базовое значение ETag. Затем она добавляет информацию о языке, идентификаторе пользователя и ключе сессии, если они помечены как зависимости в атрибуте ``_cache_response_dependencies`` модели. Это базовое значение ETag может быть дополнительно обработано, включая полную строку версии приложения и хешировано, если включена информация о пользователе или сессии.

source: **Model without ``get_etag_value`` method**: For models lacking a custom get_etag_value method, the function generates an ETag based on the model's class name and a hash of the application's full version string.
ru: **Модель без метода ``get_etag_value``**: Для моделей без пользовательского метода get_etag_value функция генерирует ETag на основе имени класса модели и хеша полной строки версии приложения.

source: The function plays a crucial role within the context of the ETag mechanism, providing a flexible way to validate client-side ETags against the server-side version for both cache validation and ensuring data consistency in web applications. It supports conditional handling of HTTP requests based on the match or mismatch of ETag values, accommodating various scenarios such as cache freshness checks and prevention of concurrent modifications.
ru: Функция играет ключевую роль в контексте механизма ETag, предоставляя гибкий способ проверки ETags на стороне клиента по сравнению с версией на стороне сервера как для проверки кэша, так и для обеспечения согласованности данных в веб-приложениях. Она поддерживает условную обработку HTTP-запросов на основе совпадения или несовпадения значений ETag, адаптируясь к различным сценариям, таким как проверки свежести кэша и предотвращение одновременных изменений.

source: The HTTP request object containing the client's headers, from which the ETag for comparison is retrieved.
ru: Объект HTTP-запроса, содержащий заголовки клиента, из которых извлекается ETag для сравнения.

source: The server-generated ETag value that represents the current state of the resource. This unique identifier is recalculated whenever the resource's content changes.
ru: ETag, сгенерированный сервером, представляет текущее состояние ресурса. Этот уникальный идентификатор пересчитывается при каждом изменении содержимого ресурса.

source: Specifies the HTTP header to look for the client's ETag. Defaults to "If-None-Match", commonly used in GET requests for cache validation. For operations requiring confirmation that the client is acting on the latest version of a resource (e.g., PUT or DELETE), "If-Match" should be used instead.
ru: Указывает HTTP-заголовок для поиска ETag клиента. По умолчанию используется "If-None-Match", обычно используемый в GET-запросах для проверки кэша. Для операций, требующих подтверждения того, что клиент действует с последней версией ресурса (например, PUT или DELETE), вместо этого следует использовать "If-Match".

source: A function to compare the ETags. By default, this is set to ``str.__eq__``, which checks for an exact match between the client's and server's ETags, suitable for validating caches with ``If-None-Match``. To handle ``If-Match`` scenarios, where the operation should proceed only if the ETags do not match, indicating the resource has been modified, ``str.__ne__`` (not equal) can be used as the operation handler. This flexibility allows for precise control over how and when clients are allowed to read from or write to resources based on their version.
ru: Функция для сравнения ETags. По умолчанию установлено ``str.__eq__``, которое проверяет точное совпадение ETags клиента и сервера, подходящее для проверки кэшей с ``If-None-Match``. Для обработки сценариев ``If-Match``, когда операция должна продолжаться только в случае, если ETags не совпадают, указывая на то, что ресурс был изменен, можно использовать ``str.__ne__`` (не равно) в качестве обработчика операции. Эта гибкость позволяет точно контролировать, как и когда клиентам разрешено читать или записывать ресурсы на основе их версии.

source: Returns a tuple containing the server's ETag and a boolean flag. The flag is ``True`` if the operation handler condition between the server's and client's ETag is met, indicating the request should proceed based on the matching logic defined by the operation handler; otherwise, it returns ``False``.
ru: Возвращает кортеж, содержащий ETag сервера и булев флаг. Флаг равен ``True``, если условие обработчика операции между ETag сервера и клиента выполнено, указывая на то, что запрос должен продолжаться на основе логики сопоставления, определенной обработчиком операции; в противном случае возвращает ``False``.

source: Actions
ru: Actions (Действия)

source: Vstutils has the advanced system of working with actions. REST API works with data through verbs, which are called methods. However, to work with one or a list of entities, such actions may not be enough.
ru: Vstutils имеет развитую систему работы с действиями. REST API работает с данными через глаголы, которые называются методами. Однако для работы с одной или списком сущностей этих действий может быть недостаточно.

source: To expand the set of actions, you need to create an action that will work with some aspect of the described model. For these purposes, there is a standard :func:`rest_framework.decorators.action`, which can also be extended using the scheme. But for the greater convenience, there is a set of decorator objects in vstutils to eliminate the routine of writing boilerplate code.
ru: Чтобы расширить набор действий, необходимо создать действие, которое будет работать с некоторым аспектом описанной модели. Для этих целей существует стандартный :func:`rest_framework.decorators.action`, который также можно расширить с помощью схемы. Но для большего удобства в vstutils есть набор декораторов, которые позволяют избежать написания

source: The main philosophy for these wrappers is that the developer writes business logic without being distracted by the boilerplate code. Often, most of the errors in the code appear precisely because of the blurry look from the routine writing of the code.
ru: Основная философия этих оберток заключается в том, что разработчик пишет бизнес-логику, не отвлекаясь на написание повторяющегося кода. Часто большинство ошибок в коде возникают именно из-за расфокусировки внимания при рутинном написании кода.

source: Base class of actions. Has minimal of required functionality to create an action and write only business logic. This decorator is suitable in cases where it is not possible to implement the logic using :class:`.SimpleAction` or the algorithm is much more complicated than standard CRUD.
ru: Базовый класс действий. Обладает минимально необходимой функциональностью для создания действия и позволяет написать только бизнес-логику. Этот декоратор подходит в случаях, когда невозможно реализовать логику с использованием :class:`.SimpleAction` или алгоритм значительно более сложный, чем стандартные операции CRUD.

source: Flag indicating which type of action is used: on a list or on a single entity. Affects where this action will be displayed - on a detailed record or on a list of records.
ru: Флаг, указывающий, какой тип действия используется: на списке или на отдельной сущности. Влияет на то, где будет отображаться это действие - на детальной записи или на списке записей.

source: List of available HTTP-methods for this action. Default has only `POST` method.
ru: Список доступных методов HTTP. По умолчанию ``["post"]``.

source: Request body serializer. Also used for default response.
ru: Сериализатор для тела запроса. Используется также для формирования ответа по умолчанию.

source: Response body serializer. Required, when request and response has different set of fields.
ru: Сериализатор для тела ответа. Необходим, когда запрос и ответ имеют различные наборы полей.

source: GET-request query data serializer. It is used when it is necessary to get valid data in the query data of a GET-request and cast it to the required type.
ru: Сериализатор для данных запроса типа GET. Используется, когда необходимо получить корректные данные в строке запроса типа GET и привести их к нужному типу.

source: Used only with non-GET requests and notify GUI, that this action should be rendered over the selected list items.
ru: Используется только с не-GET запросами и уведомляет GUI, что это действие должно быть применено к выбранным элементам списка.

source: Title for action in UI. For non-GET actions, title is generated from method's name.
ru: Заголовок действия в пользовательском интерфейсе. Для действий, отличных от GET, заголовок генерируется на основе имени метода.

source: List of icons for UI button.
ru: Список иконок для кнопки пользовательского интерфейса.
