Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/backend.po
Languages: ru

source: Backend API manual
ru: Руководство по серверному API

source: VST Utils framework uses Django, Django Rest Framework, drf-yasg and Celery.
ru: Фреймворк VST Utils использует Django, Django Rest Framework, drf-yasg и Celery.

source: Models
ru: Модели

source: A model is the single, definitive source of truth about your data. It contains essential fields and behavior for the data you’re storing. Usually best practice is to avoid writing views and serializers manually, as BModel provides plenty of Meta attributes to autogenerate serializers and views for many use cases.
ru: Модель - это единственный и окончательный источник истины о ваших данных. Она содержит основные поля и поведение для данных, которые вы храните. Хорошей практикой считается избегать написания собственных view и сериализаторов, поскольку BModel предоставляет богатый набор мета-атрибутов для их автоматической генерации в большинстве ситуаций.

source: Default Django model classes overrides in `vstutils.models` module.
ru: Переопределение стандартных классов моделей Django в модуле `vstutils.models`.

source: Default model class that generates model viewset, separate serializers for list() and retrieve(), filters, api endpoints and nested views.
ru: Стандартный класс модели, генерирующий viewset, отдельные сериализаторы для list() и retrieve(), фильтры, api endpoint-ы и вложенные view.

source: Examples:
ru: Примеры:

source: In this case, you create models which could converted to simple view, where:
ru: В данном случае создаются модели, которые затем будут конвертированы во view, где:

source: ``POST``/``GET`` to ``/api/version/task/`` - creates new or get list of tasks
ru: ``POST``/``GET`` на ``/api/version/task/`` - создает новую задачу или получает список всех задач

source: ``PUT``/``PATCH``/``GET``/``DELETE`` to ``/api/version/task/:id/`` - updates, retrieves or removes instance of task
ru: ``PUT``/``PATCH``/``GET``/``DELETE`` на ``/api/version/task/:id/`` - обновляет, получает или удаляет экземпляр задачи

source: ``POST``/``GET`` to ``/api/version/task/:id/stage/`` - creates new or get list of stages in task
ru: ``POST``/``GET`` to ``/api/version/task/:id/stage/`` - создает новую стадию или получает список всех стадий в задаче

source: ``PUT``/``PATCH``/``GET``/``DELETE`` to ``/api/version/task/:id/stage/:stage_id`` - updates, retrieves or removes instance of stage in task.
ru: ``PUT``/``PATCH``/``GET``/``DELETE`` на ``/api/version/task/:id/stage/:stage_id`` - обновляет, получает или удаляет экземпляр стадии в задаче.

source: To attach a view to an API insert the following code in `settings.py`:
ru: Чтобы добавить view к API, вставьте следующий код в `settings.py`:

source: For primary access to generated view inherit from `Task.generated_view` property.
ru: Для первичного доступа к сгенерированному view, наследуйтесь от свойства `Task.generated_view`.

source: To make translation on frontend easier use ``_translate_model`` attribute with model_name.
ru: Чтобы упростить процесс перевода на фронтенде, используйте атрибут ``_translate_model`` вместе с названием модели.

source: List of meta-attributes for generating a view:
ru: Список мета-атрибутов для генерации view:

source: ``_view_class`` - list of additional view classes to inherit from, class or string to import with base class ViewSet. Constants are also supported:
ru: ``_view_class`` - список дополнительных классов view для наследования. Класс, унаследованный от ViewSet или строка для его импорта. Константы также поддерживаются:

source: ``read_only`` - to create a view only for viewing;
ru: ``read_only`` - для создания view, поддерживающего только просмотр;

source: ``list_only`` - to create a view with list only;
ru: ``list_only`` - для создания view, поддерживающего только список;

source: ``history`` - to create a view only for viewing and deleting records.
ru: ``history`` - для создания view, поддерживающего только просмотр и удаление записей.

source: CRUD-view is applied by default.
ru: Представление, поддерживающее все CRUD-операции, применяется по умолчанию.

source: ``_serializer_class`` - class of API serializer; use this attribute to specify parent class for autogenerated serializers. Default is :class:`vstutils.api.serializers.VSTSerializer`. Can take a string to import, serializer class or :class:`django.utils.functional.SimpleLazyObject`.
ru: ``_serializer_class`` - класс API сериализатора; используйте этот атрибут, чтобы указать родительский класс автоматически сгенерированных сериализаторов. По умолчанию используется :class:`vstutils.api.serializers.VSTSerializer`. Принимает строку для импорта, класс сериализатора или :class:`django.utils.functional.SimpleLazyObject`.

source: ``_serializer_class_name`` - model name for OpenAPI definitions.This would be a model name in generated admin interface. Default is name of model class.
ru: ``_serializer_class_name`` - название модели для OpenAPI definitions. Это название будет в сгенерированном интерфейсе администратора. По умолчанию используется имя класса.

source: ``_list_fields`` or ``_detail_fields`` - list of fields which will be listed in entity list or detail view accordingly. Same as DRF serializers meta-attribute "fields".
ru: ``_list_fields`` или ``_detail_fields`` - список полей, которые будут отображены в списке или детальной записи соответственно. То же, что и мета-атрибут "fields" в сериализаторах DRF.

source: ``_override_list_fields`` or ``_override_detail_fields`` - mapping with names and field types that will be redeclared in serializer attributes(think of it as declaring fields in DRF ModelSerializer). Keep in mind that the fields specified here do not necessarily end up in the serializer class, but only if they are included in the corresponding lists.
ru: ``_override_list_fields`` или ``_override_detail_fields`` — отображение с именами и типами полей, которые будут переопределены в атрибутах сериализатора (считайте это как объявление полей в DRF ModelSerializer). Имейте в виду, что указанные здесь поля не обязательно окажутся в классе сериализатора, а только если они включены в соответствующие списки.

source: ``_properties_groups`` - dict with key as group name and value as list of fields(str). Allows to group fields in sections on frontend.
ru: ``_properties_groups`` - словарь, где ключами являются названия групп, а значениями - списки полей (строки). Позволяет группировать поля в секции на фронтенде.

source: ``_view_field_name`` - name of field frontend shows as main view name.
ru: ``_view_field_name`` - поле, которое будет использовано для вывода заголовка детальной записи.

source: ``_non_bulk_methods`` - list of methods which must not used via bulk requests.
ru: ``_non_bulk_methods`` - список методов, которые не должны использовать bulk для запросов.

source: ``_extra_serializer_classes`` - mapping with additional serializers in viewset. For example, custom serializer, which will compute smth in action (mapping name). Value can be string for import. Important note: setting `model` attribute to None allows to use standard serializer generation mechanism and get fields from a list or detail serializer (set `__inject_from__` serializer's meta attribute to `list` or `detail` accordingly). In some cases, it is required to pass the model to the serializer. For these purposes, the constant `LAZY_MODEL` can be used as a meta attribute. Each time the serializer is used, the exact model where this serializer was declared will be set.
ru: ``_extra_serializer_classes`` - сопоставление с дополнительными сериализаторами во viewset. Это может быть, например, сериализатор, который будет вычислять что-то в действии (имя сопоставления). Значением может быть строка для импорта. Важное замечание: при установке атрибута `model` в значение None будет использован стандартный механизм генерации сериализаторов, что позволит получить поля из list или detail сериализаторов (установите мета-атрибут сериализатора `__inject_from__` в `list` или `detail` соответственно). В некоторых случаях необходимо передать модель в сериализатор. Для этих целей используйте константу `LAZY_MODEL` в качестве мета-атрибута. Каждый раз, когда сериализатор будет использован, конкретная модель, в которой он объявлен, будет подставлена.

source: ``_filterset_fields`` - list/dict of filterset names for API-filtering. Default is list of fields in list view. During processing a list of fields checks for the presence of special field names and inherit additional parent classes. If the list contains ``id``, class will inherit from :class:`vstutils.api.filters.DefaultIDFilter`. If the list contains ``name``, class will inherit from :class:`vstutils.api.filters.DefaultNameFilter`. If both conditions are present, inheritance will be from all of the above classes. Possible values include `list` of fields to filter or `dict` where key is a field name and value is a Filter class. Dict extends attribute functionality and provides ability to override filter field class (None value disables overriding).
ru: ``_filterset_fields`` - список или словарь имен filterset для API-фильтрации. По умолчанию используется список полей list-view. При обработке списка полей проверяет наличие специальных имен полей и наследует дополнительные родительские классы. Если в списке есть ``id``, класс будет наследован от :class:`vstutils.api.filters.DefaultIDFilter`. Если есть ``name`` - от :class:`vstutils.api.filters.DefaultNameFilter`. Если есть и ``id``, и ``name``, то класс будет наследован от обоих. Возможные значения включают `list` полей, которые нужно фильтровать, или `dict`, где ключ - имя поля, а значение - класс Filter. Использование словаря расширяет функциональность атрибута и дает возможность переопределить класс фильтра для отдельных полей (значение None выключает переопределение).

source: ``_search_fields`` - tuple or list of fields using for search requests. By default (or `None`) get all filterable fields in detail view.
ru: ``_search_fields`` - кортеж или список полей, которые должны использоваться в поисковых запросах. По умолчанию (или если установлено `None`) - все фильтруемые поля в detail view.

source: ``_copy_attrs`` - list of model-instance attributes indicates that object is copyable with this attrs.
ru: ``_copy_attrs`` - список полей экземпляра модели, указывающий, что экземпляр может быть скопирован с этими атрибутами.

source: ``_nested`` - key-value mapping with nested views (key - nested name, kwargs for :class:`vstutils.api.decorators.nested_view` decorator but supports ``model`` attribute as nested). ``model`` can be string for import. Use ``override_params`` when you need to override generated view parameters for nested view (works only with ``model`` as view).
ru: ``_nested`` - сопоставление ключ-значение вложенных view (ключ - имя вложенного view, kwargs для декоратора :class:`vstutils.api.decorators.nested_view`, но поддерживает атрибут ``model`` в качестве вложенного). ``model`` может быть строкой для импорта. Используйте параметр ``override_params`` в тех случаях, когда необходимо перегрузить параметры генерируемого представления в качестве вложенного (работает только когда задан ``model`` как вложенное представление).

source: ``_extra_view_attributes`` - key-value mapping with additional view attributes, but has less priority over generated attributes.
ru: ``_extra_view_attributes`` - сопоставление ключ-значение дополнительных атрибутов view, имеет меньший приоритет перед сгенерированными атрибутами.

source: ``_hidden_on_frontend_list_fields`` - list with fields names which will be hidden in list view on frontend.
ru: ``_hidden_on_frontend_list_fields`` - список имен полей, которые будут скрыты в списковом представлении на фронтенде.

source: ``_hidden_on_frontend_detail_fields`` - list with fields names which will be hidden in detail view on frontend.
ru: ``_hidden_on_frontend_detail_fields`` - список имен полей, которые будут скрыты в детальном представлении на фронтенде.

source: ``_detail_operations_availability_field_name`` - name of field which indicates availability of operations, field value can be dict where key is operation name and value is boolean flag or simply list of available operations.
ru: ``_detail_operations_availability_field_name`` - имя поля, которое указывает доступность операции, значение может быть словарем, где ключ это имя операции, а значение - логическое значение или просто список доступных операций.

source: In common, you can also add custom attributes to override or extend the default list of processing classes. Supported view attributes are ``filter_backends``, ``permission_classes``, ``authentication_classes``, ``throttle_classes``, ``renderer_classes`` and ``parser_classes``. List of meta-attributes for settings of view is looks like:
ru: Как правило, вы также можете добавить другие атрибуты для переопределения или расширения списка классов обработки по умолчанию. Поддерживаются ``filter_backends``, ``permission_classes``, ``authentication_classes``, ``throttle_classes``, ``renderer_classes`` и ``parser_classes``. Список мета-атрибутов для настройки выглядит так:

source: ``_pre_{attribute}`` - List of classes included before defaults.
ru: ``_pre_{attribute}`` - Список классов, включаемых до классов по умолчанию.

source: ``_{attribute}`` - List of classes included after defaults.
ru: ``_{attribute}`` - Список классов, включаемых после классов по умолчанию.

source: ``_override_{attribute}`` - boolean flag indicates that attribute override default viewset (otherwise appends). Default is ``False``.
ru: ``_override_{attribute}`` - булев флаг, указывающий, что атрибут переопределяет стандартный viewset (в противном случае расширяет). По умолчанию: ``False``.

source: You may need to create an `action <https://www.django-rest-framework.org/api-guide/viewsets/#marking-extra-actions-for-routing>`_ on generated view. Use :class:`vstutils.models.decorators.register_view_action` decorator with the ``detail`` argument to determine applicability to a list or detail entry. In this case, the decorated method will take an instance of the view object as ``self`` attribute.
ru: Возможно, вам потребуется создать `экшен <https://www.django-rest-framework.org/api-guide/viewsets/#marking-extra-actions-for-routing>`_ в сгенерированном view. Используйте декоратор :class:`vstutils.models.decorators.register_view_action` с аргументом ``detail``, чтобы применить его к списку или детальной записи. В этом случае декорированный метод будет принимать экземпляр view в ``self``.

source: In some cases, inheriting models may require to inherit Meta class from the base model. If the Meta is explicitly declared in the base class, then you can get it through the attribute `OriginalMeta` and use it for inheritance.
ru: В некоторых случаях, наследование модели может также требовать наследования класса Meta базовой модели. Если Meta явно объявлен в базовом классе, то вы можете получить его с помощью атрибута `OriginalMeta` и использовать его для наследования.

source: Docstring of model will be reused for view descriptions. It is possible to write both a general description for all actions and description for each action using the following syntax:
ru: Строка документации модели будет переиспользована для описания view. Есть возможность сделать общее описание для всех экшенов и описание для каждого отдельно, используя следующий синтаксис:

source: The ``get_view_class()`` method is a utility method in the Django ORM model designed to facilitate the configuration and instantiation of Django Rest Framework (DRF) Generic ViewSets. It allows developers to define and customize various aspects of the associated DRF view class. The arguments passed to the function fully correspond to those specified earlier for the ``Meta`` class of the model, but without the underscore prefix.
ru: Метод ``get_view_class()`` — это служебный метод в ORM Django моделях, предназначенный для облегчения настройки и создания экземпляров представлений Django Rest Framework (DRF). Это позволяет разработчикам определить и настроить различные аспекты класса представления DRF.Аргументы, переданные в функцию, полностью соответствуют тем, которые были указаны ранее для класса ``Meta`` модели, но без префикса подчёркивания.

source: Developers can use this method to customize various aspects of the associated view, such as serializer classes, field configurations, filter backends, permission classes, etc. It uses attributes declared in meta attributes, but allows individual parts to be overriden.
ru: Разработчики могут использовать этот метод для изменения различных аспектов получаемого представления, таких как классы сериализаторов, конфигурацию полей, фильтры,классы разрешений и т.п. Этот метод использует такие же атрибуты, которые были объявлены в мета-атрибутах, но позволяет перегружать отдельные части.

source: An important aspect that distinguishes ``get_view_class()`` is the ``ignore_meta`` argument. It takes ``True`` when it's necessary to completely ignore the values set in the model's ``Meta`` class. This allows ``get_view_class()`` to generate a fully independent view.
ru: Важным аспектом, который отличает ``get_view_class()``, является аргумент ``ignore_meta``. Он принимает значение ``True``, когда необходимо полностью игнорировать значения, установленные в классе ``Meta`` модели. Это позволяет ``get_view_class()`` создать полностью независимое представление.

source: If hidden is set to True, entry will be excluded from query in BQuerySet.
ru: Если hidden установлено в True, вхождение будет исключено из запроса в BQuerySet.

source: Primary field for select and search in API.
ru: Первичное поле для выборки и поиска в API.

source: Default VSTUtils manager. Used by `BaseModel` and `BModel`. Uses `BQuerySet` as base.
ru: Стандартный VSTUtils-менеджер. Используется классами `BaseModel` и `BModel`. Использует `BQuerySet` в качестве базового.

source: Represent a lazy database lookup for a set of objects. Allows to override default iterable class by `custom_iterable_class` attribute (class with `__iter__` method which returns generator of model objects) and default query class by `custom_query_class` attribute (class inherited from :class:`django.db.models.sql.query.Query`).
ru: Представляет ленивый поиск в базе данных множества объектов. Позволяет перегрузить итерируемый класс по умолчанию с помощью атрибута `custom_iterable_class` (класс с методом `__iter__`, возвращающий генератор объектов модели) и стандартный класс запроса с помощью атрибута `custom_query_class` (дочерний класс :class:`django.db.models.sql.query.Query`).

source: Filter queryset for models with attribute 'hidden' and exclude all hidden objects.
ru: Фильтрует queryset для моделей с атрибутом `hidden`, исключая все скрытые объекты.

source: Returns initialized object of :class:`vstutils.utils.Paginator` over current instance's QuerySet. All args and kwargs go to to Paginator's constructor.
ru: Возвращает инициализированные объекты класса :class:`vstutils.utils.Paginator` через текущий экземпляр QuerySet. Все аргументы и (args) и именованные аргументы (kwargs) попадают в конструктор класса Paginator.

source: Returns paginated data with custom Paginator-class. Uses `PAGE_LIMIT` from global settings by default.
ru: Возвращает разбитые на страницы данные при помощи пользовательского класса Paginator. Используйте `PAGE_LIMIT` из глобальных настроек по умолчанию.

source: Decorator for turning model methods to generated view `actions <https://www.django-rest-framework.org/api-guide/viewsets/#marking-extra-actions-for-routing>`_. When a method is decorated, it becomes a part of the generated view and the `self` reference within the method points to the view object. This allows you to extend the functionality of generated views with custom actions.
ru: Декоратор для превращения методов модели в сгенерированные view `экшены <https://www.django-rest-framework.org/api-guide/viewsets/#marking-extra-actions-for-routing>`_. Когда метод декорируется, он становится частью сгенерированного view, и ссылка `self` внутри метода указывает на объект view. Это позволяет расширять функциональность сгенерированных view с помощью пользовательских экшенов.

source: The `register_view_action` decorator supports various arguments, and you can refer to the documentation for :func:`vstutils.api.decorators.subaction` to explore the complete list of supported arguments. These arguments provide flexibility in defining the behavior and characteristics of the generated view actions.
ru: Декоратор `register_view_action` поддерживает различные аргументы, и вы можете обратиться к документации для :func:`vstutils.api.decorators.subaction`, чтобы изучить полный список поддерживаемых аргументов. Эти аргументы предоставляют гибкость в определении поведения и характеристик сгенерированных экшенов view.

source: In scenarios where you're working with proxy models that share a common set of actions, you can use the `inherit` named argument with a value of `True`. This allows the proxy model to inherit actions defined in the base model, reducing redundancy and promoting code reuse.
ru: В сценариях, где вы работаете с прокси-моделями, использующими общий набор действий, вы можете использовать именованный аргумент `inherit` со значением `True`. Это позволяет прокси-модели наследовать действия, определенные в базовой модели, сокращая избыточность и способствуя повторному использованию кода.

source: In many cases, an action may not require any parameters and can be executed by sending an empty query. To streamline development and enhance efficiency, the `register_view_action` decorator sets the default serializer to :class:`vstutils.api.serializers.EmptySerializer`. This means that the action expects no input data, making it convenient for actions that operate without additional parameters.
ru: Во многих случаях действие может не требовать параметров и может быть выполнено, отправив пустой запрос. Для упрощения разработки и повышения эффективности декоратор `register_view_action` устанавливает сериализатор по умолчанию на :class:`vstutils.api.serializers.EmptySerializer`. Это означает, что действие не ожидает входных данных, что удобно для действий, которые работают без дополнительных параметров.

source: Example:
ru: Пример:

source: This example demonstrates how to use the decorator to create a custom action within a model view. The ``empty_action`` method becomes part of the generated view and expects no input parameters.
ru: В этом примере показано, как использовать декоратор для создания пользовательского действия в представлении модели. Метод ``empty_action`` становится частью сгенерированного view и не ожидает входных параметров.
