Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/backend.po
Languages: ru

source: Suppose you have a model with a `description` field that can contain multiline text. You can use `TextareaField` in your serializer to enable users to input and view multiline text in the GUI:
ru: Предположим, у вас есть модель с полем `description`, которое может содержать многострочный текст. Вы можете использовать `TextareaField` в вашем сериализаторе, чтобы пользователи могли вводить и просматривать многострочный текст в графическом интерфейсе:

source: Time duration field, in seconds, specifically designed for computing and displaying system uptime.
ru: Поле продолжительности времени, в секундах, специально разработанное для вычисления и отображения времени работы системы.

source: This field is effective only in the GUI and behaves similarly to :class:`rest_framework.fields.IntegerField` in the API.
ru: Это поле действует только в графическом интерфейсе и ведет себя аналогично :class:`rest_framework.fields.IntegerField` в API.

source: The `UptimeField` class transforms time in seconds into a user-friendly representation on the frontend. It intelligently selects the most appropriate pattern from the following templates:
ru: Класс `UptimeField` преобразует время в секундах в удобочитаемое представление на фронтенде. Он интеллектуально выбирает наиболее подходящий шаблон из следующих:

source: ``HH:mm:ss`` (e.g., 23:59:59)
ru: ``HH:mm:ss`` (например, 23:59:59)

source: ``dd HH:mm:ss`` (e.g., 01d 00:00:00)
ru: ``dd HH:mm:ss`` (например, 01d 00:00:00)

source: ``mm dd HH:mm:ss`` (e.g., 01m 30d 00:00:00)
ru: ``mm dd HH:mm:ss`` (например, 01m 30d 00:00:00)

source: ``yy mm dd HH:mm:ss`` (e.g., 99y 11m 30d 22:23:24)
ru: ``yy mm dd HH:mm:ss`` (например, 99y 11m 30d 22:23:24)

source: This example assumes a serializer where the `uptime` field represents a time duration in seconds. The `UptimeField` will then display the duration in a human-readable format on the frontend, making it convenient for users to interpret and input values.
ru: В этом примере предполагается, что сериализатор имеет поле `uptime`, представляющее продолжительность времени в секундах. `UptimeField` затем отобразит продолжительность в удобочитаемом формате на фронтенде, облегчая пользователям интерпретацию и ввод значений.

source: CharField (extends :class:`rest_framework.fields.CharField`). This field translate any json type to string for model.
ru: CharField (расширяет :class:`rest_framework.fields.CharField`). Это поле преобразует любой json в строку для модели.

source: Extends the :class:`.TextareaField` class to render the https://ui.toast.com/tui-editor on the frontend.
ru: Расширяет класс :class:`.TextareaField` для отображения редактора https://ui.toast.com/tui-на фронтенде.

source: This field is specifically designed for rendering a WYSIWYG editor on the frontend, using the https://ui.toast.com/tui-editor. It saves data as markdown and escapes all HTML tags.
ru: Это поле специально разработано для отображения WYSIWYG-редактора на фронтенде с использованием https://ui.toast.com/tui-editor. Сохраняет данные в формате markdown и экранирует все HTML-теги.

source: HTML-escape input. Enabled by default to prevent HTML injection vulnerabilities.
ru: Экранирование HTML-тегов для входных данных. Включено по умолчанию для предотвращения уязвимостей HTML-инъекций.

source: In a serializer, include this field to render a WYSIWYG editor on the frontend:
ru: Включите это поле в сериализаторе, чтобы отобразить WYSIWYG-редактор на фронтенде:

source: This example assumes a serializer where the ``wysiwyg_content`` field represents data to be rendered in a WYSIWYG editor on the frontend. The ``WYSIWYGField`` ensures that the content is saved as markdown and HTML tags are escaped to enhance security.
ru: В этом примере предполагается, что сериализатор имеет поле `wysiwyg_content`, представляющее данные, которые должны быть отображены в WYSIWYG-редакторе на фронтенде. `WYSIWYGField` гарантирует, что содержимое сохраняется в формате markdown, и HTML-теги экранируются для повышения безопасности.

source: Enabling the ``escape`` option is recommended to prevent potential HTML injection vulnerabilities.
ru: Рекомендуется включить опцию ``escape`` для предотвращения потенциальных уязвимостей HTML-инъекций.

source: The rendering on the frontend is achieved using the https://ui.toast.com/tui-editor.
ru: Отображение на фронтенде достигается с использованием https://ui.toast.com/tui-editor.

source: Validators
ru: Валидаторы

source: There are validation classes for fields.
ru: Классы для валидации полей.

source: Base Image Validation class. Validates media types.
ru: Базовый класс для валидации изображений. Проверяет media types.

source: Tuple or List of file extensions, that should pass the validation
ru: Кортеж или список файловых расширений, которые должны проходить проверку.

source: Raises rest_framework.exceptions.ValidationError: in case file extension are not in the list
ru: Выбрасывает rest_framework.exceptions.ValidationError в случае, если расширение файла не присутствует в списке

source: Validates image size. To use this class for validating image width/height, rewrite self.orientation to ('height',) or ('width',) or ('height', 'width')
ru: Проверяет размер изображения. Чтобы использовать этот класс для валидации ширины или высоты, переопределите self.orientation в ('height',), ('width',) или ('height', 'width')

source: Raises rest_framework.exceptions.ValidationError: if not(min <= (height or width) <= max)
ru: Выбрасывает rest_framework.exceptions.ValidationError, если not(min <= (height or width) <= max)

source: Wrapper for ImageBaseSizeValidator that validates only height
ru: Обертка для ImageBaseSizeValidator, проверяющая только высоту

source: minimal height of an image being validated
ru: минимальная валидная высота изображения

source: maximal height of an image being validated
ru: максимальная валидная высота изображения

source: Image validator that checks if image can be unpacked from b64 to PIL Image obj. Won't work if Pillow isn't installed.
ru: Валидатор изображения, который проверяет, может ли изображения быть распаковано из b64 в объект PIL Image. Не будет работать, если не установлен Pillow.

source: Raises rest_framework.exceptions.ValidationError if PIL throws error when trying to open image
ru: Выбрасывает rest_framework.exceptions.ValidationError, если PIL выбрасывает ошибку при попытке открыть изображение

source: Wrapper for ImageBaseSizeValidator that validates both height and width
ru: Обертка для ImageBaseSizeValidator, проверяющая как высоту, так и ширину.

source: minimal width of an image being validated
ru: минимальная валидная ширина изображения

source: maximal width of an image being validated
ru: максимальная валидная ширина изображения

source: Base Image Validation class. Validates image format. Won't work if Pillow isn't installed. Base Image Validation class. Validates media types.
ru: Базовый класс для валидации изображения. Проверяет формат изображения. Не будет работать, если Pillow не установлен. Базовый класс для валидации изображения. Проверяет media types.

source: Check if Pillow is installed
ru: Проверьте, установлен ли Pillow

source: Wrapper for ImageBaseSizeValidator that validates only width
ru: Обертка для ImageBaseSizeValidator, проверяющая только ширину

source: Class for regular expression based validation
ru: Класс для валидации на основе регулярного выражения

source: in case value does not match regular expression
ru: в случае, если значение не соответствует регулярному выражению

source: Class for validation url query string, for example a=&b=1
ru: Класс для валидации строки url query, например a=&b=1

source: Utility function to resize image proportional to specific values. Can create white margins if it's needed to satisfy required size
ru: Вспомогательная функция для изменения размера изображения пропорционально определенным значениям. Может создать белые поля в случае, если это необходимо для удовлетворения требуемого размера

source: Pillow Image object
ru: объект Pillow Image

source: Required width
ru: Необходимая ширина

source: Required height
ru: Необходимая высота

source: Utility function to resize image proportional to values between min and max values for each side. Can create white margins if it's needed to satisfy restrictions
ru: Вспомогательная функция для изменения размера изображения пропорционально значениям между минимальным и максимальным значениями для каждой стороны. Может создать белые поля, если это необходимо для соблюдения ограничений

source: Dict with min/max side restrictions like: ``{'width': {'min': 300, 'max: 600'}, 'height': {'min': 400, 'max: 800'}}``
ru: Словарь с максимальным/минимальным ограничениями, например ``{'width': {'min': 300, 'max: 600'}, 'height': {'min': 400, 'max: 800'}}``

source: Serializers
ru: Сериализаторы

source: Default serializer classes for web-api. Read more in Django REST Framework documentation for `Serializers <https://www.django-rest-framework.org/api-guide/serializers/>`_.
ru: Стандартные классы сериализаторов для web-api. Читайте подробнее в документации сериализаторов Django REST Framework `Serializers <https://www.django-rest-framework.org/api-guide/serializers/>`_.

source: Default serializer with logic to work with objects.
ru: Сериализатор по умолчанию с логикой для работы с объектами.

source: This serializer serves as a base class for creating serializers to work with non-model objects. It extends the 'rest_framework.serializers.Serializer' class and includes additional logic for handling object creation and updating.
ru: Этот сериализатор служит базовым классом для создания сериализаторов для работы с объектами, не являющимися моделями. Он расширяет класс 'rest_framework.serializers.Serializer' и включает дополнительную логику для обработки создания и обновления объектов.

source: You can set the ``generated_fields`` attribute in the ``Meta`` class to automatically include default CharField fields. You can also customize the field creation using the ``generated_field_factory`` attribute.
ru: Вы также можете настроить ``generated_fields`` в атрибуте класса ``Meta``, чтобы получить сериализатор с полями CharField по умолчанию. Настройте атрибут ``generated_field_factory`` чтобы изменить фабричный метод по умолчанию.

source: In this example, the ``MySerializer`` class extends ``BaseSerializer`` and includes an additional generated field.
ru: В этом примере класс ``MySerializer`` расширяет ``BaseSerializer`` и включает дополнительное созданное поле.

source: Serializer class inheriting from :class:`.BaseSerializer`.
ru: Класс сериализатора, наследующийся от :class:`.BaseSerializer`.

source: This serializer is primarily intended for use as the ``result_serializer_class`` argument in :class:`vstutils.api.actions.Action` and its derivatives. It defines a single read-only ``details`` field, which is useful for returning detail messages in API responses.
ru: Этот сериализатор в первую очередь предназначен для использования в качестве аргумента ``result_serializer_class`` в :class:`vstutils.api.actions.Action` и его производных. Он определяет одно поле только для чтения ``details``, которое полезно для возврата сообщений с деталями в ответах API.

source: Additionally, it can serve as a placeholder for schemas involving various errors, where the error text is placed in the ``details`` field (the default behavior in Django REST Framework).
ru: Кроме того, он может служить в качестве шаблона для схем, связанных с различными ошибками, где текст ошибки помещается в поле ``details`` (это поведение по умолчанию в Django REST Framework).

source: Example usage with an Action:
ru: Пример использования с Action:

source: Enumeration for specifying how a serializer should be displayed on the frontend.
ru: Перечисление для указания того, как сериализатор должен отображаться на фронтенде.

source: This class is used to set the ``_display_mode`` property in a serializer to control its UI behavior.
ru: Этот класс используется для установки свойства ``_display_mode`` в сериализаторе для управления его поведением в пользовательском интерфейсе.

source: To set the display mode to steps:
ru: Чтобы установить режим отображения в виде последовательных шагов:

source: To use the default display mode:
ru: Чтобы использовать режим отображения по умолчанию:

source: Using `DisplayMode` allows developers to customize the interface based on the workflow needs, making forms and data entry more user-friendly and intuitive.
ru: Использование `DisplayMode` позволяет разработчикам настраивать интерфейс в соответствии с потребностями рабочего процесса, делая формы и ввод данных более удобными и интуитивно понятными.

source: Will be used if no mode provided.
ru: Используется, когда не задано никакого режима.

source: Each properties group displayed as separate tab. On creation displayed as multiple steps.
ru: Каждая группа параметров отображается на раздельных вкладках. При создании выглядит как пошаговый мастер.

source: Enumeration for specifying how a list serializer should be displayed on the frontend.
ru: Перечисление для указания того, как сериализатор списка должен отображаться на фронтенде.

source: This class is used to set the ``_display_mode_list`` property in a list serializer to control its UI behavior when dealing with multiple instances.
ru: Этот класс используется для установки свойства ``_display_mode_list`` в сериализаторе списка для управления его поведением в пользовательском интерфейсе при работе с несколькими экземплярами.

source: To set the list display mode to table view:
ru: Чтобы установить режим отображения списка в виде таблицы:

source: To use the default list display mode ensure that class doesn't have ``_display_mode_list`` class property or set value to ``DisplayModeList.DEFAULT``.
ru: Чтобы использовать режим отображения списка по умолчанию, убедитесь, что класс не содержит свойства ``_display_mode_list`` или установите значение в ``DisplayModeList.DEFAULT``.

source: `DisplayModeList` enables developers to tailor the appearance of list serializers, ensuring that users can interact with multiple data entries effectively in the interface.
ru: `DisplayModeList` позволяет разработчикам настраивать внешний вид сериализаторов списка, обеспечивая эффективное взаимодействие пользователей с несколькими записями данных в интерфейсе.

source: It will be displayed as a standard list of JSON objects.
ru: Будет отображаться как стандартный список объектов JSON.

source: It will be displayed as a table view.
ru: Будет отображаться в виде таблицы.

source: Default serializer for empty responses. In generated GUI this means that action button won't show additional view before execution.
ru: Стандартный сериализатор для пустых ответов. В сгенерированном графическом интерфейсе это означает, что кнопка действия не будет отображать дополнительного view перед запуском.

source: Default model serializer based on :class:`rest_framework.serializers.ModelSerializer`. Read more in `DRF documentation <https://www.django-rest-framework.org/api-guide/serializers/#modelserializer>`_ how to create Model Serializers. This serializer matches model fields to extended set of serializer fields.
ru: Сериализатор модели по умолчанию, основанный на :class:`rest_framework.serializers.ModelSerializer`. Узнайте больше в `документации DRF <https://www.django-rest-framework.org/api-guide/serializers/#modelserializer>`_ о том, как создавать сериализаторы модели. Этот сериализатор сопоставляет поля модели с расширенным набором полей сериализатора.

source: List of available pairs specified in `VSTSerializer.serializer_field_mapping`. For example, to set :class:`vstutils.api.fields.FkModelField` in serializer use :class:`vstutils.models.fields.FkModelField` in a model.
ru: Список доступных пар, указанных в `VSTSerializer.serializer_field_mapping`. Например, чтобы установить :class:`vstutils.api.fields.FkModelField` в сериализаторе, используйте :class:`vstutils.models.fields.FkModelField` в модели.

source: In this example, the ``MySerializer`` class extends ``VSTSerializer`` and is associated with the ``MyModel`` model.
ru: В этом примере класс ``MySerializer`` расширяет ``VSTSerializer`` и ассоциируется с моделью ``MyModel``.

source: Views
ru: Представления

source: VSTUtils extends the standard behavior of ViewSets from Django REST Framework (DRF) by providing built-in mechanisms for managing model views that cater to the most commonly encountered development patterns. This framework enhancement simplifies the process of creating robust and scalable web applications by offering a rich set of tools and utilities that automate much of the boilerplate code required in API development. Through these extensions, developers can easily implement custom business logic, data validation, and access control with minimal effort, thus significantly reducing development time and improving code maintainability.
ru: VSTUtils расширяет стандартное поведение ViewSets из Django REST Framework (DRF), предоставляя встроенные механизмы для управления представлениями моделей, которые удовлетворяют наиболее часто встречающимся паттернам разработки. Это улучшение фреймворка упрощает процесс создания надежных и масштабируемых веб-приложений, предлагая богатый набор инструментов и утилит, которые автоматизируют большую часть шаблонного кода, необходимого при разработке API. Благодаря этим расширениям, разработчики могут легко реализовать пользовательскую бизнес-логику, валидацию данных и контроль доступа с минимальными усилиями, тем самым значительно сокращая время разработки и улучшая поддерживаемость кода.

source: Mixin for viewsets which adds `copy` endpoint to view.
ru: Миксина для viewset'ов, добавляющая `copy` endpoint во view.

source: Endpoint which copy instance with deps.
ru: Endpoint, который копирует экземпляр с его зависимостями.

source: Name of field which will get a prefix.
ru: Имя поля, которое получит префикс.

source: Value of prefix which will be added to new instance name.
ru: Значение префикса, которое будет добавлено к новому имени экземпляра.

source: List of related names which will be copied to new instance.
ru: Список связанных имен, которые будут скопированы в новый экземпляр.

source: ViewSet mixin for retrieving FileResponse from models with file fields data.
ru: Миксина ViewSet для получения FileResponse из моделей с файловыми полями.

source: The base class for all views. Extends the standard features of the DRF class. Here are some of the possibilities:
ru: Базовый класс для всех view. Расширяет стандартные функции классов DRF. Здесь представлены некоторые из возможностей:

source: Provides ``model`` attribute instead of ``queryset``.
ru: Предоставляет атрибуты ``model`` вместо ``queryset``.

source: Provides to set serializers for each action separately through a dictionary ``action_serializers`` or attributes starting with ``serializer_class_[action name]``.
ru: Позволяет устанавливать сериализаторы отдельно для каждого экшена через словарь ``action_serializers`` или атрибуты, имя которых соответствует шаблону ``serializer_class_[action name]``.

source: Provides to specify a serializer for lists and detail views separately.
ru: Позволяет отдельно указать сериализаторы для view списков и детальной записи.

source: Optimizes the database query for GET requests, if possible, by selecting only the fields necessary for the serializer.
ru: Оптимизирует запросы в базу данных для GET-запросов, делая выборку, если возможно, только тех полей, которые нужны сериализатору.

source: A method that implements the standard logic for actions. It relies on the passed arguments to build logic. So, if the named argument data was passed, then the serializer will be validated and saved.
ru: Метод, реализующий стандартную логику экшенов. Он опирается на переданные аргументы для построения логики. Поэтому, если был передан именованный аргумент, сериализатор будет подвержен валидации и сохранен.

source: Enables/disables the execution of saving by the serializer if named argument `data` passed. Enabled by default.
ru: Включает/выключает выполнение сохранения сериализатором, если передан именованный аргумент `data`. Включено по умолчанию.

source: Dict with data which will passed to `validated_data` without validation.
ru: Словарь с данными, которые будут переданы в `validated_data` без валидации.

source: Serializer class for this execution. May be useful when request and response serializers are different.
ru: Класс сериализатора для текущего выполнения. Может быть полезно, когда сериализаторы запроса и ответа различны.

source: param
ru: параметр

source: data: Default serializer class argument with serializable data. Enables validation and saving.
ru: data: Стандартный аргумент класса сериализатора с сериализуемыми данными. Включает в себя валидацию и сохранение.

source: instance: Default serializer class argument with serializable instance.
ru: instance: Стандартный аргумент класса сериализатора с сериализуемым экземпляром.

source: Ready serializer with default logic performed.
ru: Готовый сериализатор с логикой выполнения по умолчанию.

source: Get request query data and serialize values if `query_serializer_class` attribute exists or attribute was send.
ru: Позволяет получить данные запроса и сериализовать значения, если существует атрибут `query_serializer_class` или атрибут был передан.

source: DRF request object.
ru: объект DRF запроса.

source: serializer class for processing parameters in query_params.
ru: класс сериализатора, для обработки параметров в query_params.

source: flag that indicates whether an exception should be thrown during validation in the serializer or not.
ru: флаг, который говорит о том нужно ли выбросить исключение при валидации в сериализаторе или нет.

source: Return the serializer instance that should be used for validating and deserializing input, and for serializing output.
ru: Возвращает экземпляр сериализатора, который должен быть использован для валидации и десериализации входных данных, и сериализации выходных данных.

source: Provide to use :class:`django.http.StreamingHttpResponse` as serializer init.
ru: Позволяет использовать :class:`django.http.StreamingHttpResponse` в качестве инициализации сериализатора.

source: Provides to setup serializer class for each action.
ru: Позволяет задать класс сериализатора для каждого экшена.

source: Just raise or pass. Used for nested views for easier access checking.
ru: Просто выбросьте исключение или пропустите (pass). Используется во вложенных view для упрощения проверки доступа.

source: Default viewset like ReadOnlyModelViewSet but for historical data (allow to delete, but can't create and update). Inherited from :class:`.GenericViewSet`.
ru: Стандартный viewset, как, например ReadOnlyModelViewSet, но для данных исторического характера (позволяет удалять записи, но не создавать или обновлять). Наследуется от :class:`.GenericViewSet`.

source: A viewset that provides CRUD actions under model. Inherited from :class:`.GenericViewSet`.
ru: Viewset, предоставляющий CRUD-экшены над моделью. Наследуется от :class:`.GenericViewSet`.

source: DB model with data.
ru: Модель БД с данными.

source: Serializer for view of Model data.
ru: Сериализатор для view данных модели.

source: Serializer for view one instance of Model data.
ru: Сериализатор для view одного экземпляра данных модели.

source: Serializer for view of any endpoint like `.create`.
ru: Сериализатор для view любого endpoint'а, например `.create`.

source: Default viewset like vstutils.api.base.ModelViewSet for readonly models. Inherited from :class:`.GenericViewSet`.
ru: Стандартный viewset, как, например vstutils.api.base.ModelViewSet для readonly-моделей. Наследуется от :class:`.GenericViewSet`.
