Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/backend.po
Languages: ru

source: Handlers for some models like 'INTEGRATIONS' or 'REPO_BACKENDS'. Based on :class:`.ObjectHandlers` but more specific for working with models. All handlers backends get by first argument model object.
ru: Обработчики для некоторых моделей, таких как 'INTEGRATIONS' или 'REPO_BACKENDS'. Основан на :class:`.ObjectHandlers`, но больше сосредоточен на работе с моделями. Все handler-бэкенды получают объект модели по первому аргументу.

source: **Attributes**:
ru: **Атрибуты**:

source: -- dict of objects like: ``{<name>: <backend_class>}``
ru: -- словарь объектов, например ``{<name>: <backend_class>}``

source: -- names of supported backends
ru: -- имена поддерживаемых бэкендов

source: -- supported backends classes
ru: -- поддерживаемые классы бэкендов

source: type name for backends.Like name in dict.
ru: Имя для бэкенда, наподобие ключа в словаре.

source: -- string name of backend
ru: -- строковое имя бэкенда

source: -- model object
ru: -- объект модели

source: backend object
ru: объект бэкенда

source: Handlers wrapper for get objects from some settings structure.
ru: Обертка обработчиков для получения объектов из некоторой структуры настроек.

source: Get backend class
ru: Получить класс бэкенда

source: -- name of backend type
ru: -- имя типа бэкенда

source: class of backend
ru: класс бэкенда

source: Class for fragmenting the query for small queries.
ru: Класс для разбиения запроса на небольшие запросы.

source: Secured pickle wrapper by Vigenère cipher.
ru: Защищенная pickle-обертка с использованием шифра Виженера.

source: Do not use it with untrusted transport anyway.
ru: В любом случае не используйте его с ненадежным средством передачи.

source: Object handler for GUI views. Uses `GUI_VIEWS` from settings.py. Based on :class:`.ObjectHandlers` but more specific to urlpatterns.
ru: Обработчик объекта для views в графическом интерфейсе. Использует `GUI_VIEWS` из settings.py. Основан на :class:`.ObjectHandlers`, но больше сосредоточен на urlpatterns.

source: Get url object tuple for urls.py
ru: Получить объект кортежа url'ов для urls.py

source: url regexp from
ru: регулярное выражение url'а

source: overridden args
ru: переопределенные аргументы

source: overridden kwargs
ru: переопределенные kwarg'и

source: url object
ru: объект url'а

source: Class based on :class:`.Executor` but disables `working_handler`.
ru: Класс, основанный на :class:`.Executor`, но с выключенным `working_handler`.

source: Adds provided value to Vary header if not added already
ru: Добавляет указанное значение в заголовок Vary, если оно еще не добавлено

source: Decorator which apply list of decorators on method or class.
ru: Декоратор, оборачивающий метод или класс в список декораторов.

source: Decorator which makes class method as class property.
ru: Декоратор, который из метода класса делает классовый property.

source: function for getting an attribute value.
ru: Функция для получения значения атрибута.

source: function for setting an attribute value.
ru: Функция для установки значения атрибута.

source: A simple function for getting the generated view by standard means, but with overloaded meta-parameters. This method can completely get rid of the creation of proxy models.
ru: Простая функция для получения сгенерированного view стандартными средствами, но с перегруженными мета-параметрами. Этот метод позволяет полностью отказаться от создания прокси-моделей.

source: This method is also recommended in cases where there is a problem of recursive imports.
ru: Данный метод также рекомендуется применять в случаях, когда имеются проблемы с рекурсивными импортами.

source: This function is oldstyle and will be deprecated in future versions. Use native call of method :meth:`vstutils.models.BModel.get_view_class`.
ru: Эта функция олдскульная и будет объявлена устаревшей в будущих версиях. Используйте встроенный вызов метода :meth:`vstutils.models.BModel.get_view_class`.

source: Model class with `.get_view_class` method. This method also has :class:`vstutils.models.BModel`.
ru: Класс модели с методом `.get_view_class`. Этот метод также имеет :class:`vstutils.models.BModel`.

source: Decode string from encoded by Vigenère cipher.
ru: Декодировать строку из закодированной шифром Виженера.

source: -- secret key for encoding
ru: -- секретный ключ для кодирования

source: -- encoded string for decoding
ru: -- закодированная строка для декодирования

source: -- decoded string
ru: -- декодированная строка

source: This is a decorator which can be used to mark functions as deprecated. It will result in a warning being emitted when the function is used.
ru: Данный декоратор может быть использован, чтобы пометить функцию как устаревшую. После этого ее вызов приведет к выдаче соответствующего предупреждения.

source: any callable that will be wrapped and will issue a deprecation warning when called.
ru: любой вызываемый объект, который будет обернут и выдаст предупреждение об устаревании при вызове.

source: Encode string by Vigenère cipher.
ru: Закодировать строку шифром Виженера.

source: -- clear value for encoding
ru: -- чистое значение для кодирования

source: -- encoded string
ru: -- закодированная строка

source: Render string from template.
ru: Рендеринг строки из шаблона.

source: -- full template name
ru: -- полное название шаблона

source: -- dict of rendered vars
ru: -- словарь переменных для рендеринга

source: -- translation for render. Default 'en'.
ru: -- перевод для рендера. По умолчанию 'en'.

source: -- rendered string
ru: -- отрендеренная строка

source: The ``lazy_translate`` function has the same behavior as :func:`.translate`, but wraps it in a lazy promise.
ru: Функция ``lazy_translate`` имеет то же поведение, что и :func:`.translate`, но оборачивает его в lazy promise.

source: This is very useful, for example, for translating error messages in class attributes before the language code is known.
ru: Это полезно, например, для перевода сообщений об ошибках в атрибутах класса, когда целевой язык еще неизвестен.

source: Text message which should be translated.
ru: Текстовое сообщение, которое должно быть переведено.

source: Method to create django model choices from flat list of values.
ru: Метод, предназначенный для создания django-модели choices из плоского списка значений.

source: list of flat values.
ru: плоский список значений.

source: casting type of returned mapping
ru: тип приведения возвращаемого сопоставления

source: list of tuples from `items_list` values
ru: список кортежей из значений `items_list`

source: Decorator for functions where 'pk' kwarg exist for lock by id.
ru: Декоратор для функций, где kwarg 'pk' существует для блокировки по id.

source: On locked error raised ``Lock.AcquireLockException``
ru: В случае ошибки блокировки выбрасывает ``Lock.AcquireLockException``

source: Method must have and called with ``pk`` named arg.
ru: Метод должен иметь и быть вызван вместе с именованным аргументом ``pk``.

source: Context for exclude exceptions.
ru: Контекст для игнорирования исключений.

source: Context for exclude errors and return default value.
ru: Контекст для предотвращения исключений и возврата значения по умолчанию.

source: Helper function that raises an `ImproperlyConfigured` exception if a condition is not met.
ru: Вспомогательная функция, которая вызывает исключение `ImproperlyConfigured`, если условие не выполнено.

source: This function acts as a replacement for the `assert` statement, providing clearer error handling in cases where the application configuration is incorrect.
ru: Эта функция заменяет оператор `assert`, обеспечивая более четкую обработку ошибок в случаях, когда конфигурация приложения неверна.

source: A value of any type that can be evaluated as a boolean. If the boolean evaluation returns False, the exception will be raised.
ru: Значение любого типа, которое может быть оценено как логическое. Если логическая оценка возвращает False, будет вызвано исключение.

source: An optional message to include in the exception. If not provided, the exception will be raised without a message.
ru: Необязательное сообщение, которое будет включено в исключение. Если оно не указано, исключение будет вызвано без сообщения.

source: Raised if the boolean evaluation of the `ok` parameter is False, indicating a misconfiguration in the application.
ru: Вызывается, если логическая оценка параметра `ok` равна False, что указывает на ошибку конфигурации в приложении.

source: This function does not return any value. It either passes silently or raises an exception.
ru: Эта функция не возвращает никакого значения. Она либо выполняется без ошибок, либо вызывает исключение.

source: Context for redirect any output to own stream.
ru: Контекст для перенаправления любого вывода в свой поток.

source: On context returns stream object.
ru: В контексте возвращает объект потока.

source: On exit returns old streams.
ru: При выходе возвращает старые потоки.

source: Wrapper over :func:`django.core.mail.send_mail` which provide additional named arguments.
ru: Обертка над :func:`django.core.mail.send_mail`, предоставляющая дополнительные именованные аргументы.

source: Function executing sync or async email sending; according `sync` argument and settings variable "RPC_ENABLED". If you don't set settings for celery or don't have celery it sends synchronously mail. If celery is installed and configured and `sync` argument of the function is set to `False`, it sends asynchronously email.
ru: Функция, выполняющая синхронную или асинхронную отправку электронной почты в зависимости от аргумента `sync` и переменной настроек "RPC_ENABLED". Вы можете использовать эту функцию для отправки сообщений, она отправляет сообщение асинхронно или синхронно. Если вы не установили настройки для Celery или не установили Celery, она отправляет письмо синхронно. Если установлен и настроен Celery, и аргумент `sync` функции установлен на `False`, она отправляет электронное письмо асинхронно.

source: argument for determining how send email, asynchronously or synchronously
ru: аргумент для определения, как отправлять электронную почту, асинхронно или синхронно.

source: mail subject.
ru: тема письма.

source: list of strings or single string, with email addresses of recipients
ru: список строк или отдельная строка с адресами электронной почты получателей.

source: relative path to template in `templates` directory, must include extension in file name.
ru: относительный путь к шаблону в директории `templates`, должен включать расширение имени файла.

source: dictionary with context for rendering message template.
ru: словарь с контекстом для отображения шаблона сообщения.

source: Function for email sending. The function convert recipient to list and set context before sending if it possible.
ru: Функция для отправки электронной почты. Функция преобразует получателя в список и устанавливает контекст перед отправкой, если это возможно.

source: sender that be setup in email.
ru: адрес отправителя, который будет указан в письме.

source: additional named arguments for `send_mail`
ru: дополнительные именованные аргументы для `send_mail`.

source: Number of emails sent.
ru: Количество отправленных электронных писем.

source: Temporary file with name generated and auto removed on close.
ru: Временный файл с сгенерированным и автоматически именем и удаленный по закрытии

source: -- string to write in tmp file.
ru: -- строка для записи во временный файл.

source: -- file open mode. Default 'w'.
ru: -- режим открытия файла. По умолчанию `w`.

source: -- buffer size for tempfile.NamedTemporaryFile
ru: -- размер буфера для tempfile.NamedTemporaryFile.

source: -- other kwargs for tempfile.NamedTemporaryFile
ru: -- другие именованные аргументы для tempfile.NamedTemporaryFile.

source: Write to file and flush
ru: Записать в файл и очистить буфер

source: -- writable string
ru: -- записываемая строка

source: Context object for work with tmp_file. Auto close on exit from context and remove if file still exist.
ru: Объект контекста для работы с tmp_file. Автоматическое закрывается при выходе из контекста и удаляется файл, если он все еще существует.

source: This context manager over :class:`.tmp_file`
ru: Данный менеджер контекста работает с :class:`.tmp_file`

source: The ``translate`` function supports translation message dynamically with standard i18n vstutils'es mechanisms usage.
ru: Функция ``translate`` поддерживает динамический перевод сообщения с использованием стандартных механизмов i18n в vstutils.

source: Uses :func:`django.utils.translation.get_language` to get the language code and tries to get the translation from the list of available ones.
ru: Использует функцию :func:`django.utils.translation.get_language` для получения кода языка и пытается получить перевод из списка доступных.

source: Integrating Web Push Notifications
ru: Интеграция Web Push-уведомлений

source: Web push notifications are an effective way to engage users with real-time messaging. To integrate web push notifications in your VSTUtils project, follow these steps:
ru: Web-уведомления - это эффективный способ взаимодействия с пользователями с помощью реального времени. Чтобы интегрировать web-уведомления в ваш проект VSTUtils, выполните следующие шаги:

source: **Configuration**: First, include the ``vstutils.webpush`` module in the ``INSTALLED_APPS`` section of your ``settings.py`` file. This enables the web push functionality provided by VSTUtils. Additionally, configure the necessary settings as described in the web push settings section (see :ref:`here<webpush-settings>` for details).
ru: **Конфигурация**: Во-первых, включите модуль ``vstutils.webpush`` в разделе ``INSTALLED_APPS`` вашего файла ``settings.py``. Это позволяет использовать функциональность web-уведомлений, предоставляемую VSTUtils. Кроме того, настройте необходимые параметры, как описано в разделе настроек web-уведомлений (см. :ref:`здесь<webpush-settings>` для подробностей).

source: **Creating Notifications**: To create a web push notification, you need to define a class that inherits from either :class:`vstutils.webpush.BaseWebPush` or :class:`vstutils.webpush.BaseWebPushNotification`. VSTUtils automatically detects and utilizes web push classes defined in the ``webpushes`` module of all ``INSTALLED_APPS``. Below is an example that illustrates how to implement custom web push classes:
ru: **Создание уведомлений**: Чтобы создать web-уведомление, вам нужно определить класс, который наследуется от :class:`vstutils.webpush.BaseWebPush` или :class:`vstutils.webpush.BaseWebPushNotification`. VSTUtils автоматически обнаруживает и использует классы web-уведомлений, определенные в модуле ``webpushes`` всех ``INSTALLED_APPS``. Ниже приведен пример, иллюстрирующий, как реализовать пользовательские классы web-уведомлений:

source: This example contains three classes:
ru: Этот пример содержит три класса:

source: `TestWebPush`: Sends notifications to all subscribed users.
ru: `TestWebPush`: Отправляет уведомления всем подписанным пользователям.

source: `TestNotification`: Targets notifications to specific users.
ru: `TestNotification`: Направляет уведомления конкретным пользователям.

source: `StaffOnlyNotification`: Restricts notifications to staff users only. Sometimes you may want to allow only some users to subscribe on specific notifications.
ru: `StaffOnlyNotification`: Ограничивает уведомления только для сотрудников. Иногда вы можете хотеть разрешить подписку на конкретные уведомления только некоторым пользователям.

source: **Sending Notifications**: To dispatch a web push notification, invoke the ``send`` or ``send_in_task`` method on an instance of your web push class. For instance, to send a notification using `TestNotification`, you can do the following:
ru: **Отправка уведомлений**: Чтобы отправить web-уведомление, вызовите метод ``send`` или ``send_in_task`` на экземпляре вашего класса web-уведомления. Например, чтобы отправить уведомление с использованием `TestNotification`, вы можете сделать следующее:

source: The asynchronous sending of web push notifications (using methods like ``send_in_task``) requires a configured Celery setup in your project, as it relies on Celery tasks "under the hood". Ensure that Celery is properly set up and running to utilize asynchronous notification dispatching.
ru: Асинхронная отправка web-уведомлений (с использованием методов, таких как ``send_in_task``) требует настроенной конфигурации Celery в вашем проекте, поскольку она полагается на задачи Celery "под капотом". Убедитесь, что Celery правильно настроен и работает, чтобы использовать асинхронную отправку уведомлений.

source: By following these steps, you can fast integrate and utilize web push notifications in projects with VSTUtils.
ru: Следуя этим шагам, вы быстро сможете интегрировать и использовать web-уведомления в проектах с VSTUtils.

source: Troubleshooting
ru: Устранение и поиск неисправностей

source: Vstutils makes some errors more readable for common users and provides special error codes for administration to simplify troubleshooting.
ru: Vstutils делает некоторые ошибки более читаемыми для обычных пользователей и предоставляет специальные коды ошибок для администрации, чтобы упростить поиск и устранение проблем.

source: ``VE100-VE199`` - Database related errors.
ru: ``VE100-VE199`` - Ошибки, связанные с базой данных.

source: ``VE100`` - Integrity error code. Used when ``django.db.utils.IntegrityError`` appears.
ru: ``VE100`` - Код ошибки целостности. Используется при появляении ``django.db.utils.IntegrityError``.
