Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/backend.po
Languages: ru

source: Transactional (all operations in one transaction)
ru: Транзакционный (все операции в одной транзакции)

source: Synchronous (operations executed one by one in given order)
ru: Синхронный (операции выполняются одна за другой в указанном порядке)

source: NO
ru: НЕТ

source: YES
ru: ДА

source: Parameters of one operation (required parameter marked by :superscript:`*`):
ru: Параметры одной операции (обязательный параметр помечается :superscript:`*`):

source: ``method``:superscript:`*` - http method of request
ru: ``method``:superscript:`*` - http-метод запроса

source: ``path``:superscript:`*` - path of request, can be ``str`` or ``list``
ru: ``path``:superscript:`*` - путь запроса, может быть типа ``str`` или ``list``

source: ``data`` - data to send
ru: ``data`` - данные для отправки

source: ``query`` - query parameters as ``str``
ru: ``query`` - query-параметры типа ``str``

source: ``let`` - string with name of variable (used for access to response result in templates)
ru: ``let`` - строка с именем переменной (используется для доступа к результату ответа в шаблонах)

source: ``headers`` - ``dict`` with headers which will be sent (key - header's name, value - header's value string).
ru: ``headers`` - словарь с заголовками, которые будут переданы в запрос (ключ - имя заголовка, значение - строка со значением заголовка.

source: ``version`` - ``str`` with specified version of api, if not provided then ``VST_API_VERSION`` will be used
ru: ``version`` - ``str`` с указанной версией api, если не задано, то используется ``VST_API_VERSION``

source: In previous versions header's names must follow `CGI specification <https://www.w3.org/CGI/>`_ (e.g., ``CONTENT_TYPE``, ``GATEWAY_INTERFACE``, ``HTTP_*``)
ru: В предыдущих версиях имена заголовков должны были соответствовать `спецификации CGI <https://www.w3.org/CGI/>`_ (например, ``CONTENT_TYPE``, ``GATEWAY_INTERFACE``, ``HTTP_*``).

source: Since version 5.3 and after migrate to Django 4 names must follow HTTP specification instead of CGI.
ru: Начиная с версии 5.3 и после миграции на Django 4 имена должны соответствовать HTTP спецификации вместо CGI.

source: In any request parameter you can insert result value of previous operations (``<<{OPERATION_NUMBER or LET_VALUE}[path][to][value]>>``), for example:
ru: В любой параметр запроса вы можете вставить результат значения предыдущей операции (``<<{OPERATION_NUMBER or LET_VALUE}[path][to][value]>>``), например:

source: Result of bulk request is json list of objects for operation:
ru: Результат bulk-запроса - это список json-объектов, описывающих операцию:

source: ``method`` - http method
ru: ``method`` - http-метод

source: ``path`` - path of request, always str
ru: ``path`` - путь запроса, всегда строка

source: ``data`` - data that needs to be sent
ru: ``data`` - данные, которые нужно отправить

source: ``status`` - response status code
ru: ``status`` - код состояния ответа

source: Transactional bulk request returns ``502 BAG GATEWAY`` and does rollback after first failed request.
ru: Транзакционный bulk-запрос возвращает ``502 BAG GATEWAY`` и делает откат к состоянию до запроса после первого неудачного запроса.

source: If you send non-transactional bulk request, you will get ``200`` status and must validate statuses on each operation responses.
ru: Если вы отправили нетранзакционный bulk-запрос, вы получите код 200 и должны будете проверить статус каждого ответа операции отдельно.

source: OpenAPI schema
ru: Схема OpenAPI

source: Request on ``GET /{API_URL}/endpoint/`` returns Swagger UI.
ru: Запрос на ``GET /{API_URL}/endpoint/`` возвращает Swagger UI.

source: Request on ``GET /{API_URL}/endpoint/?format=openapi`` returns OpenAPI schema in json format. Also you can specify required version of schema using ``version`` query parameter (e.g., ``GET /{API_URL}/endpoint/?format=openapi&version=v2``).
ru: Запрос на ``GET /{API_URL}/endpoint/?format=openapi`` возвращает схему OpenAPI в формате json. Также вы можете указать нужную версию схемы, используя query-параметр ``version``

source: To change the schema after generating and before sending to user use hooks. Define one or more function, each taking 2 named arguments:
ru: Для изменения схемы после ее генерации и перед отправкой пользователю используйте хуки. Напишите одну или несколько функций, каждая из которых принимает 2 именованных аргумента:

source: ``request`` - user request object.
ru: ``request`` - объект запроса пользователя.

source: ``schema`` - ordered dict with OpenAPI schema.
ru: ``schema`` - ordered dict, содержащий схему OpenAPI.

source: Sometimes hooks may raise an exception; in order to keep a chain of data modification, such exceptions are handled. The changes made to the schema before the exception however, are saved.
ru: Иногда хуки могут выбросить исключение; чтобы сохранить цепочку модификации данных, такие исключения обрабатываются. Изменения, сделанные в схеме перед выбросом исключения, в любом случае сохраняются.

source: Example hook:
ru: Пример хука:

source: To connect hook(s) to your app add function import name to the ``OPENAPI_HOOKS`` list in ``settings.py``
ru: Чтобы присоединить хук(-и) к вашему приложению, добавьте строку импорта вашей функции в список ``OPENAPI_HOOKS`` в ``settings.py``

source: Testing Framework
ru: Фреймворк для тестирования

source: VST Utils Framework includes a helper in base test case class and improves support for making API requests. That means if you want make bulk request to endpoint you don't need create and init test client, but just need to call:
ru: Фреймворк VST Utils включает в себя хелпер в базовом тест-кейс классе и улучшает поддержку механизма отправки запросов. На практике это означает, что для отправления bulk-запроса на endpoint нет необходимости создавать и инициализировать test client, а можно сразу делать запрос.

source: Creating test case
ru: Создание тест-кейса

source: ``test.py`` module contains test case classes based on :class:`vstutils.tests.BaseTestCase`. At the moment, we officially support two styles of writing tests: classic and simple query wrappers with run check and runtime optimized bulk queries with manual value checking.
ru: Модуль ``test.py`` содержит классы тест-кейсов, основанные на :class:`vstutils.tests.BaseTestCase`. На текущий момент мы официально поддерживаем два подхода к написанию тестов: классический и с помощью оберток запросов с проверкой выполнения и runtime-оптимизацией bulk-запросов с ручной проверкой значений.

source: Simple example with classic tests
ru: Простой пример с классическими тестами

source: For example, if you have api endpoint like ``/api/v1/project/`` and model Project you can write test case like this:
ru: Например, если у вас endpoint вида ``/api/v1/project/`` и модель Project, вы можете написать такой тест:

source: This example demonstrates functionality of default test case class. Default projects are initialized for the fastest and most efficient result. We recommend to divide tests for different entities into different classes. This example demonstrate classic style of testing, but you can use bulks in your test cases.
ru: Этот пример демонстрирует функциональность стандартного тест-кейс класса. Проекты по умолчанию инициализируются для получения наиболее быстрого и эффективного результата. Рекомендуется разбивать тесты на разные сущности в разные классы. В данном примере показан классический подход к тестированию, однако вы можете использовать bulk-запросы в ваших тестах.

source: Bulk requests in tests
ru: Bulk-запросы в тестах

source: Bulk query system is well suited for testing and executing valid queries. Previous example could be rewritten as follows:
ru: Система bulk-запросов хорошо подходит для тестирования и запуска валидных запросов. Предыдущий пример может быть переписан так:

source: In this case, you have more code, but your tests are closer to GUI workflow, because vstutils-projects uses ``/api/endpoint/`` for requests. Either way, bulk queries are much faster due to optimization; Testcase execution time is less comparing to non-bulk requests.
ru: В этом случае хотя мы и получили больше кода, однако тесты стали ближе к процессу использования приложения в графическом интерфейсе, потому что проекты vstutils используют ``/api/endpoint/`` для выполнения запросов. Так или иначе, bulk-запросы выполняются заметно быстрее благодаря оптимизации, которую они выполняют под капотом. Время выполнения теста, в котором используется bulk меньше по сравнению с тестом, использующим стандартный механизм.

source: Test case API
ru: API тест-кейса

source: Main test case class extends :class:`django.test.TestCase`.
ru: Основной тест-кейс класс расширяет :class:`django.test.TestCase`.

source: Fail if the two fields in dicts are unequal as determined by the '==' operator. Checks if first not contains or not equal field in second
ru: Падает, если два поля в словаре не равны по определению оператора '=='. Проверяет первое поле на пустоту и на равенство со вторым полем

source: Calls :func:`len` over ``iterable`` and checks equality with ``count``.
ru: Вызывает :func:`len` через ``iterable`` и проверяет равенство с ``count``.

source: any iterable object which could be sended to :func:`len`.
ru: любой итерируемый объект, который может быть отправлен в :func:`len`.

source: expected result.
ru: ожидаемый результат.

source: error message
ru: сообщение об ошибке

source: Fail if response code is not equal. Message is response body.
ru: Падает, если коды ответа не совпадают. Сообщением явялется тело ответа.

source: response object
ru: объект ответа

source: expected code
ru: ожидаемый код

source: Makes non-transactional bulk request and asserts status code (default is 200)
ru: Делает нетранзакционный bulk-запрос и проверяет код состояния (200 по умолчанию)

source: request data
ru: данные запроса

source: http status to assert
ru: http-статус для проверки

source: named arguments for :meth:`.get_result`
ru: именованные аргументы для :meth:`.get_result`

source: bulk response
ru: bulk-ответ

source: Make transactional bulk request and assert status code (default is 200)
ru: Делает транзакционный bulk-запрос и проверяет код состояния (200 по умолчанию)

source: oAuth2 client id
ru: ID клиента для тестов в oAuth2

source: oAuth2 grant type
ru: Тип авторизации в oAuth2

source: Test for get details of model. If you setup additional named arguments, the method check their equality with response data. Uses :meth:`.get_result` method.
ru: Тест на получение детальной записи модели. При задании дополнительных именованных аргументов метод проверит их на равенство с полученными данными. Использует метод :meth:`.get_result`.

source: url to detail record. For example: ``/api/v1/project/1/`` (where ``1`` is uniq id of project). You can use :meth:`.get_url` for building url.
ru: url детальной записи. Например: ``/api/v1/project/1/`` (где ``1`` - это уникальный идентификатор проекта). Вы можете использовать :meth:`.get_url` для построения url.

source: params that's should be checked (key - field name, value - field value).
ru: параметры для проверки (ключ - имя поля, значение - значение поля).

source: Makes request to endpoint and asserts response status code if specified (default is 200). Uses :meth:`.get_result` method for execution.
ru: Делает запрос на endpoint и проверяет код состояния ответа, если он задан (200 по умолчанию). Использует :meth:`.get_result`.

source: http request method
ru: метод http-запроса

source: dict with query data (working only with `get`)
ru: словарь с данными query (работает только с `get`)

source: Make request to schema. Returns dict with swagger data.
ru: Делает запрос на схему. Возвращает словарь с данными swagger.

source: API version for schema parser.
ru: Версия API для парсера схемы.

source: Simple wrapper over :meth:`.get_model_filter` which returns counter of items.
ru: Простая обертка над :meth:`.get_model_filter`, возвращающая счетчик объектов.

source: string which contains model name (if attribute ``model`` is set to the test case class), module import, ``app.ModelName`` or :class:`django.db.models.Model`.
ru: строка, содержащая имя модели (если атрибут ``model`` установлен в класс тест-кейса), импорт модуля, ``app.ModelName`` или :class:`django.db.models.Model`.

source: named arguments to :meth:`django.db.models.query.QuerySet.filter`.
ru: именованные аргументы для :meth:`django.db.models.query.QuerySet.filter`.

source: number of instances in database.
ru: количество объектов в базе данных.

source: Getting model class by string or return model arg.
ru: Получение класса модели по строке или получение аргумента модели.

source: Model class.
ru: Класс модели.

source: Simple wrapper over :meth:`.get_model_class` which returns filtered queryset from model.
ru: Простая обертка над :meth:`.get_model_class`, возвращающая фильтрованный queryset из модели.

source: Executes and tests response code on request with returning parsed result of request. The method uses the following procedure:
ru: Запускает и проверяет код ответа для запроса, возвращает распарсенный результат запроса. Данный метод действует следующим образом:

source: Test client authorization (with :attr:`.user` which creates in :meth:`.setUp`).
ru: Тестирует авторизацию клиента (вместе с :attr:`.user`, который создается в :meth:`.setUp`).

source: Executing a request (sending args and kwargs to request method).
ru: Выполняет запрос (отправляет аргументы и именованные аргументы в метод запроса).

source: Parsing the result (converts json string to python-object).
ru: Парсит результат (конвертирует строку json в объект python).

source: Checking the http status code with :meth:`.assertRCode` (if you have not specified it, the code will be selected in accordance with the request method from the standard set :attr:`.std_codes`).
ru: Проверяет http-код состояния с помощью :meth:`.assertRCode` (если вы его не указали, будет выбран соответствующий код для выполняемого метода из стандартного набора :attr:`.std_codes`).

source: Logout client.
ru: Деавторизация пользователя.

source: Return parsed result.
ru: Возвращение распарсенного результата.

source: request type (methods from Client cls): get, post etc.
ru: тип запроса (методы из Client cls): get, post и т.д.

source: requested url string or tuple for :meth:`.get_url`. You can use :meth:`.get_url` for url building or setup it as full string.
ru: запрошенный url в виде строки или кортежа для :meth:`.get_url`. Вы можете использовать :meth:`.get_url` для построения url или задать его полной строкой.

source: expected return code from request.
ru: ожидаемый код возврата из запроса.

source: execute force login and logout on each call. Default is ``True``.
ru: выполнение авторизации и деавторизации перед каждым вызовом. По умолчанию ``True``.

source: extra-args for Client class request method.
ru: дополнительные аргументы для метода запроса класса Client.

source: extra-kwargs for Client class request method.
ru: дополнительные именованные аргументы для метода запроса класса Client.

source: result of request.
ru: результат запроса.

source: Function for creating url path based on ``VST_API_URL`` and ``VST_API_VERSION`` settings. Without arguments returns path to default version of api.
ru: Функция для создания пути url, основанного на настройках ``VST_API_URL`` и ``VST_API_VERSION``. Без аргументов возвращает путь к версии api по умолчанию.

source: string like ``/api/v1/.../.../`` where ``...`` is args of function.
ru: строка вида ``/api/v1/.../.../`` где ``...`` - аргументы функции.

source: Test for get list of models. Checks only list count. Uses :meth:`.get_result` method.
ru: Тест на получение списка моделей. Проверяет только количество записей. Использует метод :meth:`.get_result`.

source: url to abstract layer. For example: ``/api/v1/project/``. You can use :meth:`.get_url` for building url.
ru: url абстрактного слоя. Например: ``/api/v1/project/``. Вы можете использовать :meth:`.get_url` для построения url.

source: count of objects in DB.
ru: количество объектов в базе данных.

source: Attribute with default project models module.
ru: Атрибут с модулем моделей проекта по умолчанию.

source: Simple :func:`unittest.mock.patch` class-method wrapper.
ru: Простая обертка над :func:`unittest.mock.patch`.

source: This method helps to path default value in the model's field. It's very useful for DateTime fields where :func:`django.utils.timezone.now` is used in defaults.
ru: Этот метод помогает найти значение по умолчанию в поле модели. Он очень полезен для полезен для полей DateTime, где по умолчанию установлено :func:`django.utils.timezone.now`.

source: Simple function which returns uuid1 string.
ru: Простая функция, возвращающая строку uuid1.

source: oAuth2 server class
ru: Класс авторизации для oAuth2

source: Default http status codes for different http methods. Uses in :meth:`.get_result`
ru: Стандартный http-код для различных http-методов. Использует :meth:`.get_result`

source: Context for execute bulk or something as user. The context manager overrides ``self.user`` in TestCase and revert this changes on exit.
ru: Контекст для выполнения bulk или чего-либо еще от некоторого пользователя. Контекстный менеджер переопределяет ``self.user`` в TestCase'е и возвращает изменения после выхода из него.

source: new user object for execution.
ru: новый объект пользователя, от которого будет выполнение.

source: Utils
ru: Утилиты

source: This is tested set of development utilities. Utilities include a collection of code that will be useful in one way or another for developing the application. Vstutils uses mosts of these functions under the hood.
ru: Здесь представлен проверенный набор утилит для разработки. Они включают в себя код, который так или иначе будет полезен по мере разработки. Vstutils использует большинство из этих функций под капотом.

source: BaseEnum extends :class:`enum.Enum` class and used to create enum-like objects that can be used in django serializers or django models.
ru: BaseEnum расширяет класс :class:`enum.Enum` и используется для создания enum-подобных объектов, которые могут использоваться django-сериализаторами или django-моделями.

source: For special cases, when value must be in lower or upper case, you can setup value as ``BaseEnum.LOWER`` or ``BaseEnum.UPPER``. But in default cases we recommend use ``BaseEnum.SAME`` for memory optimization.
ru: вы можете установить значение как ``BaseEnum.LOWER`` или ``BaseEnum.UPPER``. Однако в обычных случаях рекомендуется использовать ``BaseEnum.SAME`` для оптимизации памяти.

source: Default mixin-class for custom objects which needed to get settings and cache.
ru: Стандартная миксина для пользовательских объектов, которым нужны настройки или кэш.

source: Get params from Django settings.
ru: Получить параметры из настроек Django.

source: name of param
ru: название параметра

source: default value of param
ru: значение параметра по умолчанию

source: Param from Django settings or default.
ru: Параметр из настроек Django.

source: Wrapper over `dict` which return JSON on conversion to string.
ru: Обертка над `dict`, возвращающая JSON при преобразовании в строку.

source: Command executor with realtime output write and line handling. By default and by design executor initialize string attribute ``output`` which will be modified by ``+=`` operator with new lines by :meth:`.Executor.write_output` procedure. Override the method if you want change behavior.
ru: Исполнитель команд с выводом и обработкой строк в реальном времени. По умолчанию и замыслу исполнитель инициализирует строковый атрибут ``output``, который будет изменен оператором ``+=`` с новыми строками с помощью метода :meth:`.Executor.write_output`. Переопределите метод, если нужно изменить поведение.

source: Executor class supports periodically (0.01 sec) handling process and execute some checks by overriding :meth:`.Executor.working_handler` procedure method. If you want disable this behavior override the method by None value or use :class:`.UnhandledExecutor`.
ru: Класс исполнителя поддерживает периодеческий (0.01 сек) процесс обработки и выполняет некоторые проверки путем переопределения метода :meth:`.Executor.working_handler`. Если вы хотите отключить это поведение, переопределите метод значением None или используйте :class:`.UnhandledExecutor`.

source: Raised when run() is called with check=True and the process returns a non-zero exit status.
ru: Выбрасывается, когда run() вызывается вместе с check=True и процесс возвращает код возврата отличный от нуля.

source: Attributes:
ru: Атрибуты:

source: Alias for output attribute, to match stderr
ru: Псевдоним для выходного атрибута, чтобы соответствовать stderr

source: Executes commands and outputs its result. Asynchronous implementation.
ru: Выполняет команды и выводит их результат. Асинхронная реализация.

source: -- list of cmd command and arguments
ru: -- список cmd-команд и аргументов

source: -- workdir for executions
ru: -- рабочая директория

source: -- extra environment variables which overrides defaults
ru: -- дополнительные переменные окружения, которые перезаписывают переменные по умолчанию

source: -- string with full output
ru: -- строка, содержащая полный вывод

source: Executes commands and outputs its result.
ru: Выполняет команды и выводит их результат.

source: Runs after execution end.
ru: Запускается после завершения выполнения.

source: -- return code of executed process
ru: -- код возврата выполненного процесса

source: Runs before execution starts.
ru: Запускатеся перед началом выполнения.

source: Additional handler for executions.
ru: Дополнительный обработчик для запусков.

source: running process
ru: запущенный процесс

source: -- line from command output
ru: -- строка вывода команды

source: Class for transmit data using key-value fast (cache-like) storage between services. Uses same cache-backend as Lock.
ru: Класс для передачи данных с использованием быстрого (кэш-подобного) хранилища между сервисами. Использует тот же самый кэш-бэкенд, что и Lock.

source: Lock class for multi-jobs workflow. Based on :class:`.KVExchanger`. The Lock allows only one thread to enter the part that's locked and shared between apps using one locks cache (see also `[locks] <config.html#locks-settings>`_).
ru: Класс Lock предназначен для работы с несколькими задачами. Основан на :class:`.KVExchanger`. Lock позволяет только одному потоку войти в заблокированную и совместно используемую часть между приложениями, использующими один кэш блокировок (см. также `[locks] <config.html#locks-settings>`_).

source: -- unique id for lock.
ru: -- уникальный id блокировки.

source: -- lock additional info. Should be any boolean True value.
ru: -- дополнительная информация о блокировке. Должна быть значением, равным True при приведении к булевому типу.

source: -- time to wait lock.release. Default 1 sec.
ru: -- время ожидания lock.release. По умолчанию 1 секунда.

source: -- message for AcquireLockException error.
ru: -- сообщение для ошибки AcquireLockException.

source: Used django.core.cache lib and settings in `settings.py`
ru: Использует django.core.cache и настройки в `settings.py`

source: Have Lock.SCHEDULER and Lock.GLOBAL id
ru: Имеет Lock.SCHEDULER и Lock.GLOBAL id

source: Another example without context manager:
ru: Другой пример без использования контекстного менеджера:

source: Exception which will be raised on unreleased lock.
ru: Исключение, которое будет выброшено в случае неосвобождения блокировки.
