Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/backend.po
Languages: ru

source: A dictionary where keys are the names of fields from the same model, and values are the names of query filters. If at least one of the fields we depend on is non-nullable, required, and set to null, the autocompletion list will be empty, and the field will be disabled.
ru: Словарь, где ключи - это имена полей из той же модели, а значения - названия query-фильтров. Если хотя бы одно из полей, от которых существует зависимость, не допускает null, обязательно или установлено в null, список автодополнения будет пустым, и поле будет отключено.

source: This functionality is effective only in the GUI and works similarly to :class:`.VSTCharField` in the API.
ru: Эта функциональность работает только в графическом интерфейсе. В API она ведет себя так же, как и :class:`.VSTCharField`.

source: Simple crontab-like field which contains the schedule of cron entries to specify time. A crontab field has five fields for specifying day, date and time. ``*`` in the value field above means all legal values as in braces for that column.
ru: Простое поле, аналогичное crontab, содержащее расписание cron-записей для указания времени. Поле crontab имеет пять полей для указания дня, даты и времени. ``*`` в поле значений выше означает все допустимые значения, указанные в скобках для данного столбца.

source: The value column can have a ``*`` or a list of elements separated by commas. An element is either a number in the ranges shown above or two numbers in the range separated by a hyphen (meaning an inclusive range).
ru: В поле значений может быть * или список элементов, разделенных запятыми. Элементом может быть число из указанных выше диапазонов или два числа из диапазона, разделенных дефисом (означает включительный диапазон).

source: The time and date fields are:
ru: Поля времени и даты:

source: field
ru: Поля

source: allowed value
ru: допустимое значение

source: minute
ru: минута

source: hour
ru: час

source: day of month
ru: день месяца

source: month
ru: месяц

source: day of week
ru: день недели

source: 0-7 (0 or 7 is Sunday)
ru: 0-7 (0 или 7 - Sunday)

source: Default value of each field if not specified is ``*``.
ru: Значение по умолчанию для каждого поля, если не указано, составляет

source: Extends :class:`.FkModelField`, specifically designed for hierarchical relationships in the frontend.
ru: Расширяет :class:`.FkModelField`, специально разработанный для иерархических отношений на фронтенде.

source: This field is intended for handling ForeignKey relationships within a hierarchical or tree-like structure. It displays as a tree in the frontend, offering a clear visual representation of parent-child relationships.
ru: Это поле предназначено для работы с отношениями ForeignKey в иерархической или древовидной структуре. Оно отображается в виде дерева на фронтенде, предоставляя четкое визуальное представление отношений родитель-ребенок.

source: This field intentionally does not support the ``dependence`` parameter, as it operates in a tree structure. Usage of ``filters`` should be approached with caution, as inappropriate filters may disrupt the tree hierarchy.
ru: Это поле специально не поддерживает параметр ``dependence``, так как работает в структуре дерева. Использование параметра ``filters`` следует приглядеться с осторожностью, поскольку неправильные фильтры могут нарушить иерархию дерева.

source: If True, the field restricts the selection to nodes without children. Default is `False`. Useful when you want to enforce selection of leaf nodes.
ru: Если True, поле ограничит выбор узлов без детей. Значение по умолчанию - `False`. Полезно, когда вы хотите обеспечить выбор листовых узлов.

source: The name of the parent field in the related model. Default is `parent`. Should be set to the ForeignKey field in the related model, representing the parent-child relationship. For example, if your related model has a ForeignKey like `parent = models.ForeignKey('self', ...)`, then `parent_field_name` should be set to `'parent'`.
ru: Имя поля родителя в связанной модели. Значение по умолчанию - `parent`. Должно быть установлено в поле ForeignKey в связанной модели, представляющее отношения родитель-ребенок. Например, если у вашей связанной модели есть ForeignKey, например, `parent = models.ForeignKey('self', ...)`, то `parent_field_name` должно быть установлено в `'parent'`.

source: Consider a related model with a ForeignKey field representing parent-child relationships:
ru: Предположим, у вас есть связанная модель с полем ForeignKey, представляющим отношения родитель-ребенок:

source: To use the DeepFkField with this related model in a serializer, you would set the parent_field_name to 'parent':
ru: Чтобы использовать DeepFkField с этой связанной моделью в сериализаторе, вы установили бы `parent_field_name` в 'parent':

source: This example assumes a Category related model with a ForeignKey 'parent' field. The DeepFkField will then display the categories as a tree structure in the frontend, providing an intuitive selection mechanism for hierarchical relationships.
ru: В этом примере предполагается, что у вас есть связанная модель Category с полем ForeignKey 'parent'. Затем DeepFkField отобразит категории в виде дерева на фронтенде, предоставляя интуитивно понятный механизм выбора для иерархических отношений.

source: Effective only in GUI. Works similarly to :class:`rest_framework.fields.IntegerField` in API.
ru: Действует только в графическом интерфейсе. Работает аналогично :class:`rest_framework.fields.IntegerField` в API.

source: Field extends :class:`DynamicJsonTypeField` but its value is not transformed to json and would be given as is. Useful for :class:`property` in models or for actions.
ru: Поле, расширяющее :class:`DynamicJsonTypeField`, но его значение не преобразуется в json, а остается как есть. Полезно при использовании :class:`property` в модели или для экшенов.

source: field in model which value change will change type of current value.
ru: поле в модели, изменение значения которого будет менять тип текущего значения.

source: key-value mapping where key is value of subscribed field and value is type (in OpenAPI format) of current field.
ru: сопоставление ключ-значение, где ключом является значение поля-подписчика, а значением - тип (формата OpenAPI) текущего поля.

source: variants of choices for different subscribed field values. Uses mapping where key is value of subscribed field and value is list with values to choice.
ru: варианты выбора для разных значений подписанных полей. Использует сопоставление, где ключом является подписанное поле, а значением - список значений для выбора.

source: Effective only in GUI. In API works similar to :class:`.VSTCharField` without value modification.
ru: Действует только в графическом интерфейсе. В API работает аналогично :class:`.VSTCharField` без изменения значения.

source: A specialized field that extends :class:`DynamicJsonTypeField` and validates field data based on a :attr:`.field_attribute` chosen in a related model. The field data is validated against the type defined by the chosen value of :attr:`.field_attribute`.
ru: Специализированное поле, расширяющее :class:`DynamicJsonTypeField` и проверяющее данные поля на основе :attr:`.field_attribute`, выбранного в связанной модели. Данные поля проверяются на соответствие типу, определенному выбранным значением :attr:`.field_attribute`.

source: By default, any value of :attr:`.field_attribute` validates as :class:`.VSTCharField`. To override this behavior, set the class attribute ``{field_attribute}_fields_mapping`` in the related model. The attribute should be a dictionary where keys are string representations of the values of :attr:`.field_attribute`, and values are instances of :class:`rest_framework.Field` for validation. If a value is not found in the dictionary, the default type will be :class:`.VSTCharField`.
ru: По умолчанию любое значение :attr:`.field_attribute` проверяется как :class:`.VSTCharField`. Чтобы изменить это поведение, установите атрибут класса ``{field_attribute}_fields_mapping`` в связанной модели. Атрибут должен быть словарем, где ключи - это строковые представления значений :attr:`.field_attribute`, а значения - экземпляры :class:`rest_framework.Field` для проверки. Если значение не найдено в словаре, то тип по умолчанию будет :class:`.VSTCharField`.

source: The field in the model whose value change determines the type of the current value. The field must be of type :class:`.FkModelField`.
ru: Поле в модели, значение которого определяет тип текущего значения. Поле должно быть типа :class:`.FkModelField`.

source: The attribute of the related model instance containing the name of the type.
ru: Атрибут экземпляра связанной модели, содержащий имя типа.

source: A key-value mapping where the key is the value of the subscribed field, and the value is the type (in OpenAPI format) of the current field.
ru: Отображение ключ-значение, где ключ - это значение подписанного поля, а значение - тип (в формате OpenAPI) текущего поля.

source: The ``field_attribute`` in the related model must be of type :class:`rest_framework.fields.ChoicesField` to ensure proper functioning in the GUI; otherwise, the field will be displayed as simple text.
ru: ``field_attribute`` в связанной модели должно быть типа :class:`rest_framework.fields.ChoicesField`, иначе в графическом интерфейсе поле будет отображаться как обычное текстовое.

source: Suppose you have a model with a ForeignKey field `related_model` and a field `type_attribute` in `RelatedModel` that determines the type of data. You can use `DependFromFkField` to dynamically adapt the serialization based on the value of `type_attribute`:
ru: Предположим, у вас есть модель с полем ForeignKey `related_model` и полем `type_attribute` в `RelatedModel`, которое определяет тип данных. Вы можете использовать `DependFromFkField` для динамической адаптации сериализации на основе значения `type_attribute`:

source: A versatile serializer field that dynamically adapts its type based on the value of another field in the model. It facilitates complex scenarios where the type of data to be serialized depends on the value of a related field.
ru: Универсальное поле сериализатора, которое динамически адаптирует свой тип в зависимости от значения другого поля в модели. Оно облегчает сложные сценарии, где тип данных для сериализации зависит от значения связанного поля.

source: The field in the model whose value change will dynamically determine the type of the current field.
ru: Поле в модели, изменение значения которого будет динамически определять тип текущего поля.

source: Variants of choices for different subscribed field values. Uses a mapping where the key is the value of the subscribed field, and the value is a list with values to choose from.
ru: Варианты выбора для разных значений подписанных полей. Использует отображение, где ключ - это значение подписанного поля, а значение - список значений для выбора.

source: Allows using parent views data as a source for field creation. The exact view path (`/user/{id}/`) or relative parent specifier (`<<parent>>.<<parent>>.<<parent>>`) can be provided. For example, if the current page is `/user/1/role/2/` and `source_view` is `<<parent>>.<<parent>>`, then data from `/user/1/` will be used. Only detail views are supported.
ru: Позволяет использовать данные родительских представлений в качестве источника для создания поля. Можно указать точный путь представления (`/user/{id}/`) или относительный указатель родителя (`<<parent>>.<<parent>>.<<parent>>`). Например, если текущая страница - `/user/1/role/2/`, а `source_view` - `<<parent>>.<<parent>>`, то будут использованы данные из `/user/1/`. Поддерживаются только детальные представления.

source: Suppose you have a serializer `MySerializer` with a `field_type` (e.g., a `ChoiceField`) and a corresponding `object_data`. The `object_data` field can have different types based on the value of `field_type`. Here's an example configuration:
ru: Предположим, у вас есть сериализатор `MySerializer` с полем `field_type` (например, `ChoiceField`) и соответствующим полем `object_data`. Поле `object_data` может иметь разные типы в зависимости от значения `field_type`. Вот пример конфигурации:

source: In this example, the `object_data` field dynamically adapts its type based on the selected value of `field_type`. The `types` argument defines different types for each possible value of `field_type`, allowing for flexible and dynamic serialization.
ru: В этом примере поле `object_data` динамически адаптирует свой тип в зависимости от выбранного значения `field_type`. Аргумент `types` определяет разные типы для каждого возможного значения `field_type`, позволяя гибкую и динамичную сериализацию.

source: This field extends :class:`.VSTCharField` and stores the content of a file as a string.
ru: Поле, расширяющее :class:`.VSTCharField`. Сохраняет содержимое файла в виде строки.

source: The value must be text (not binary) and is saved in the model as is.
ru: Поле должно быть текстовым (не бинарным). Сохраняется в модель как есть.

source: A list of MIME types to filter on the user's side. Supports the use of ``*`` as a wildcard. Default: ``['*/*']``
ru: Список MIME-типов, доступных для выбора пользователем. Поддерживается синтаксис с использованием ``*``. По умолчанию ``['*/*']``

source: This setting only takes effect in the GUI. In the API, it behaves like :class:`.VSTCharField`.
ru: Действует только в графическом интерфейсе. В API ведет себя так же, как и :class:`.VSTCharField`.

source: An implementation of ForeignKeyField, designed for use in serializers. This field allows you to specify which field of a related model will be stored in the field (default: "id"), and which field will represent the value on the frontend.
ru: Реализация ForeignKeyField, предназначенная для использования в сериализаторах. Это поле позволяет указать, какое поле связанной модели будет храниться в этом поле (по умолчанию: "id"), а какое поле будет представлять значение на фронтенде.

source: OpenAPI schema definition name.
ru: Имя определения схемы OpenAPI.

source: Specifies which attribute will be retrieved from the OpenAPI schema definition model as the value. Default is ``id``.
ru: Указывает, какой атрибут из модели определения схемы OpenAPI использовать в качестве значения. По умолчанию 'id'.

source: Specifies which attribute will be retrieved from the OpenAPI schema definition model as the representational value. Default is ``name``.
ru: Указывает, какой атрибут из модели определения схемы OpenAPI использовать в качестве представленного значения. По умолчанию 'name'.

source: Defines the type of the autocomplete_property for further definition in the schema and casting to the type from the API. Default is passthrough but requires `int` or `str` objects.
ru: Определяет тип поля autocomplete_property для дальнейшего описания в схеме и преобразования этого типа из API. По умолчанию пропускается, но требует объекты `int` или `str`.

source: Prefetch values on the frontend at list-view. Default is ``True``.
ru: Загружать значения на фронтенде в режиме просмотра списка. Значение по умолчанию — ``True``.

source: Show the value as a link to the related model. Default is ``True``.
ru: Отображать значение как ссылку на модель. Значение по умолчанию — ``True``.

source: A dictionary where keys are names of fields from the same model, and values are names of query filters. If at least one of the fields that we depend on is non-nullable, required, and set to null, the autocompletion list will be empty, and the field will be disabled. There are some special keys for the dependence dictionary to get data that is stored on the frontend without additional database query: - ``'<<pk>>'`` gets the primary key of the current instance, - ``'<<view_name>>'`` gets the view name from the Vue component, - ``'<<parent_view_name>>'`` gets the parent view name from the Vue component, - ``'<<view_level>>'`` gets the view level, - ``'<<operation_id>>'`` gets the operation_id, - ``'<<parent_operation_id'>>`` gets the parent_operation_id.
ru: Словарь, где ключи - это имена полей из той же модели, а значения - названия query-фильтров. Если хотя бы одно из полей, от которых существует зависимость, не допускает null, обязательно или установлено в null, список автодополнения будет пустым, а поле будет отключено. Есть несколько специальных ключей dependence-словаря, с помощью которых можно получить данные, хранящиеся на фронтенде, не делая лишних запросов в базу данных: ``'<<pk>>'`` получает первичный ключ текущего экземпляра, ``'<<view_name>>'`` получает имя view из компонента Vue, ``'<<parent_view_name>>'`` получает имя родительского view из компонента Vue, ``'<<view_level>>'`` получает уровень view, ``'<<operation_id>>'`` получает operation_id, ``'<<parent_operation_id'>>`` получает родительский operation_id.

source: A dictionary where keys are names of fields from the same model, and values are names of query filters. If at least one of the fields that we depend on is non-nullable, required, and set to null, the autocompletion list will be empty, and the field will be disabled.
ru: Словарь, где ключи - это имена полей из той же модели, а значения - названия query-фильтров. Если хотя бы одно из полей, от которых существует зависимость, не допускает null, обязательно или установлено в null, список автодополнения будет пустым, и поле будет отключено.

source: There are some special keys for the dependence dictionary to get data that is stored on the frontend without additional database query:
ru: Есть несколько специальных ключей dependence-словаря, с помощью которых можно получить данные, хранящиеся на фронтенде, не делая лишних запросов в базу данных:

source: ``'<<pk>>'`` gets the primary key of the current instance,
ru: ``'<<pk>>'`` получает первичный ключ текущего экземпляра,

source: ``'<<view_name>>'`` gets the view name from the Vue component,
ru: ``'<<view_name>>'`` получает имя view из компонента Vue,

source: ``'<<parent_view_name>>'`` gets the parent view name from the Vue component,
ru: ``'<<parent_view_name>>'`` получает имя родительского view из компонента Vue,

source: ``'<<view_level>>'`` gets the view level,
ru: ``'<<view_level>>'`` получает уровень view,

source: ``'<<operation_id>>'`` gets the operation_id,
ru: ``'<<operation_id>>'`` получает operation_id,

source: ``'<<parent_operation_id'>>`` gets the parent_operation_id.
ru: ``'<<parent_operation_id'>>`` получает родительский operation_id.

source: This filter will get the primary key of the current object and make a query on the frontend ``/category?my_filter=3`` where ``3`` is the primary key of the current instance.
ru: Этот фильтр получит первичный ключ текущего объекта и выполнит запрос на фронтенде ``/category?my_filter=3``, где ``3`` - первичный ключ текущего экземпляра.

source: A dictionary where keys are names of fields from a related model (specified by this FkField), and values are values of that field.
ru: Словарь, где ключи - это имена полей из связанной модели (указанной в этом FkField), а значения - значения этого поля.

source: The intersection of `dependence.values()` and `filters.keys()` will throw an error to prevent ambiguous filtering.
ru: Пересечение `dependence.values()` и `filters.keys()` вызовет ошибку для предотвращения неоднозначной фильтрации.

source: Effective only in the GUI. Works similarly to :class:`rest_framework.fields.IntegerField` in the API.
ru: Действует только в графическом интерфейсе. Работает аналогично :class:`rest_framework.fields.IntegerField` в API.

source: Extends :class:`.FkField`, but stores referred model class. This field is useful for :class:`django.db.models.ForeignKey` fields in model to set.
ru: Расширяет :class:`.FkField`, но хранит указанный класс модели. Это поле полезно для установки полей :class:`django.db.models.ForeignKey` в модели.

source: model class (based on :class:`vstutils.models.BModel`) or serializer class which used in API and has path in OpenAPI schema.
ru: класс модели (основанный на :class:`vstutils.models.BModel`) или сериализатор, используемый в API и имеющий свой путь в схеме OpenAPI.

source: this argument indicates which attribute will be get from OpenAPI schema definition model as value. Default is ``id``.
ru: этот аргумент указывает, какие атрибуты будут взяты из model definition схемы OpenAPI в качестве используемого значения. По умолчанию ``id``.

source: this argument indicates which attribute will be get from OpenAPI schema definition model as represent value. Default is ``name``.
ru: этот аргумент указывает, какие атрибуты будут взяты из model definition схемы OpenAPI в качестве отображаемого значения. По умолчанию ``name``.

source: prefetch values on frontend at list-view. Default is ``True``.
ru: делает prefetch для значений на фронтенде в list-view. ``True`` по умолчанию.

source: Show value as link to model. Default is ``True``.
ru: Отображает значение как ссылку на модель. По умолчанию ``True``.

source: Model class get object from database during `.to_internal_value` execution. Be careful on mass save executions.
ru: Класс модели получает объект из базы данных в процессе выполнения `.to_internal_value`. Будьте осторожны при выполнении массовых сохранений.

source: Permissions to model which is referred by this field, are not to be checked. You should check it manually in signals or validators.
ru: Permission'ы модели, на которую ссылается это поле, не проверяются. Следует их проверять вручную в сигналах или валидаторах.

source: A specialized field for handling HTML text content, marked with the format:html.
ru: Специализированное поле для обработки HTML-текстового контента, отмеченного форматом: html.

source: This field is designed for use in the graphical user interface (GUI) and functions similarly to :class:`.VSTCharField` in the API.
ru: Это поле предназначено для использования в графическом интерфейсе пользователя (GUI) и работает аналогично :class:`.VSTCharField` в API.

source: If you have a model with an `html_content` field that stores HTML-formatted text, you can use `HtmlField` in your serializer to handle this content in the GUI:
ru: Если у вас есть модель с полем `html_content`, в котором хранится HTML-форматированный текст, вы можете использовать `HtmlField` в своем сериализаторе для обработки этого контента в графическом интерфейсе пользователя:

source: Extends the 'rest_framework.serializers.CharField' class. Field that applies a mask to the input value.
ru: Расширяет класс 'rest_framework.serializers.CharField'. Поле, применяющее маску к значению.

source: This field is designed for applying a mask to the input value on the frontend. It extends the 'rest_framework.serializers.CharField' and allows the use of the `IMask <https://imask.js.org/guide.html>`_ library for defining masks.
ru: Это поле предназначено для применения маски к значению на фронтенде. Оно расширяет класс 'rest_framework.serializers.CharField' и позволяет использовать библиотеку `IMask <https://imask.js.org/guide.html>`_ для определения масок.

source: The mask to be applied to the value. It can be either a dictionary or a string following the `IMask` library format.
ru: Маска, которая будет применена к значению. Это может быть как словарь, так и строка в формате библиотеки `IMask`.

source: In a serializer, include this field to apply a mask to a value:
ru: В сериализаторе включите это поле для применения маски к значению:
