Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/backend.po
Languages: ru

source: Flag indicating whether the action type is a list or a single entity. Typically used with GET actions.
ru: Флаг, указывающий, является ли тип действия списком или отдельной сущностью. Обычно используется с действиями GET.

source: Flag indicating whether the action will only use edit mode, without a view page. This is used for actions where there is a GET method and any other modifying methods (POST, PUT, PATCH).
ru: Флаг, который показывает, что на экшене будет использоваться только режим редактирования, без применения страницы для просмотра. Используется для экшенов, где есть метод GET и любые другие изменяющие методы (POST, PUT, PATCH).

source: If true user will be asked to confirm action execution on frontend.
ru: Если истина, то в интерфейсе пользователь должен будет подтвердить действие перед выполнением.

source: Set of named arguments for :func:`rest_framework.decorators.action`.
ru: Набор именованных аргументов для :func:`rest_framework.decorators.action`.

source: In this case, actions on an object do not require any data and manipulations with them. For such cases, there is a standard method that allows you to simplify the scheme and code to work just with the object.
ru: В этом случае действия с объектом не требуют каких-либо данных и манипуляций с ними. Для таких случаев существует стандартный метод, который позволяет упростить схему и код работы только с объектом.

source: Optionally, you can also overload the response serializer to notify the interface about the format of the returned data.
ru: При необходимости вы также можете переопределить сериализатор ответа, чтобы уведомить интерфейс о формате возвращаемых данных.

source: The idea of this decorator is to get the full CRUD for the instance in a minimum of steps. The instance is the object that was returned from the method being decorated. The whole mechanism is very similar to the standard property decorator, with a description of a getter, setter, and deleter.
ru: Идея этого декоратора заключается в том, чтобы получить полный CRUD для экземпляра с минимумом шагов. Экземпляр - это объект, который возвращается из декорируемого метода. Весь механизм очень похож на стандартный декоратор property, с описанием getter, setter, и deleter

source: If you're going to create an entry point for working with a single object, then you do not need to define methods. The presence of a getter, setter, and deleter will determine which methods will be available.
ru: Если вы собираетесь создать точку входа для работы с отдельным объектом, то вам не нужно определять методы. Наличие getter`a, setter`a, и deleter`a определит, какие методы будут доступны.

source: In the official documentation of Django, an example is given with moving data that is not important for authorization to the Profile model. To work with such data that is outside the main model, there is this action object, which implements the basic logic in the most automated way.
ru: В официальной документации Django приведен пример с перемещением данных, которые не являются важными для авторизации, в модель Profile. Для работы с такими данными, находящимися вне основной модели, существует данный объект действия, который реализует основную логику в наиболеавтоматизированном виде.

source: It covers most of the tasks for working with such data. By default, it has a GET method instead of POST. Also, for better organization of the code, it allows you to change the methods that will be called when modifying or deleting data.
ru: Он охватывает большинство задач по работе с такими данными. По умолчанию у него есть метод GET вместо POST. Кроме того, для лучшей организации кода он позволяет изменить методы, которые будут вызываться при изменении или удалении данных.

source: When assigning an action on an object, the list of methods is also filled with the necessary ones.
ru: При назначении действия на объект список методов также заполняется необходимыми методами.

source: Action for handling file responses. This action always returns a FileResponse.
ru: Экшен для обработки ответов с файлами. Это действие всегда возвращает FileResponse.

source: This class is designed to simplify the process of creating actions that return file responses. It ensures that the file is only sent if it has been modified since the client's last request, and it sets appropriate headers to facilitate caching and attachment handling.
ru: Этот класс предназначен для упрощения процесса создания действий, возвращающих ответы с файлами. Он гарантирует, что файл отправляется только в случае его изменения с момента последнего запроса клиента, и устанавливает соответствующие заголовки для облегчения кэширования и обработки вложений.

source: Cache-Control header value. Defaults to 'max-age=3600'.
ru: Значение заголовка Cache-Control. По умолчанию 'max-age=3600'.

source: Boolean indicating if the file should be sent as an attachment. Defaults to False.
ru: Булево значение, указывающее, следует ли отправлять файл в виде вложения. По умолчанию False.

source: Additional named arguments for :func:`rest_framework.decorators.action`.
ru: Набор именованных аргументов для :func:`rest_framework.decorators.action`.

source: Default modified_since method that checks the modification time of a file.
ru: Метод modified_since по умолчанию, который проверяет время изменения файла.

source: The view instance.
ru: Экземпляр представления.

source: The file object, typically a FileField or ImageField.
ru: Объект файла, обычно FileField или ImageField.

source: The modification time of the file, or None if it cannot be determined.
ru: Время изменения файла или None, если оно не может быть определено.

source: Default pre_data method that returns the file, its name, and content type.
ru: Метод pre_data по умолчанию, который возвращает файл, его имя и тип содержимого.

source: A tuple containing the file, its name, and its content type.
ru: Кортеж, содержащий файл, его имя и тип содержимого.

source: Filtersets
ru: Filterset'ы

source: For greater development convenience, the framework provides additional classes and functions for filtering elements by fields.
ru: Для большего удобства разработки, фреймворк предоставляет дополнительные классы и функции для фильтрации элементов на основе полей.

source: Basic filterset to search by id. Provides a search for multiple values separated by commas. Uses :func:`.extra_filter` in fields.
ru: Базовый filterset для поиска по id. Предоставляет поиск по множеству значений, разделенных запятой. Использует :func:`.extra_filter` в полях.

source: Basic filterset to search by part of name. Uses `LIKE` DB condition by :func:`.name_filter`.
ru: Базовый filterset для частичного поиска по названию. Использует условие `LIKE` в базе данных с помощью :func:`.name_filter`.

source: Simple handler for filtering by relational fields.
ru: Простой handler для фильтрации по связанным полям.

source: Field name of related model's primary key. Default is 'id'.
ru: Имя поля первичного ключа в связанной модели. По умолчанию 'id'.

source: Field name of related model's charfield. Default is 'name'.
ru: Имя charfield-поля в связанной модели. По умолчанию 'name'.

source: Changes handler for checking value before search. Sends "0" if handler falls. Default is 'int()'.
ru: Изменяет handler для проверки значения перед поиском. Посылает "0", если handler падает. По умолчанию используется `int()`.

source: Where ``author`` is ForeignKey to `User` and you want to search by primary key and email.
ru: Где ``author`` - это ForeignKey на `User`, и вы хотите искать по первичному ключу и полю email.

source: Method for searching values in a comma-separated list.
ru: Метод, предназначенный для поиска значений в списке значений, разделенных запятой.

source: model queryset for filtration.
ru: queryset модели для фильтрации.

source: field name in FilterSet. Also supports `__not` suffix.
ru: имя поля в FilterSet'е. Также поддерживает суффикс `__not`.

source: comma separated list of searching values.
ru: список искомых значений, разделенных запятыми.

source: filtered queryset.
ru: отфильтрованный queryset.

source: Method for searching by part of name. Uses `LIKE` DB condition or `contains` qs-expression.
ru: Метод для частичного поиска по названию. Использует условие `LIKE` базы данных или выражение `contains` queryset'а.

source: searching part of name.
ru: часть названия для поиска.

source: Responses
ru: Ответы (responses)

source: DRF provides a standard set of variables whose names correspond to the human-readable name of the HTTP code. For convenience, we have dynamically wrapped it in a set of classes that have appropriate names and additionally provides following capabilities:
ru: DRF предоставляет стандартный набор переменных, удобочитаемые названия которых соответствуют HTTP-кодам ответов. Для удобства мы динамически оборачиваем их в набор классов с соответствующими именами и дополнительно обеспечиваем следующие возможности:

source: String responses are wrapped in json like ``{ "detail": "string response" }``.
ru: Строковые ответы оборачиваются в json, например ``{ "detail": "string response" }``.

source: Attribute timings are kept for further processing in middleware.
ru: Тайминги атрибутов сохраняются для дальнейшей обработки в middleware.

source: Status code is set by class name (e.g. ``HTTP_200_OK`` or ``Response200`` has code 200).
ru: Код состояния задается именем класса (например ``HTTP_200_OK`` или ``Response200`` имеют код 200).

source: All classes inherit from:
ru: Все классы наследуются от:

source: API response class with default status code.
ru: Класс ответа API со стандартным кодом состояния.

source: HTTP status code.
ru: Код состояния HTTP.

source: Response timings.
ru: Тайминги ответов.

source: By default, Django `supposes <https://docs.djangoproject.com/en/4.1/topics/http/middleware/#writing-your-own-middleware>`_ that a developer creates Middleware class manually, but it's often a routine. The vstutils library offers a convenient request handler class for elegant OOP development. Middleware is used to process incoming requests and send responses before they reach final destination.
ru: По умолчанию Django `предполагает <https://docs.djangoproject.com/en/3.2/topics/http/middleware/#writing-your-own-middleware>`_, что разработчик создает класс Middleware вручную, однако зачастую это рутинная задача. Библиотека vstutils предлагает удобный класс request handler'а для изящной разработки в стиле ООП. Middleware используются для обработки входящих запросов и отправления ответов до того, как они достигнут получателя.

source: Middleware base class for handling asynchronously:
ru: Базовый класс middleware для обработки:

source: Incoming requests by :meth:`.AsyncBaseMiddleware.request_handler()`;
ru: Входящие запросы от :meth:`.AsyncBaseMiddleware.request_handler()`;

source: Outgoing response before any calling on server by :meth:`.AsyncBaseMiddleware.get_response_handler()`;
ru: Исходящий ответ перед любым обращением к серверу от :meth:`.AsyncBaseMiddleware.get_response_handler()`;

source: Outgoing responses by :meth:`.AsyncBaseMiddleware.handler()`.
ru: Исходящие ответы от :meth:`.AsyncBaseMiddleware.handler()`.

source: Middleware must be added to `MIDDLEWARE` list in settings.
ru: Middleware должен быть добавлен в список `MIDDLEWARE`, находящийся в настройках.

source: Middleware base class for handling:
ru: Базовый класс middleware для обработки:

source: Incoming requests by :meth:`.BaseMiddleware.request_handler()`;
ru: Входящие запросы от :meth:`.BaseMiddleware.request_handler()`;

source: Outgoing response before any calling on server by :meth:`.BaseMiddleware.get_response_handler()`;
ru: Исходящий ответ перед любым обращением к серверу от :meth:`.BaseMiddleware.get_response_handler()`;

source: Outgoing responses by :meth:`.BaseMiddleware.handler()`.
ru: Исходящие ответы от :meth:`.BaseMiddleware.handler()`.

source: Entrypoint for breaking or continuing request handling. This function must return `django.http.HttpResponse` object or result of parent class calling.
ru: Точка входа для прерывания или продолжения обработки запроса. Эта функция должна возвращать объект `django.http.HttpResponse` или результат вызова родительского класса.

source: Since the release of 5.3, it has been possible to write this method as asynchronous. This should be used in cases where the middleware makes queries to the database or cache. However, such a middleware should be excluded from bulk requests.
ru: Начиная с релиза 5.3, было возможно написать этот метод асинхронным. Это должно использоваться в тех случаях, когда middleware делает запросы к базе данных или к кэшу. Однако такой компонент middleware должен быть исключен из bulk запросов.

source: Never do asynchronous middleware in dependent chains. They are designed to send independent requests to external sources.
ru: Никогда не делайте асинхронным middleware в цепях зависимостей. Они разработаны, чтобы отправлять независимые запросы к внешним ресурсам.

source: Set ``async_capable`` to ``True`` and ``sync_capable`` to ``False`` for such middleware.
ru: Установите ``async_capable`` в ``True`` и ``sync_capable`` в ``False`` для таких middleware.

source: HTTP-request object which is wrapped from client request.
ru: Объект HTTP-запроса, созданный из клиентского запроса.

source: The response handler. Method to process responses.
ru: Handler ответа. Метод для обработки ответов.

source: HTTP-request object.
ru: Объект HTTP-запроса.

source: HTTP-response object which will be sended to client.
ru: Объект HTTP-ответа, который будет отправлен клиенту.

source: Handled response object.
ru: Обработанный объект ответа.

source: The request handler. Called before request is handled by a view.
ru: Handler запроса. Вызывается перед обработкой запроса view.

source: Handled request object.
ru: Обработанный объект запроса.

source: Filter Backends
ru: Filter Backend'ы

source: `Filter Backends <https://www.django-rest-framework.org/api-guide/filtering/#djangofilterbackend>`_ are used to modify model queryset. To create custom filter backend to, (i.g. annotate model queryset), you should inherit from :class:`vstutils.api.filter_backends.VSTFilterBackend` and override :meth:`vstutils.api.filter_backends.VSTFilterBackend.filter_queryset` and in some cases :meth:`vstutils.api.filter_backends.VSTFilterBackend.get_schema_fields`.
ru: `Filter Backend'ы <https://www.django-rest-framework.org/api-guide/filtering/#djangofilterbackend>`_ используются для изменения queryset'а модели. Чтобы создать пользовательский filter backend (т.е. аннотировать queryset модели), следует наследоваться от :class:`vstutils.api.filter_backends.VSTFilterBackend` и переопределить :meth:`vstutils.api.filter_backends.VSTFilterBackend.filter_queryset`. В некоторых случаях также стоит переопределить :meth:`vstutils.api.filter_backends.VSTFilterBackend.get_schema_fields`.

source: Backend that filters queryset by column from `deep_parent_field` property of the model. Value for filtering must be provided in query param `__deep_parent`.
ru: Backend, фильтрующий queryset по колонке из свойства `deep_parent_field` модели. Значение для фильтрации должно быть передано в query-параметре `__deep_parent`.

source: If param is missing then no filtering is applied.
ru: Если параметр отсутствует, то никакие фильтры не применяются.

source: If param is empty value (`/?__deep_parent=`) then objects with no parent (the value of the field whose name is stored in the property `deep_parent_field` of the model is None) returned.
ru: Если параметр - это пустое значение (`/?__deep_parent=`), то возвращаются объекты, не имеющие родителя (значение поля, чье имя хранится в свойстве модели `deep_parent_field`, равно None).

source: This filter backend and nested view is automatically added when model has `deep_parent_field` property.
ru: Этот filter backend и вложенное view автоматически добавляются в случае, если модель имеет свойство `deep_parent_field`.

source: In example above if we add this model under path '`deep`', following views will be created: `/deep/` and `/deep/{id}/deepnested/`.
ru: В примере выше если мы добавим эту модель под путь '`deep`', следующие view будут созданы: `/deep/` и `/deep/{id}/deepnested/`.

source: Filter backend can be used as `/deep/?__deep_parent=1` and will return all `DeepNestedModel` objects whose parent's primary key is `1`.
ru: Filter backend, который может быть использован как `/deep/?__deep_parent=1`, и будет возвращать все объекты `DeepNestedModel`, чьи родительские первичные ключи равны `1`.

source: You can also use generic DRF views, for that you still must set `deep_parent_field` to your model and manually add `DeepViewFilterBackend` to `filter_backends <https://www.django-rest-framework.org/api-guide/filtering/#djangofilterbackend>`_ list.
ru: Вы также можете использовать generic-view DRF. Для этого все еще нужно задать `deep_parent_field` вашей модели и вручную добавить `DeepViewFilterBackend` в `список filter_backends <https://www.django-rest-framework.org/api-guide/filtering/#djangofilterbackend>`_.

source: Filter Backend that hides all objects with hidden=True from the queryset
ru: Filter Backend, убирающий из queryset все объекты, у которых задан атрибут hidden=True.

source: Clear objects with hidden attr from queryset.
ru: Очищает объекты со атрибутом hidden из queryset'а.

source: Filter Backend that will automatically call prefetch_related and select_related on all relations in queryset.
ru: Filter Backend, автоматически вызывающий prefetch_related и select_related для всех отношений в queryset'е.

source: Select+prefetch related in queryset.
ru: Выполняет select и prefetch в queryset'е.

source: A base filter backend class to be inherited from. Example:
ru: Базовый класс filter backend'а, от которого следует наследоваться. Пример:

source: In this example Filter Backend annotates time in current timezone to any connected model's queryset.
ru: В данном примере Filter Backend аннотирует время в текущем часовом поясе в queryset'е используемой модели.

source: In some cases it may be necessary to provide a parameter from a query of request. To define this parameter in the schema, you must overload the get_schema_operation_parameters function and specify a list of parameters to use.
ru: В некоторых случаях может быть необходимо передать параметр из query запроса. Чтобы определить этот параметр в схеме, вы должны перегрузить функцию get_schema_operation_parameters и указать список параметров, которые нужно использовать.

source: In this example Filter Backend annotates time in current timezone to any connected model's queryset with field name from query `constant`.
ru: В данном примере Filter Backend аннотирует время в текущем часовом поясе в queryset'е используемой модели именем поля из query `constant`.

source: You can also make the filter controls available to the schema autogeneration that REST framework provides, by implementing this method. The method should return a list of OpenAPI schema mappings.
ru: Вы также можете создать элементы управления фильтрами доступными для автогенерации схемы, предоставляемой REST-фреймворком, реализуя этот метод. Метод должен возвращать список OpenAPI сопоставлений схемы.

source: Celery is a distributed task queue. It's used to execute some actions asynchronously in a separate worker. For more details on Celery, check it's official `docs <https://docs.celeryproject.org/en/stable/>`_. For Celery related vstutils features to work, you need to specify `[rpc] <config.html#rpc-settings>`_ and `[worker] <config.html#worker-settings>`_ sections in settings.ini. Also you need to include extra [rpc] requirements.
ru: Celery - это распределенная очередь задач. Он используется для запуска задач асинхронно в отдельном worker'е. Чтобы узнать больше о Celery, смотрите официальную `документацию <https://docs.celeryproject.org/en/stable/>`_. Для работы функций vstutils, связанных с Celery, необходимо указать секции `[rpc] <config.html#rpc-settings>`_ and `[worker] <config.html#worker-settings>`_ в settings.ini. Также вам понадобится установить дополнительные [rpc] зависимости.

source: Wrapper for Celery BaseTask class. Usage is same as Celery standard class, but you can execute task without creating instance with :meth:`TaskClass.do` method.
ru: Обертка для класса BaseTask из Celery. Использование такое же, как и стандартного класса, однако вы можете запустить задачу без необходимости создавать экземпляр с помощью метода :meth:`TaskClass.do`.

source: Now you can call your task with various methods:
ru: Теперь вы можете вызвать задачу несколькими методами:

source: by executing ``Foo.do(*args, **kwargs)``
ru: вызвав ``Foo.do(*args, **kwargs)``

source: get registered task instance like that - app.tasks['full_path.to.task.class.Foo']
ru: получить зарегистрированный экземпляр задачи можно так: app.tasks['full_path.to.task.class.Foo']

source: Also you can make your registered task periodic, by adding it to CELERY_BEAT_SCHEDULE in settings.py:
ru: Также вы можете сделать вашу зарегистрированную задачу периодической. Для этого нужно добавить ее CELERY_BEAT_SCHEDULE в settings.py:

source: Method which send signal to celery for start remote task execution. All arguments will passed to the task :meth:`TaskClass.run` method.
ru: Метод, который посылает сигнал запуска удаленной задаче celery. Все аргументы будут переданы методу задачи :meth:`TaskClass.run`.

source: property for proper Celery task execution, needed for :meth:`TaskClass.do` method to work
ru: свойство для правильного выполнения Celery-задачи, нужно для работы метода :meth:`TaskClass.do`

source: The body of the task executed by workers.
ru: Тело задачи выполняется worker'ами.

source: Endpoint view has two purposes: bulk requests execution and providing OpenAPI schema.
ru: Endpoint-view имеет две цели: выполнение bulk-запросов и предоставление схемы OpenAPI.

source: Endpoint url is ``/{API_URL}/endpoint/``, for example value with default settings is ``/api/endpoint/``.
ru: URL endpoint'а - ``/{API_URL}/endpoint/``, например значение с настройками по умолчанию - ``/api/endpoint/``.

source: ``API_URL`` can be changed in ``settings.py``.
ru: ``API_URL`` может быть изменен в ``settings.py``.

source: Default API-endpoint viewset.
ru: Стандартный viewset API-endpoint'а.

source: Returns response with swagger ui or openapi json schema if ?format=openapi
ru: Возвращает ответ в виде Swagger UI или OpenAPI json-схему, если указан ?format=openapi

source: Returns test client and guarantees that if bulk request comes authenticated than test client will be authenticated with the same user
ru: Возвращает тестового клиента, гарантируя, что если bulk-запрос выполнен от аутентифицированного пользователя, то тестовый клиент будет аутентифицирован тем же самым пользователем.

source: :sphinx_autodoc_typehints_type:`\:py\:class\:\`vstutils.api.endpoint.OperationSerializer\``
ru: :py:class:`vstutils.api.endpoint.OperationSerializer`

source: Extra context provided to the serializer class.
ru: Дополнительный контекст, предоставляемый классу сериализатора.

source: Method used to handle one operation and return result of it
ru: Метод, используемый для обработки одной операции и возвращающий ее результат

source: Execute transactional bulk request
ru: Выполнить транзакционный bulk-запрос

source: Execute non transaction bulk request
ru: Выполнить нетранзакционный bulk-запрос

source: One operation serializer class.
ru: Класс сериализатора одной операции.

source: Bulk requests
ru: Bulk-запросы

source: Bulk request allows you send multiple requests to api at once, it accepts json list of operations.
ru: Bulk-запрос позволяет вам отсылать несколько запросов к api в одном. Он принимает json-список операций.

source: Method
ru: Метод
