Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/backend.po
Languages: ru

source: Vstutils supports models that don't necessitate direct database interaction or aren't inherently tied to database tables. These models exhibit diverse behaviors, such as fetching data directly from class attributes, loading data from files, or implementing custom data retrieval mechanisms. Remarkably, there are models that, in a sense, implement the mechanism of SQL views with pre-defined queries. This flexibility allows developers to define a wide range of models that cater to specific data needs, from in-memory models to those seamlessly integrating external data sources. Vstutils' model system is not confined to traditional database-backed structures, providing a versatile foundation for crafting various data representations.
ru: Vstutils поддерживает модели, которые не требуют прямого взаимодействия с базой данных или не являются непосредственно таблицами в базе. Эти модели проявляют разнообразные поведения, такие как извлечение данных непосредственно из атрибутов класса, загрузка данных из файлов или реализация собственных механизмов получения данных. Замечательно, что существуют модели, которые, в каком-то смысле, реализуют механизм SQL представлений с предопределенными запросами. Эта гибкость позволяет разработчикам определять широкий спектр моделей, от моделей, существующих только в памяти, до тех, которые без проблем интегрируют внешние источники данных. Система моделей Vstutils не ограничивается традиционными структурами, поддерживаемыми базой данных, предоставляя гибкое основание для создания различных представлений данных.

source: Represents a custom model designed for the self-implementation of requests to external services.
ru: Представляет собой кастомную модель, предназначенную для самостоятельной реализации запросов ко внешним сервисам.

source: This model facilitates the seamless interaction with external services by allowing the passing of filtering, limiting, and sorting parameters to an external request. It is designed to receive data that is already filtered and limited.
ru: Данная кастомная модель облегчает взаимодействие с внешними сервисами, позволяя передавать параметры фильтрации, лимитирования и сортировки во внешний запрос. Она предназначена для получения данных, которые уже отфильтрованы и ограничены.

source: To utilize this model effectively, developers need to implement the ``get_data_generator()`` class method. This method receives a query object containing the necessary parameters, enabling developers to customize interactions with external services.
ru: Для эффективного использования этой модели разработчики должны реализовать метод класса ``get_data_generator()``. Этот метод получает объект запроса с необходимыми параметрами, позволяя разработчикам настраивать взаимодействие с внешними сервисами.

source: **Example:**
ru: **Пример:**

source: This class method must be implemented by derived classes to define custom logic for fetching data from an external service based on the provided query parameters.
ru: Этот метод класса должен быть реализован в производных классах для определения пользовательской логики извлечения данных из внешнего сервиса на основе предоставленных параметров запроса.

source: Query object might contain the following parameters:
ru: Объект запроса может содержать следующие параметры:

source: filter (dict): A dictionary specifying the filtering criteria.
ru: filter (dict): Словарь, задающий критерии фильтрации.

source: exclude (dict): A dictionary specifying the exclusion criteria.
ru: exclude (dict): Словарь, задающий критерии исключения.

source: order_by (list): A list specifying the sorting order.
ru: order_by (list): Список, задающий порядок сортировки.

source: low_mark (int): The low index for slicing (if sliced).
ru: low_mark (int): Нижний индекс для среза (если задан срез).

source: high_mark (int): The high index for slicing (if sliced).
ru: high_mark (int): Верхний индекс для среза (если задан срез).

source: is_sliced (bool): A boolean indicating whether the query is sliced.
ru: is_sliced (bool): Булево значение, указывающее, является ли запрос срезом.

source: Parameters
ru: Параметры

source: An object containing filtering, limiting, and sorting parameters.
ru: Объект, содержащий параметры фильтрации, лимитирования и сортировки.

source: Returns
ru: Возвращает

source: A generator that yields the requested data.
ru: Генератор, возвращающий запрошенные данные.

source: Return type
ru: Тип возвращаемого значения

source: Raises
ru: Выбрасывает

source: If the method is not implemented by the derived class.
ru: Если метод не реализован в производном классе.

source: Custom model that loads data from a YAML file instead of a database. The path to the file is specified in the `FileModel.file_path` attribute.
ru: Кастомная модель, загружающая данные из YAML-файла вместо базы данных. Путь к файлу указывается в атрибуте `FileModel.file_path`.

source: Suppose the source file is stored at `/etc/authors.yaml` with the following content:
ru: Предположим, что исходный файл хранится в `/etc/authors.yaml` со следующим содержимым:

source: You can create a custom model using this file:
ru: Вы можете создать кастомную модель, используя этот файл:

source: Custom model which uses a list of dicts with data (attribute `ListModel.data`) instead of database records. Useful when you have a simple list of data.
ru: Модель, использующая список или словарь для хранения данных (атрибут `ListModel.data`) вместо базы данных. Полезна в том случае, если у вас простой набор данных.

source: Sometimes, it may be necessary to switch the data source. For these purposes, you should use the `setup_custom_queryset_kwargs` function, which takes various named arguments, which are also passed to the data initialization function. One such argument for :class:`ListModel` is date_source, which takes any iterable object.
ru: Иногда может быть необходимо переключаться между источниками данных. Для этих целей следует использовать функцию `setup_custom_queryset_kwargs`, которая принимает именованные аргументы, отправляющиеся затем в функцию инициализации данных. Один из таких аргументов для :class:`ListModel` - date_source, принимающий любой итерируемый объект.

source: In this case, we setup source list via `setup_custom_queryset_kwargs` function, and any other chained call is going to work with this data.
ru: В этом случае мы задаем список источников через функцию `setup_custom_queryset_kwargs`, и каждый последующий вызов в цепочке методов будет работать с этими данными.

source: Variables
ru: Переменные

source: List with data dicts. Empty by default.
ru: Список кортежей данных. Пустой по умолчанию.

source: Implements the SQL View programming mechanism over other models.
ru: Реализует механизм программирования SQL View над другими моделями.

source: This model provides a mechanism for implementing SQL View-like behavior over other models. In the ``get_view_queryset()`` method, a base query is prepared, and all further actions are implemented on top of it.
ru: Эта модель предоставляет механизм для реализации поведения, аналогичного SQL View, над другими моделями. В методе ``get_view_queryset()`` подготавливается базовый запрос, и все последующие действия реализуются поверх него.

source: **Example Usage:**
ru: **Примеры:**

source: This class method must be implemented by derived classes to define custom logic for generating the base queryset for the SQL View.
ru: Этот метод класса должен быть реализован в производных классах для определения пользовательской логики создания базового queryset для SQL View.

source: The base queryset for the SQL View.
ru: Базовый queryset для SQL View.

source: Model Fields
ru: Поля Модели

source: Extends :class:`django.db.models.ForeignKey`. Use this field in :class:`vstutils.models.BModel` to get `vstutils.api.FkModelField` in serializer. To set Foreign Key relation set `to` argument to string path to model or to Model Class as in :class:`django.db.models.ForeignKey`
ru: Расширяет :class:`django.db.models.ForeignKey`. Используйте это поле в :class:`vstutils.models.BModel`, чтобы получить `vstutils.api.FkModelField` в сериализаторе. Чтобы установить Foreign Key отношение, задайте значение `to` - класс модели или строка для импорта, как в :class:`django.db.models.ForeignKey`

source: Extends :class:`django.db.models.TextField`. A simple field for storing HTML markup. The field is based on :class:`django.db.models.TextField`, therefore it does not support indexing and is not recommended for use in filters.
ru: Расширяет класс :class:`django.db.models.TextField`. Простое поле для хранения HTML-разметки. Поле основано на базе :class:`django.db.models.TextField`, поэтому не поддерживает индексацию и не рекомендовано для использования в фильтрах.

source: Subclasses :class:`django.db.models.fields.files.FieldFile`. Provides :meth:`MultipleFieldFile.save` and :meth:`MultipleFieldFile.delete` to manipulate the underlying file, as well as update the associated model instance.
ru: Подклассы :class:`django.db.models.fields.files.FieldFile`. Предоставляют :meth:`MultipleFieldFile.save` и :meth:`MultipleFieldFile.delete` для управления базовым файлом, а также для обновления соответствующего экземпляра модели.

source: Delete file from storage and from object attr.
ru: Удаляет файл из хранилища и из атрибута объекта.

source: Save changes in file to storage and to object attr.
ru: Сохраняет изменения в файле в хранилище и атрибут объекта.

source: Subclasses :class:`django.db.models.fields.files.FileDescriptor` to handle list of files. Return a list of :class:`MultipleFieldFile` when accessed so you can write code like:
ru: Подклассы :class:`django.db.models.fields.files.FileDescriptor` для обработки списка файлов. Возвращает список :class:`MultipleFieldFile` при обращении, поэтому вы можете написать такой код:

source: Always return valid attr_class object. For details on logic see :meth:`django.db.models.fields.files.FileDescriptor.__get__`.
ru: Всегда возвращает валидный объект attr_class. За деталями реализации обратитесь к :meth:`django.db.models.fields.files.FileDescriptor.__get__`.

source: Subclasses :class:`django.db.models.fields.files.FileField`. Field for storing a list of Storage-kept files. All args passed to FileField.
ru: Подклассы :class:`django.db.models.fields.files.FileField`. Поле для хранения списка файлов, содержащихся в хранилище. Все аргументы передаются в FileField.

source: Mixin suited to use with :class:`django.db.models.fields.files.FieldFile` to transform it to a Field with list of files.
ru: Миксина, предназначенная для использования вместе с :class:`django.db.models.fields.files.FieldFile` для преобразования его в Field вместе со списком файлов.

source: Prepare value for database insertion
ru: Подготовка значения для вставки в базу данных

source: Call .save() method on every file in list
ru: Вызов метода .save() для каждого файла списка

source: Field for storing a list of storage-kept images. All args are passed to :class:`django.db.models.fields.files.ImageField`, except height_field and width_field, they are not currently implemented.
ru: Поле для хранения списка изображения, содержащихся в хранилище. Все аргументы передаются в :class:`django.db.models.fields.files.ImageField`, кроме height_field и width_field, так как они пока не реализованы.

source: Subclasses :class:`MultipleFieldFile` and :class:`ImageFile mixin`, handles deleting _dimensions_cache when file is deleted.
ru: Подклассы :class:`MultipleFieldFile` и :class:`ImageFile mixin`, обрабатывают удаление _dimensions_cache, когда файл удаляется.

source: Extends :class:`django.db.models.TextField`. Use this field in :class:`vstutils.models.BModel` to get `vstutils.api.MultipleNamedBinaryFileInJSONField` in serializer.
ru: Расширяет :class:`django.db.models.TextField`. Используйте это поле в :class:`vstutils.models.BModel`, чтобы получить `vstutils.api.MultipleNamedBinaryFileInJSONField` в сериализаторе.

source: Extends :class:`django.db.models.TextField`. Use this field in :class:`vstutils.models.BModel` to get `vstutils.api.MultipleNamedBinaryImageInJSONField` in serializer.
ru: Расширяет :class:`django.db.models.TextField`. Используйте это поле в :class:`vstutils.models.BModel`, чтобы получить `vstutils.api.MultipleNamedBinaryImageInJSONField` в сериализаторе.

source: Extends :class:`django.db.models.TextField`. Use this field in :class:`vstutils.models.BModel` to get `vstutils.api.NamedBinaryFileInJSONField` in serializer.
ru: Расширяет :class:`django.db.models.TextField`. Используйте это поле в :class:`vstutils.models.BModel`, чтобы получить `vstutils.api.NamedBinaryFileInJSONField` в сериализаторе.

source: Extends :class:`django.db.models.TextField`. Use this field in :class:`vstutils.models.BModel` to get `vstutils.api.NamedBinaryImageInJSONField` in serializer.
ru: Расширяет :class:`django.db.models.TextField`. Используйте это поле в :class:`vstutils.models.BModel`, чтобы получить `vstutils.api.NamedBinaryImageInJSONField` в сериализаторе.

source: Extends :class:`django.db.models.TextField`. A simple field for storing Markdown data. The field is based on :class:`django.db.models.TextField`, therefore it does not support indexing and is not recommended for use in filters.
ru: Расширяет :class:`django.db.models.TextField`. Простое поле для хранения строк в формате Markdown. Поле основано на :class:`django.db.models.TextField`, поэтому не поддерживает индексацию и не рекомендовано для использования в фильтрах.

source: Web API
ru: Веб-API

source: Web API is based on Django Rest Framework with additional nested functions.
ru: Веб-API основано на Django Rest Framework. Предоставляет дополнительные вложенные функции.

source: Fields
ru: Поля

source: The Framework includes a list of convenient serializer fields. Some of them take effect only in generated admin interface.
ru: Фреймворк включает в себя список удобных полей сериализатора. Некоторые из них вступают в силу только в сгенерированном интерфейсе администратора.

source: Additional serializer fields for generating OpenAPI and GUI.
ru: Дополнительные поля сериализатора для генерации OpenAPI и графического интерфейса.

source: Serializer field that provides autocompletion on the frontend, using a specified list of objects.
ru: Поле сериализатора, обеспечивающее автодополнение на фронтенде с использованием указанного списка объектов.

source: Autocompletion reference. You can set a list or tuple with values or specify the name of an OpenAPI schema definition. For a definition name, the GUI will find the optimal link and display values based on the ``autocomplete_property`` and ``autocomplete_represent`` arguments.
ru: Ссылка для автодополнения. Можно установить список или кортеж с значениями или указать имя определения схемы OpenAPI. Для имени определения, GUI найдет оптимальную ссылку и отобразит значения на основе аргументов ``autocomplete_property`` и ``autocomplete_represent``.

source: Specifies which attribute to retrieve from the OpenAPI schema definition model as the value. Default is 'id'.
ru: Указывает, какой атрибут из модели определения схемы OpenAPI использовать в качестве значения. По умолчанию 'id'.

source: Specifies which attribute to retrieve from the OpenAPI schema definition model as the representational value. Default is 'name'.
ru: Указывает, какой атрибут из модели определения схемы OpenAPI использовать в качестве представленного значения. По умолчанию 'name'.

source: Prefetch values on the frontend in list view. Default is ``True``.
ru: Загружать значения на фронтенде в режиме просмотра списка. Значение по умолчанию — ``True``.

source: This functionality is effective only in the GUI. In the API, it behaves similarly to :class:`.VSTCharField`.
ru: Эта функциональность работает только в графическом интерфейсе. В API она ведет себя так же, как и :class:`.VSTCharField`.

source: Usage:
ru: Использование:

source: This field is designed to be used in serializers where a user needs to input a value, and autocompletion based on a predefined list or an OpenAPI schema definition is desired. If an OpenAPI schema is specified, two additional parameters, ``autocomplete_property`` and ``autocomplete_represent``, can be configured to customize the appearance of the dropdown list.
ru: Это поле предназначено для использования в сериализаторах, где пользователь должен ввести значение, и требуется автодополнение на основе предопределенного списка или определения схемы OpenAPI. Если указана схема OpenAPI, два дополнительных параметра, ``autocomplete_property`` и ``autocomplete_represent``, могут быть настроены для настройки внешнего вида выпадающего списка.

source: A field for representing data as a Barcode (Code 128) in the user interface.
ru: Поле для представления данных в виде штрихкода (Code 128) в пользовательском интерфейсе.

source: This field accepts and validates data in the form of a valid ASCII string. It is designed to display the data as a Code 128 barcode in the graphical user interface. The underlying data is serialized or deserialized using the specified child field.
ru: Это поле принимает и проверяет данные в виде допустимой ASCII-строки. Оно предназначено для отображения данных в виде штрихкода Code 128 в графическом пользовательском интерфейсе. Основные данные сериализуются или десериализуются с использованием указанного дочернего поля.

source: The original data field for serialization or deserialization. Default: :class:`rest_framework.fields.CharField`
ru: Исходное поле данных для сериализации или десериализации. По умолчанию: :class:`rest_framework.fields.CharField`

source: Suppose you have a model with a `product_code` field, and you want to display its Code 128 barcode representation in the GUI. You can use `Barcode128Field` in your serializer:
ru: Предположим, у вас есть модель с полем `product_code`, и вы хотите отображать его представление в виде штрихкода Code 128 в графическом интерфейсе пользователя. Вы можете использовать `Barcode128Field` в своем сериализаторе:

source: This field extends :class:`.FileInStringField` and is specifically designed to handle binary files. In the GUI, it functions as a file input field, accepting binary files from the user, which are then converted to base64-encoded strings and stored in this field.
ru: Это поле расширяет функциональность :class:`.FileInStringField` и специально предназначено для обработки бинарных файлов. В интерфейсе пользователя оно выступает в качестве поля для загрузки файлов, принимая бинарные файлы от пользователя, которые затем конвертируются в строку в формате base64 и сохраняются в данном поле.

source: A list of MIME types to filter on the user's side. Supports the use of ``*`` as a wildcard. Default: `['*/*']`
ru: Список MIME-типов, доступных для выбора пользователем. Поддерживается синтаксис с использованием ``*``. По умолчанию ``['*/*']``

source: Field extends :class:`.FileInStringField`, using for works with csv files. This field provides the display of the loaded data in the form of a table.
ru: Поле, расширяющее :class:`.FileInStringField`, используется для работы с csv файлами. Обеспечивает отображение загруженных данных в виде таблицы.

source: The config of the table. This is a drf or vst serializer which includes char fields which are the keys in the dictionaries into which the data from csv is serialized and the names for columns in a table. The fields must be in the order you want them to appear in the table. Following options may be included: - ``label``: human readable column name - ``required``: Defines whether the field should be required. False by default.
ru: Конфигурация таблицы. Это сериализатор drf или vst, включающий CharField'ы, которые являются ключами словарей, и именами колонок в таблице. В ключи сериализуются данные из csv. Поля должны быть в том порядке, в котором вы хотите видеть их в таблице. Следующие опции могут также быть включены: - ``label``: удобочитаемое название колонки - ``required``: определяет, будет ли поле обязательным. По умолчанию False.

source: The config of the table. This is a drf or vst serializer which includes char fields which are the keys in the dictionaries into which the data from csv is serialized and the names for columns in a table. The fields must be in the order you want them to appear in the table. Following options may be included:
ru: Конфигурация таблицы. Это сериализатор drf или vst, включающий CharField'ы, которые являются ключами словарей, и имена колонок в таблице. В ключи сериализуются данные из csv. Поля должны быть в том порядке, в котором вы хотите видеть их в таблице. Следующие опции могут также быть включены:

source: ``label``: human readable column name
ru: ``label``: удобочитаемое название колонки

source: ``required``: Defines whether the field should be required. False by default.
ru: ``required``: определяет, будет ли поле обязательным. По умолчанию False.

source: Minimum cell width. Default is 200 px.
ru: Минимальная ширина ячейки. По умолчанию 200 px.

source: The delimiting character.
ru: Символ-разделитель.

source: The newline sequence. Leave blank to auto-detect. Must be one of ``\r``, ``\n``, or ``\r\n``.
ru: Последовательность символов новой строки. Оставьте пустым для выбора автоматически. Возможные значения: ``\r``, ``\n``, ``\r\n``.

source: The character used to quote fields.
ru: Символ, используемый в качестве кавычек для полей.

source: The character used to escape the quote character within a field.
ru: Символ, используемый для экранирования кавычки в поле.

source: List of MIME types to select on the user's side. Supported syntax using ``*``. Default: ``['text/csv']``
ru: Список MIME-типов, доступных для выбора пользователем. Поддерживается синтаксис с использованием ``*``. По умолчанию ``['text/csv']``

source: Boolean field that renders checkbox.
ru: Булево поле, которое отрисовывается как чекбокс.

source: Field that allows users to input multiple values, separated by a specified delimiter (default: ","). It retrieves a list of values from another model or a custom list and provides autocompletion similar to :class:`.AutoCompletionField`. This field is suitable for property fields in a model where the main logic is already implemented or for use with :class:`model.CharField`.
ru: Поле, позволяющее пользователям вводить несколько значений, разделенных указанным разделителем (по умолчанию ","). Извлекает список значений из другой модели или пользовательского списка и предоставляет автодополнение аналогично :class:`.AutoCompletionField`. Это поле подходит для полей-свойств модели, где основная логика уже реализована, или для использования с :class:`model.CharField`.

source: OpenAPI schema definition name or a list with values.
ru: Имя определения схемы OpenAPI или список со значениями.

source: The separator for values. The default is a comma.
ru: Разделитель значений. По умолчанию - запятая.

source: These parameters function similarly to ``autocomplete_property`` and ``autocomplete_represent``. The default is ``name``.
ru: Эти параметры работают аналогично ``autocomplete_property`` и ``autocomplete_represent``. По умолчанию - ``name``.

source: Prefetch values on the frontend in list view. The default is ``False``.
ru: Загружать значения на фронтенде в режиме просмотра списка. Значение по умолчанию - ``False``.

source: Show values as links to the model. The default is ``True``.
ru: Отображать значения как ссылки на модель. По умолчанию - ``True``.
