Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/backend.po
Languages: ru

source: This example assumes a serializer where the ``masked_value`` field represents a value with a predefined mask. The ``MaskedField`` will apply the specified mask on the frontend, providing a masked input for users.
ru: В этом примере предполагается, что сериализатор имеет поле `masked_value`, представляющее значение с предопределенной маской. `MaskedField` применит указанную маску на фронтенде, предоставляя маскированный ввод для пользователей.

source: The effectiveness of this field is limited to the frontend, and the mask is applied during user input.
ru: Эффективность этого поля ограничивается фронтендом, и маска применяется при вводе пользователя.

source: Extends :class:`.NamedBinaryFileInJsonField` but uses list of JSONs. Allows to operate with multiple files as list of :class:`NamedBinaryFileInJsonField`.
ru: Расширяет :class:`.NamedBinaryFileInJsonField`, но использует список JSON'ов. Позволяет оперировать несколькими файлами через список объектов :class:`NamedBinaryFileInJsonField`.

source: Attrs: :attr:`NamedBinaryInJsonField.file`: if True, accept only subclasses of File as input. If False, accept only string input. Default: False.
ru: Атрибуты: :attr:`NamedBinaryInJsonField.file`: если True, принимает только подклассы File в качестве входных данных. Если False, принимает только значения типа string. По умолчанию: False.

source: Extends :class:`.MultipleNamedBinaryFileInJsonField` but uses list of JSONs. Used for operating with multiple images and works as list of :class:`NamedBinaryImageInJsonField`.
ru: Расширяет :class:`.MultipleNamedBinaryFileInJsonField`, но использует список JSON'ов. Используется для оперирования несколькими изображениями и работает как список объектов :class:`NamedBinaryImageInJsonField`.

source: Color to fill area that is not covered by image after cropping. Transparent by default but will be black if image format is not supporting transparency. Can be any valid CSS color.
ru: Цвет для заполнения области, не покрытой изображением после обрезки. По умолчанию прозрачный, но будет черным, если формат изображения не поддерживает прозрачность. Может быть любым допустимым цветом CSS.

source: Field that represents a binary file in JSON format.
ru: Поле, представляющее бинарный файл в формате JSON.

source: If True, accept only subclasses of File as input. If False, accept only string input. Default: False.
ru: Если True, принимает только подклассы File в качестве входных данных. Если False, принимает только строковые входные данные. По умолчанию: False.

source: Functions to process the file after validation. Each function takes two arguments: ``binary_data`` (file bytes) and ``original_data`` (reference to the original JSON object). The function should return the processed ``binary_data``.
ru: Функции для обработки файла после валидации. Каждая функция принимает два аргумента: ``binary_data`` (байты файла) и ``original_data`` (ссылка на исходный JSON-объект). Функция должна возвращать обработанный ``binary_data``.

source: Functions to process the file before validation. Each function takes two arguments: ``binary_data`` (file bytes) and ``original_data`` (reference to the original JSON object). The function should return the processed ``binary_data``.
ru: Функции для обработки файла перед валидацией. Каждая функция принимает два аргумента: ``binary_data`` (байты файла) и ``original_data`` (ссылка на исходный JSON-объект). Функция должна возвращать обработанный ``binary_data``.

source: Maximum allowed size of the file content in bytes.
ru: Максимально допустимый размер содержимого файла в байтах.

source: Minimum allowed size of the file content in bytes.
ru: Минимально допустимый размер содержимого файла в байтах.

source: Minimum length of the file name. Only applicable when ``file=True``.
ru: Минимальная длина имени файла. Применяется только при ``file=True``.

source: Maximum length of the file name. Only applicable when ``file=True``.
ru: Максимальная длина имени файла. Применяется только при ``file=True``.

source: This field is designed for storing binary files alongside their names in :class:`django.db.models.CharField` or :class:`django.db.models.TextField` model fields. All manipulations involving decoding and encoding binary content data occur on the client, imposing reasonable limits on file size.
ru: Это поле предназначено для хранения бинарных файлов вместе с их именами в полях модели :class:`django.db.models.CharField` или :class:`django.db.models.TextField`. Все манипуляции, связанные с декодированием и кодированием данных бинарного содержимого, выполняются на клиенте, что накладывает разумные ограничения на размер файла.

source: Additionally, this field can construct a :class:`django.core.files.uploadedfile.SimpleUploadedFile` from incoming JSON and store it as a file in :class:`django.db.models.FileField` if the `file` attribute is set to `True`.
ru: Кроме того, это поле может создать :class:`django.core.files.uploadedfile.SimpleUploadedFile` из входящего JSON и сохранить его как файл в :class:`django.db.models.FileField`, если атрибут `file` установлен в значение `True`.

source: In a serializer, include this field to handle binary files:
ru: В сериализаторе включите это поле для обработки бинарных файлов:

source: This example assumes a serializer where the ``binary_data`` field represents binary file information in JSON format. The ``NamedBinaryFileInJsonField`` will then handle the storage and retrieval of binary files in a user-friendly manner.
ru: В этом примере предполагается, что в сериализаторе поле ``binary_data`` представляет информацию о бинарном файле в формате JSON. Поле ``NamedBinaryFileInJsonField`` обеспечит обработку хранения и извлечения бинарных файлов удобным для пользователя образом.

source: The binary file is represented in JSON with the following properties:
ru: Бинарный файл представлен в формате JSON со следующими свойствами:

source: **name** (str): Name of the file.
ru: **name** (str): Имя файла.

source: **mediaType** (str): MIME type of the file.
ru: **mediaType** (str): MIME-тип файла.

source: **content** (str or File): Content of the file. If `file` is True, it will be a reference to the file; otherwise, it will be base64-encoded content.
ru: **content** (str или File): Содержимое файла. Если `file` установлен в True, это будет ссылка на файл; в противном случае содержимое будет закодировано base64.

source: The client application will display the content as a download link. Users will interact with the binary file through the application, with the exchange between the Rest API and the client occurring through the presented JSON object.
ru: Приложение клиента отобразит содержимое в виде ссылки для скачивания. Пользователи будут взаимодействовать с бинарным файлом через приложение, а обмен между Rest API и клиентом будет происходить через представленный объект JSON.

source: Field that represents an image in JSON format, extending :class:`.NamedBinaryFileInJsonField`.
ru: Поле, представляющее изображение в формате JSON, расширяющее :class:`.NamedBinaryFileInJsonField`.

source: Color to fill the area not covered by the image after cropping. Transparent by default but will be black if the image format does not support transparency. Can be any valid CSS color.
ru: Цвет для заполнения области, не покрытой изображением после обрезки. По умолчанию прозрачный, но будет черным, если формат изображения не поддерживает прозрачность. Может быть любым допустимым цветом CSS.

source: This field is designed for handling image files alongside their names in :class:`django.db.models.CharField` or :class:`django.db.models.TextField` model fields. It extends the capabilities of :class:`.NamedBinaryFileInJsonField` to specifically handle images.
ru: Это поле предназначено для хранения бинарных файлов вместе с их именами в полях модели :class:`django.db.models.CharField` или :class:`django.db.models.TextField`. Оно расширяет возможности :class:`.NamedBinaryFileInJsonField` для специальной обработки изображений.

source: Additionally, this field validates the image using the following validators: - :class:`vstutils.api.validators.ImageValidator` - :class:`vstutils.api.validators.ImageResolutionValidator` - :class:`vstutils.api.validators.ImageHeightValidator`
ru: Кроме того, это поле проверяет изображение с использованием следующих валидаторов: - :class:`vstutils.api.validators.ImageValidator` - :class:`vstutils.api.validators.ImageResolutionValidator` - :class:`vstutils.api.validators.ImageHeightValidator`

source: When saving and with the added validators, the field will display a corresponding window for adjusting the image to the specified parameters, providing a user-friendly interface for managing images.
ru: При сохранении и с добавленными валидаторами поле будет отображать соответствующее окно для настройки изображения по указанным параметрам, предоставляя удобный интерфейс для управления изображениями.

source: The image file is represented in JSON with the following properties:
ru: Бинарный файл представлен в формате JSON со следующими свойствами:

source: **name** (str): Name of the image file.
ru: **name** (str): Имя файла изображения.

source: **mediaType** (str): MIME type of the image file.
ru: **mediaType** (str): MIME-тип файла изображения.

source: **content** (str or File): Content of the image file. If `file` is True, it will be a reference to the image file; otherwise, it will be base64-encoded content.
ru: **content** (str или File): Содержимое файла изображения. Если `file` установлен в True, это будет ссылка на файл; в противном случае содержимое будет закодировано base64.

source: The client application will display the content as an image. Users will interact with the image through the application, with the exchange between the Rest API and the client occurring through the presented JSON object.
ru: Приложение клиента отобразит содержимое как изображение. Пользователи будут взаимодействовать с изображением через приложение, и обмен между Rest API и клиентом будет происходить через представленный объект JSON.

source: Extends `CharField <https://www.django-rest-framework.org/api-guide/fields/#charfield>`_ but in schema set format to `password`. Show all characters as asterisks instead of real value in GUI.
ru: Расширяет `CharField <https://www.django-rest-framework.org/api-guide/fields/#charfield>`_, но в схеме имеет format = `password`. В пользовательском интерфейсе отображает все символы как звездочки вместо реально введенных данных.

source: Extends the 'rest_framework.serializers.CharField' class. Field for representing a phone number in international format.
ru: Расширяет класс 'rest_framework.serializers.CharField'. Поле для представления номера телефона в международном формате.

source: This field is designed for capturing and validating phone numbers in international format. It extends the 'rest_framework.serializers.CharField' and adds custom validation to ensure that the phone number contains only digits.
ru: Это поле предназначено для захвата и валидации номеров телефонов в международном формате. Оно расширяет класс 'rest_framework.serializers.CharField' и добавляет пользовательскую валидацию для обеспечения того, что номер телефона содержит только цифры.

source: In a serializer, include this field to handle phone numbers:
ru: В сериализаторе включите это поле для обработки номеров телефонов:

source: This example assumes a serializer where the ``phone_number`` field represents a phone number in international format. The ``PhoneField`` will then handle the validation and representation of phone numbers, making it convenient for users to input standardized phone numbers.
ru: В этом примере предполагается, что сериализатор имеет поле `phone_number`, представляющее номер телефона в международном формате. `PhoneField` затем обработает валидацию и представление номеров телефонов, облегчая пользователям ввод стандартизированных номеров телефонов.

source: The field will be displayed in the client application as an input field for entering a phone number, including the country code.
ru: Поле будет отображаться в клиентском приложении в виде поля ввода для ввода номера телефона, включая код страны.

source: Integer field that renders +/- buttons.
ru: Целочисленное поле, которое отрисовывается как кнопки +/-.

source: A versatile field for encoding various types of data into QR codes.
ru: Универсальное поле для кодирования различных типов данных в QR-коды.

source: This field can encode a wide range of data into a QR code representation, making it useful for displaying QR codes in the user interface. It works by serializing or deserializing data using the specified child field.
ru: Это поле может закодировать различные типы данных в представление QR-кода, что делает его полезным для отображения QR-кодов в пользовательском интерфейсе. Оно работает путем сериализации или десериализации данных с использованием указанного дочернего поля.

source: Suppose you have a model with a `data` field, and you want to display its QR code representation in the GUI. You can use `QrCodeField` in your serializer:
ru: Предположим, у вас есть модель с полем `data`, и вы хотите отображать его представление в виде QR-кода в графическом интерфейсе пользователя. Вы можете использовать `QrCodeField` в своем сериализаторе:

source: In this example, the qr_code_data field will represent the QR code generated from the data field in the GUI. Users can interact with this QR code, and if their device supports it, they can scan the code for further actions.
ru: В этом примере поле qr_code_data будет представлять QR-код, сгенерированный из поля данных в графическом интерфейсе пользователя. Пользователи могут взаимодействовать с этим QR-кодом, и, если их устройство поддерживает, они могут сканировать код для дополнительных действий.

source: Extends class 'rest_framework.serializers.FloatField'. This field represents a rating form input on frontend. Grading limits can be specified with 'min_value=' and 'max_value=', defaults are 0 to 5. Minimal step between grades are specified in 'step=', default - 1. Frontend visual representation can be chosen with 'front_style=', available variants are listed in 'self.valid_front_styles'.
ru: Расширяет класс 'rest_framework.serializers.FloatField'. Это поле представляет собой ввод рейтинга пользователем на фронтенде. Пределы оценок могут быть заданы с помощью 'min_value=' и 'max_value=', по умолчанию 0 и 5 соответственно. Минимальный шаг между оценками определяется параметром 'step=', по умолчанию 1. Внешний вид на фронтенде может быть выбран с помощью 'front_style=', доступные варианты перечислены в 'self.valid_front_styles'.

source: For 'slider' front style, you can specify slider color, by passing valid color to 'color='. For 'fa_icon' front style, you can specify FontAwesome icon that would be used for displaying rating, by passing a valid FontAwesome icon code to 'fa_class='.
ru: Для стиля 'slider' вы можете указать цвет слайдера, передав валидный цвет в 'color='. Для стиля 'fa_icon' вы можете указать иконку FontAwesome, которая будет использована для отображения рейтинга, передав валидный код иконки FontAwesome в 'fa_class='.

source: minimal level
ru: минимальный уровень

source: maximal level
ru: максимальный уровень

source: minimal step between levels
ru: минимальный шаг между уровнями

source: visualization on frontend field. Allowed: ['stars', 'slider', 'fa_icon'].
ru: визуализация поля на фронтенде. Допустимы: ['stars', 'slider', 'fa_icon'].

source: color of rating element (star, icon or slider) in css format
ru: цвет элемента рейтинга (star, icon или slider) в формате css

source: FontAwesome icon code
ru: код иконки FontAwesome

source: Field for redirect by string. Often used in actions for redirect after execution.
ru: Поле для редиректа по строке. Часто используется в экшенах для редиректа после выполнения.

source: Effective only in GUI. Works similar to :class:`rest_framework.fields.IntegerField` in API.
ru: Действует только в графическом интерфейсе. Работает аналогично :class:`rest_framework.fields.IntegerField` в API.

source: Field mixin indicates that this field is used to send redirect address to frontend after some action.
ru: Миксина поля, указывающая, что это поле используется для отправки адреса редиректа после некоторого действия.

source: prefix for operation_id, for example if operation_id is `history_get` then operation_name is `history`
ru: префикс для operation_id, например, если operation_id = `history_get`, то operation_name = `history`

source: name of the field that we depend on, its value will be used for operation_id
ru: имя поля, от которого оно зависит, его значение будет использовано для operation_id

source: if True then name of the field will be added at the end of operation_id
ru: если True, то имя поля будет добавлено в конец operation_id

source: Field for redirect by id. Often used in actions for redirect after execution.
ru: Поля для редиректа по id. Часто используется в экшенах для редиректа после выполнения.

source: Extends :class:`.VSTCharField` to represent a reverse ForeignKey relation as a list of related instances.
ru: Расширяет класс :class:`.VSTCharField`. Представляет обратное ForeignKey отношение в виде списка связанных экземпляров.

source: This field allows you to output the reverse ForeignKey relation as a list of related instances. To use it, specify the ``related_name`` kwarg (related manager for reverse ForeignKey) and the ``fields`` kwarg (list or tuple of fields from the related model to be included).
ru: Это поле позволяет представить обратное ForeignKey отношение в виде списка связанных экземпляров. Для использования укажите ``related_name`` (related manager для обратного ForeignKey) и ``fields`` (список или кортеж полей из связанной модели, которые должны быть включены).

source: By default, :class:`.VSTCharField` is used to serialize all field values and represent them on the frontend. You can specify the `serializer_class` and override fields as needed. For example, title, description, and other field properties can be set to customize frontend behavior.
ru: По умолчанию используется :class:`.VSTCharField` для сериализации всех значений поля и их представления на фронтенде. Вы можете указать `serializer_class` и переопределить поля по мере необходимости. Например, заголовок, описание и другие свойства полей можно установить для настройки поведения на фронтенде.

source: Name of a related manager for reverse ForeignKey.
ru: Имя related manager для обратного ForeignKey.

source: List of related model fields.
ru: Список связанных полей модели.

source: Determines how fields are represented on the frontend. Must be either ``list`` or ``table``.
ru: Определяет, как поля будут представлены на фронтенде. Должен быть либо ``list``, либо ``table``.

source: Custom handlers mapping, where key: field_name, value: callable_obj that takes params: instance[dict], fields_mapping[dict], model, field_name[str].
ru: Отображение пользовательских обработчиков, где ключ: field_name, значение: callable_obj, принимающий параметры: instance[dict], fields_mapping[dict], model, field_name[str].

source: Serializer to customize types of fields. If no serializer is provided, :class:`.VSTCharField` will be used for every field in the `fields` list.
ru: Сериализатор для настройки типов полей. Если сериализатор не предоставлен, будет использован :class:`.VSTCharField` для каждого поля из списка `fields`.

source: This field is deprecated. Use serializers with the ``many=True`` attribute. To change the display on the page, use :const:`vstutils.api.serializers.DisplayModeList`.
ru: Это поле устарело. Используйте сериализаторы с атрибутом ``many=True``. Чтобы изменить отображение на странице, используйте :const:`vstutils.api.serializers.DisplayModeList`.

source: A read-only serializer field that displays a link to another page or a simple text label in the interface.
ru: Поле сериализатора, позволяющее отображать ссылку на другую страницу или простой текст в интерфейсе.

source: **Expected Input:**
ru: **Ожидаемый ввод:**

source: This field expects a dictionary with the following keys:
ru: Этот поле ожидает словарь с следующими ключами:

source: **link** *(optional)*: The URL or route to another page. If provided, the label will be displayed as a clickable link. If not provided, only the text label is shown. The value should be compatible with the `Vue Router's push method parameter <https://router.vuejs.org/api/interfaces/Router.html#push>`_. Ensure that the link points to an existing resource in the interface to avoid 404 errors.
ru: **link** *(необязательно)*: URL для другой страницы. Если указан, будет отображаться текст как ссылка. Если не указан, будет отображаться просто текст. Значение должно быть совместимым с `параметром метода push Vue Router <https://router.vuejs.org/api/interfaces/Router.html#push>`_. Убедитесь, что ссылка указывает на существующий ресурс в интерфейсе для избежания ошибок 404.

source: **label**: The text to display. This is required whether or not a link is provided.
ru: **label**: Текст для отображения. Обязательное поле.

source: For simpler use cases, you might consider using :class:`.FkField`.
ru: Для простых случаев использования см. :class:`.FkField`.

source: **Examples:**
ru: **Примеры:**

source: *Using a model class method:*
ru: *Использование метода класса модели:*

source: In this example, the ``get_link`` method in the ``Author`` model returns a dictionary containing the ``link`` and ``label``. The ``RouterLinkField`` uses this method to display the author's name as a clickable link to their detail page.
ru: В этом примере метод ``get_link`` в модели ``Author`` возвращает словарь с ключами ``link`` и ``label``. Поле ``RouterLinkField`` использует этот метод для отображения имени автора как ссылку на страницу с подробностями.

source: *Using a custom field class:*
ru: *Использование пользовательского класса поля:*

source: In this example, we create a custom field ``AuthorLinkField`` by subclassing ``RouterLinkField``. We override the ``to_representation`` method to return a dictionary with the ``link`` and ``label`` for each ``Author`` instance. This custom field is then used in the viewset to display each author's name as a clickable link.
ru: В этом примере мы создаем пользовательский класс ``AuthorLinkField`` подклассом ``RouterLinkField``. Мы переопределяем метод ``to_representation`` для возвращения словаря с ключами ``link`` и ``label`` для каждого экземпляра ``Author``. Этот пользовательский поле используется в вьюсете для отображения имени автора как кликабельной ссылки.

source: The field is read-only and is intended to display dynamic links based on the instance data.
ru: Поле является только для чтения и предназначено для отображения динамических ссылок на основе данных экземпляра.

source: If the ``link`` key is omitted or ``None``, the field will display the ``label`` as plain text instead of a link.
ru: Если ключ ``link`` отсутствует или имеет значение ``None``, поле отображает текст как обычный текст вместо ссылки.

source: Always ensure that the ``link`` provided points to a valid route within your application to prevent users from encountering 404 errors.
ru: Всегда убедитесь, что предоставленная ссылка указывает на действительную страницу в вашем приложении для избежания ошибок 404.

source: This field extends :class:`.FileInStringField` but hides its value in the admin interface.
ru: Поле, расширяющее :class:`.FileInStringField`, но скрывающее свое значение в интерфейсе администратора.

source: A specialized field that allows the input and display of multiline text.
ru: Специализированное поле, которое позволяет вводить и отображать многострочный текст.
