Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/frontend-manual.po
Languages: ru

source: **fk_autocomplete** - field, that is used for representation of some Model Instance from API (value of this field is the Model Instance Primary Key or some string). During edit mode user can either choose of the preset values from autocomplete list or insert his own value;
ru: **fk_autocomplete** - поле, используемое для представления некоторого экземпляра модели из API (значение этого поля - первичный ключ экземпляра модели или некоторая строка). Во время режима редактирования пользователь может либо выбрать одно из предопределенных значений из списка автозаполнения, либо ввести свое собственное значение;

source: **fk_multi_autocomplete** - field, that is used for representation of some Model Instance from API (value of this field is the Model Instance Primary Key or some string). During edit mode user can either choose of the preset values from modal window or insert his own value;
ru: **fk_multi_autocomplete** - поле, используемое для представления некоторого экземпляра модели из API (значение этого поля - первичный ключ экземпляра модели или некоторая строка). Во время режима редактирования пользователь может либо выбрать одно из предопределенных значений из модального окна, либо ввести свое собственное значение;

source: **color** - string field, that stores HEX code of selected color;
ru: **color** - строковое поле, которое сохраняет шестнадцатеричный код выбранного цвета;

source: **inner_api_object** - field, that is linked to the fields of another model;
ru: **inner_api_object** - поле, которое связано с полями другой модели;

source: **api_data** - field for representing some data from API;
ru: **api_data** - поле для представления некоторых данных из API;

source: **dynamic** - field, that can change its format depending on the values of surrounding fields;
ru: **dynamic** - поле, которое может изменять свой формат в зависимости от значений окружающих полей;

source: **hidden** - field, that is hidden from representation;
ru: **hidden** - поле, скрытое от представления;

source: **form** - field, that combines several other fields and stores those values as one JSON, where key - name of form field, value - value of form field;
ru: **form** - поле, объединяющее несколько других полей и сохраняющее их значения как один JSON, где key - имя поля формы, value - значение поля формы;

source: **button** - special field for form field, imitates button in form;
ru: **button** - специальное поле для формы, имитирующее кнопку в форме;

source: **string_array** - field, that converts array with strings into one string;
ru: **string_array** - поле, преобразующее массив строк в одну строку;

source: **string_id** - string field, that is supposed to be used in URLs as 'id' key. It has additional validation, that checks, that field's value is not equal to some other URL keys (new/ edit/ remove).
ru: **string_id** - строковое поле, предназначенное для использования в URL как ключ 'id'. Он имеет дополнительную проверку, которая проверяет, что значение поля не равно некоторым другим ключам URL (new/ edit/ remove).

source: Layout customization with CSS
ru: Настройка макета с использованием CSS

source: If you need to customize elements with css we have some functionality for it. There are classes applied to root elements of ``EntityView`` (if it contains `ModelField`), ``ModelField`` , ``ListTableRow`` and ``MultiActions`` depending on the fields they contain. Classes are formed for the fields with "boolean" and "choices" types. Also classes apply to operations buttons and links.
ru: Если вам нужно настроить элементы с помощью CSS, у нас есть некоторая функциональность для этого. К корневым элементам ``EntityView`` (если он содержит `ModelField`), ``ModelField``, ``ListTableRow`` и ``MultiActions`` применяются классы в зависимости от полей, которые они содержат. Классы формируются для полей типов "boolean" и "choices". Кроме того, классы применяются к кнопкам операций и ссылкам.

source: Classes generation rules
ru: Правила генерации классов

source: ``EntityView, ModelField and ListTableRow`` - *field-[field_name]-[field-value]*
ru: ``EntityView, ModelField и ListTableRow`` - *field-[field_name]-[field-value]*

source: **Example:**
ru: **Пример:**

source: *"field-active-true"* for model that contains "boolean" field with name "active" and value "true"
ru: *"field-active-true"* для модели, содержащей поле "boolean" с именем "active" и значением "true"

source: *"field-tariff_type-WAREHOUSE"* for model that contains "choices" field with name "tariff_type" and value "WAREHOUSE"
ru: *"field-tariff_type-WAREHOUSE"* для модели, содержащей поле "choices" с именем "tariff_type" и значением "WAREHOUSE"

source: *"selected__field-tariff_type-WAREHOUSE"* and *"selected__field-tariff_type-SLIDE"* if selected 2 ``ListTableRow`` that contains "choices" field with name "tariff_type" and values "WAREHOUSE" and "SLIDE" respectively.
ru: *"selected__field-tariff_type-WAREHOUSE"* и *"selected__field-tariff_type-SLIDE"*, если выбраны 2 строки ``ListTableRow``, содержащие поле "choices" с именем "tariff_type" и значениями "WAREHOUSE" и "SLIDE" соответственно.

source: **Warning**
ru: **Предупреждение**

source: If you hide operations using CSS classes and for example all actions were hidden then Actions dropdown button will still be visible.
ru: Если вы скрываете операции с использованием классов CSS и, например, все действия были скрыты, то кнопка выпадающего списка действий все равно будет видна.

source: For better control over actions and sublinks see :ref:`changing-actions-or-sublinks`
ru: Для более тщательного контроля над действиями и подссылками см. :ref:`changing-actions-or-sublinks`

source: *operation__pickup_point* if operation button or link has name *pickup_point*
ru: *operation__pickup_point*, если кнопка операции или ссылка имеют имя *pickup_point*

source: Based on these classes, you can change the styles of various elements.
ru: На основе этих классов вы можете изменять стили различных элементов.

source: A few use cases:
ru: Несколько вариантов использования:

source: If you need to hide the button for the "change_category" action on a product detail view when product is not "active", you can do so by adding a CSS selector:
ru: Если вам нужно скрыть кнопку для действия "change_category" на странице подробной информации о продукте, когда продукт неактивен, вы можете сделать это, добавив селектор CSS:

source: Hide the button for the "remove" action in ``MultiActions`` menu if selected at least one product with status "active":
ru: Скрыть кнопку для действия "remove" в меню ``MultiActions``, если выбран хотя бы один продукт со статусом "active":

source: If you need to change *background-color* to red for order with status "CANCELLED" on ``ListView`` component do this:
ru: Если вам нужно изменить *цвет фона* на красный для заказа со статусом "CANCELLED" на компоненте ``ListView``, сделайте следующее:

source: In this case, you need to use the extra class "item-row" (Used for example, you can choose another one) for specify the element to be selected in the selector, because the class "field-status-CANCELLED" is added in different places on the page.
ru: В этом случае вам нужно использовать дополнительный класс "item-row" (Используется для напримера, вы можете выбрать другой) для указания элемента, который будет выбран в селекторе, потому что класс "field-status-CANCELLED" добавляется в различные места на странице.
