Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/frontend-manual.po
Languages: ru

source: Frontend documentation
ru: Документация по фронтенду

source: API Flowchart
ru: Схема API

source: This flowchart shows how data goes though application from and to API.
ru: Эта схема показывает, как данные проходят через приложение от и до API.

source: Signals
ru: Сигналы

source: System of signals is a mechanism, that VST Utils uses for app customization.
ru: Система сигналов - это механизм, который VST Utils использует для настройки приложения.

source: Let's look how it works.
ru: Давайте посмотрим, как это работает.

source: Very often you need to modify something after some event has occurred. But how can you know about this event? And what if you need to know about this event in several blocks of code?
ru: Очень часто вам нужно что-то изменить после того, как произошло какое-то событие. Но как вы можете узнать о этом событии? А что, если вам нужно знать об этом событии в нескольких блоках кода?

source: To solve this problem VST Utils uses system of signals, where:
ru: Чтобы решить эту проблему, VST Utils использует систему сигналов, где:

source: you can emit some signal, which tells all subscribers, that some event has occurred, and pass some data/variables from the context, where this event has occurred;
ru: вы можете отправить какой-то сигнал, который сообщит всем подписчикам, что произошло какое-то событие, и передать некоторые данные/переменные из контекста, где произошло это событие;

source: you can subscribe to some signal, that notifies you about some event, and also you can pass some callback (handler) that can do something with data/variables, that were passed from the context, where event had occurred.
ru: вы можете подписаться на какой-то сигнал, который уведомит вас о каком-то событии, и вы также можете передать некоторый обратный вызов (обработчик), который может делать что-то с данными/переменными, которые были переданы из контекста, где произошло событие.

source: Emit signal
ru: Генерация сигнала

source: To emit some signal you need to write following in you code:
ru: Чтобы сгенерировать сигнал, вам нужно написать следующее в своем коде:

source: where:
ru: где:

source: **name_of_signal** - string, which stores name of signal (event);
ru: **name_of_signal** - строка, которая хранит имя сигнала (события);

source: **context** - some variable of any type, that will be passed to the callback (handler) during connection to this signal.
ru: **context** - некоторая переменная любого типа, которая будет передана в обратный вызов (обработчик) во время подключения к этому сигналу.

source: Example of signal emitting:
ru: Пример генерации сигнала:

source: Connect to signal
ru: Подключение к сигналу

source: To connect to some signal you need to write following in you code:
ru: Чтобы подключиться к какому-то сигналу, вам нужно написать следующее в своем коде:

source: **callback** - function, that can do something with variables, which will be passed from event's context to this callback as arguments.
ru: **callback** - функция, которая может выполнять действия с переменными, которые будут переданы из контекста события в этот обратный вызов в качестве аргументов.

source: Example of connecting to signal:
ru: Пример подключения к сигналу:

source: List of signals in VST Utils
ru: Список сигналов в VST Utils

source: VST Utils has some signals, that are emitting during application work. If you need to customize something in you project you can subscribe to these signals and add callback function with desired behavior. Also you can emit you own signals in your project.
ru: VST Utils имеет несколько сигналов, которые генерируются во время работы приложения. Если вам нужно настроить что-то в вашем проекте, вы можете подписаться на эти сигналы и добавить функцию обратного вызова с желаемым поведением. Также вы можете генерировать свои сигналы в своем проекте.

source: **Signal name:** "openapi.loaded".
ru: **Имя сигнала:** "openapi.loaded".

source: **Context argument:** openapi - {object} - OpenAPI schema loaded from API.
ru: **Аргумент контекста:** openapi - {object} - OpenAPI-схема, загруженная из API.

source: **Description:** This signal is emitted after OpenAPI schema was loaded. You can use this signal if you need to change something in the OpenAPI schema, before it was parsed.
ru: **Описание:** Этот сигнал генерируется после загрузки схемы OpenAPI. Вы можете использовать этот сигнал, если вам нужно что-то изменить в схеме OpenAPI, прежде чем она будет разобрана.

source: **Signal name:** "resource.loaded".
ru: **Имя сигнала:** "resource.loaded".

source: **Context argument:** None.
ru: **Аргумент контекста:** Нет.

source: **Description:** This signal is emitted after all static files were successfully loaded and added to the page.
ru: **Описание:** Этот сигнал генерируется после успешной загрузки всех статических файлов и их добавления на страницу.

source: **Signal name:** "app.version.updated".
ru: **Имя сигнала:** "app.version.updated".

source: **Description:** This signal is emitted during app loading if VST Utils detects, that version of your project was updated.
ru: **Описание:** Этот сигнал генерируется во время загрузки приложения, если VST Utils обнаруживает, что версия вашего проекта была обновлена.

source: **Signal name:** "app.beforeInitRouter".
ru: **Имя сигнала:** "app.beforeInitRouter".

source: **Context argument:** obj - {object} - Object with following structure: {routerConstructor: RouterConstructor}, where routerConstructor is an instance of RouterConstructor.
ru: **Аргумент контекста:** obj - {object} - Объект со следующей структурой: {routerConstructor: RouterConstructor}, где routerConstructor - это экземпляр RouterConstructor.

source: **Description:** This signal is emitted after creation of RouterConstructor instance and before app creation
ru: **Описание:** Этот сигнал генерируется после создания экземпляра RouterConstructor и перед созданием приложения.

source: **Signal name:** "app.beforeInit".
ru: **Имя сигнала:** "app.beforeInit".

source: **Context argument:** obj - {object} - Object with following structure: {app: app}, where app is an instance of App class.
ru: **Аргумент контекста:** obj - {object} - Объект со следующей структурой: {app: app}, где app - это экземпляр класса App.

source: **Description:** This signal is emitted after app variable initialization (OpenAPI schema was parsed, models and views were created), but before app was mounted to the page.
ru: **Описание:** Этот сигнал генерируется после инициализации переменной приложения (разбор схемы OpenAPI, создание моделей и представлений), но перед тем, как приложение будет смонтировано на страницу.

source: **Signal name:** "app.afterInit".
ru: **Имя сигнала:** "app.afterInit".

source: **Description:** This signal is emitted after app was mounted to the page.
ru: **Описание:** Этот сигнал генерируется после того, как приложение было смонтировано на страницу.

source: **Signal name:** "app.language.changed".
ru: **Имя сигнала:** "app.language.changed".

source: **Context argument:** obj - {object} - Object with following structure: {lang: lang}, where lang is an code of applied language.
ru: **Аргумент контекста:** obj - {object} - Объект со следующей структурой: {lang: lang}, где lang - это код примененного языка.

source: **Description:** This signal is emitted after app interface language was changed.
ru: **Описание:** Этот сигнал генерируется после изменения языка интерфейса приложения.

source: **Signal name:** "models[" + model_name + "].fields.beforeInit". For example, for User model: "models[User].fields.beforeInit".
ru: **Имя сигнала:** "models[" + model_name + "].fields.beforeInit". Например, для модели пользователя: "models[User].fields.beforeInit".

source: **Context argument:** fields - {object} - Object with pairs of key, value, where key - name of field, value - object with it options. On this moment, field - is just object with options, it is not guiFields instance.
ru: **Контекстный аргумент:** fields - {object} - Объект с парами ключ-значение, где ключ - имя поля, значение - объект с его опциями. На данный момент поле - просто объект с опциями, это не экземпляр guiFields.

source: **Description:** This signal is emitted before creation of guiFields instances for Model fields.
ru: **Описание:** Этот сигнал генерируется перед созданием экземпляров guiFields для полей модели.

source: **Signal name:** "models[" + model_name + "].fields.afterInit". For example, for User model: "models[User].fields.afterInit".
ru: **Имя сигнала:** "models[" + model_name + "].fields.afterInit". Например, для модели пользователя: "models[User].fields.afterInit".

source: **Context argument:** fields - {object} - Object with pairs of key, value, where key - name of field, value - guiFields instance.
ru: **Контекстный аргумент:** fields - {object} - Объект с парами ключ-значение, где ключ - имя поля, значение - экземпляр guiFields.

source: **Description:** This signal is emitted after creation of guiFields instances for Model fields.
ru: **Описание:** Этот сигнал генерируется после создания экземпляров guiFields для полей модели.

source: **Signal name:** "models[" + model_name + "].created". For example, for User model: "models[User].created".
ru: **Имя сигнала:** "models[" + model_name + "].created". Например, для модели пользователя: "models[User].created".

source: **Context argument:** obj - {object} - Object with following structure: {model: model}, where model is the created Model.
ru: **Контекстный аргумент:** obj - {object} - Объект со следующей структурой: {model: model}, где model - созданная модель.

source: **Description:** This signal is emitted after creation of Model object.
ru: **Описание:** Этот сигнал генерируется после создания объекта модели.

source: **Signal name:** "allModels.created".
ru: **Имя сигнала:** "allModels.created".

source: **Context argument:** obj - {object} - Object with following structure: {models: models}, where models is the object, storing Models objects.
ru: **Контекстный аргумент:** obj - {object} - Объект со следующей структурой: {models: models}, где models - объект, хранящий объекты моделей.

source: **Description:** This signal is emitted after all models were created.
ru: **Описание:** Этот сигнал генерируется после создания всех моделей.

source: **Signal name:** "allViews.created".
ru: **Имя сигнала:** "allViews.created".

source: **Context argument:** obj - {object} - Object with following structure: {views: views}, where views - object with all View Instances.
ru: **Контекстный аргумент:** obj - {object} - Объект со следующей структурой: {views: views}, где views - объект со всеми экземплярами представлений.

source: **Description:** This signal is emitted after creation of all View Instances, with set actions / child_links / multi_actions / operations / sublinks properties.
ru: **Описание:** Этот сигнал генерируется после создания всех экземпляров представлений с установленными свойствами actions / child_links / multi_actions / operations / sublinks.

source: **Signal name:** "routes[" + name + "].created". For example, for ``/user/`` view: "routes[/user/].created".
ru: **Имя сигнала:** "routes[" + name + "].created". Например, для представления ``/user/``: "routes[/user/].created".

source: **Context argument:** route - {object} - Object with following structure: {name: name, path: path, component: component}, where name - name of route, path - template of route's path, component - component, that will be rendered for current route.
ru: **Контекстный аргумент:** route - {object} - Объект со следующей структурой: {name: name, path: path, component: component}, где name - имя маршрута, path - шаблон пути маршрута, component - компонент, который будет отображаться для текущего маршрута.

source: **Description:** This signal will be emitted after route was formed and added to routes list.
ru: **Описание:** Этот сигнал будет генерироваться после формирования маршрута и добавления его в список маршрутов.

source: **Signal name:** "allRoutes.created".
ru: **Имя сигнала:** "allRoutes.created".

source: **Context argument:** routes - {array} - Array with route objects with following structure: {name: name, path: path, component: component}, where name - name of route, path - template of route's path, component - component, that will be rendered for current route.
ru: **Контекстный аргумент:** routes - {array} - Массив объектов маршрутов со следующей структурой: {name: name, path: path, component: component}, где name - имя маршрута, path - шаблон пути маршрута, component - компонент, который будет отображаться для текущего маршрута.

source: **Description:** This signal is emitted after all routes was formed and added to routes list.
ru: **Описание:** Этот сигнал генерируется после формирования всех маршрутов и добавления их в список маршрутов.

source: **Signal name:** "<${PATH}>filterActions".
ru: **Имя сигнала:** "<${PATH}>filterActions".

source: **Context argument:** obj - {actions: Object[], data} - Actions is array of action objects. Data represents current instance's data.
ru: **Контекстный аргумент:** obj - {actions: Object[], data} - Actions - массив объектов действий. Data представляет данные текущего экземпляра.

source: **Description:** This signal will be executed to filter actions.
ru: **Описание:** Этот сигнал будет выполнен для фильтрации действий.

source: **Signal name:** "<${PATH}>filterSublinks".
ru: **Имя сигнала:** "<${PATH}>filterSublinks".

source: **Context argument:** obj - {sublinks: Object[], data} - Actions is array of sublink objects. Data represents current instance's data.
ru: **Контекстный аргумент:** obj - {sublinks: Object[], data} - Sublinks - массив объектов подссылок. Data представляет данные текущего экземпляра.

source: **Description:** This signal will be executed to filter sublinks.
ru: **Описание:** Этот сигнал будет выполнен для фильтрации подссылок.

source: Very often during creation of some new app developers need to make common fields of some base types and formats (string, boolean, number and so on). Create everytime similar functionality is rather boring and ineffective, so we tried ti solve this problem with the help of VST Utils.
ru: Файловые форматы

source: VST Utils has set of built-in fields of the most common types and formats, that can be used for different cases. For example, when you need to add some field to you web form, that should hide value of inserted value, just set appropriate field format to ``password`` instead of ``string`` to show stars instead of actual characters.
ru: Часто при создании нового приложения разработчикам нужно создавать общие поля некоторых базовых типов и форматов (строка, булево, число и так далее). Создание каждый раз подобной функциональности довольно скучно и неэффективно, поэтому мы попытались решить эту проблему с помощью VST Utils.

source: Field classes are used in Model Instances as fields and also are used in Views Instances of ``list`` type as filters.
ru: VST Utils содержит набор встроенных полей наиболее распространенных типов и форматов, которые могут использоваться в различных случаях. Например, когда вам нужно добавить какое-то поле в веб-форму, которое должно скрывать значение вставленного значения, просто установите соответствующий формат поля на ``password`` вместо ``string``, чтобы вместо фактических символов отображались звездочки.

source: All available fields classes are stored in the ``guiFields`` variable. There are 44 fields formats in VST Utils:
ru: Все доступные классы полей хранятся в переменной ``guiFields``.На данный момент в VST Utils 44 формата полей:

source: **base** - base field, from which the most other fields are inherited;
ru: **base** - базовое поле, все остальные поля наследуются от этого поля;

source: **string** - string field, for inserting and representation of some short 'string' values;
ru: **string** - строковое поле для вставки и представления коротких значений 'string';

source: **textarea** - string field, for inserting and representation of some long 'string' values;
ru: **textarea** - строковое поле для вставки и представления длинных значений 'string';

source: **number** - number field, for inserting and representation of 'number' values;
ru: **number** - числовое поле для вставки и представления значений 'number';

source: **integer** - number field, for inserting and representation of values of 'integer' format;
ru: **integer** - числовое поле для вставки и представления значений формата 'integer';

source: **int32** - number field, for inserting and representation of values of 'int32' format;
ru: **int32** - числовое поле для вставки и представления значений формата 'int32';

source: **int64** - number field, for inserting and representation of values of 'int64' format;
ru: **int64** - числовое поле для вставки и представления значений формата 'int64';

source: **double** - number field, for inserting and representation of values of 'double' format;
ru: **double** - числовое поле для вставки и представления значений формата 'double';

source: **float** - number field, for inserting and representation of values of 'float' format;;
ru: **float** - числовое поле для вставки и представления значений формата 'float';

source: **boolean** - boolean field, for inserting and representation of 'boolean' values;
ru: **boolean** - логическое поле для вставки и представления значений 'boolean';

source: **choices** - string field, with strict set of preset values, user can only choose one of the available value variants;
ru: **choices** - строковое поле с жестким набором предопределенных значений, пользователь может выбрать только одно из доступных значений;

source: **autocomplete** - string field, with set of preset values, user can either choose one of the available value variants or insert his own value;
ru: **autocomplete** - строковое поле с набором предопределенных значений, пользователь может либо выбрать одно из доступных значений, либо ввести свое собственное значение;

source: **password** - string field, that hides inserted value by '*' symbols;
ru: **password** - строковое поле, скрывающее вставленное значение знаками '*'

source: **file** - string field, that can read content of the file;
ru: **file** - строковое поле, способное считывать содержимое файла;

source: **secretfile** - string field, that can read content of the file and then hide it from representation;
ru: **secretfile** - строковое поле, которое может считать содержимое файла, а затем скрыть его при отображении;

source: **binfile** - string field, that can read content of the file and convert it to the 'base64' format;
ru: **binfile** - строковое поле, которое может считать содержимое файла и преобразовывать его в формат 'base64';

source: **namedbinfile** - field of JSON format, that takes and returns JSON with 2 properties: name (string) - name of file and content(base64 string) - content of file;
ru: **namedbinfile** - поле в формате JSON, которое принимает и возвращает JSON с 2 свойствами: name (строка) - имя файла и content (строка base64) - содержание файла;

source: **namedbinimage** - field of JSON format, that takes and returns JSON with 2 properties: name (string) - name of image and content(base64 string) - content of image;
ru: **namedbinimage** - поле в формате JSON, которое принимает и возвращает JSON с 2 свойствами: name (строка) - имя изображения и content (строка base64) - содержание изображения;

source: **multiplenamedbinfile** - field of JSON format, that takes and returns array with objects, consisting of 2 properties: name (string) - name of file and content(base64 string) - content of file;
ru: **multiplenamedbinimage** - поле в формате JSON, которое принимает и возвращает массив объектов, состоящих из 2 свойств: name (строка) - имя изображения и content (строка base64) - содержание изображения;

source: **multiplenamedbinimage** - field of JSON format, that takes and returns array with objects, consisting of 2 properties: name (string) - name of image and content(base64 string) - content of image;
ru: **multiplenamedbinimage** - поле в формате JSON, которое принимает и возвращает массив объектов, состоящих из 2 свойств: name (строка) - имя изображения и content (строка base64) - содержание изображения;

source: **text_paragraph** - string field, that is represented as text paragraph (without any inputs);
ru: **text_paragraph** - строковое поле, представленное в виде текстового абзаца (без каких-либо вводов);

source: **plain_text** - string field, that saves all non-printing characters during representation;
ru: **plain_text** - строковое поле, сохраняющее все непечатные символы во время представления;

source: **html** - string field, that contents different html tags and that renders them during representation;
ru: **html** - строковое поле, содержащее различные теги HTML и отображающее их во время представления;

source: **date** - date field, for inserting and representation of 'date' values in 'YYYY-MM-DD' format;
ru: **date** - поле даты для вставки и представления значений 'date' в формате 'YYYY-MM-DD';

source: **date_time** - date field, for inserting and representation of 'date' values in 'YYYY-MM-DD HH:mm' format;
ru: **date_time** - поле даты для вставки и представления значений 'date' в формате 'YYYY-MM-DD HH:mm';

source: **uptime** - string field, that converts time duration (amount of seconds) into one of the most appropriate variants (23:59:59 / 01d 00:00:00 / 01m 30d 00:00:00 / 99y 11m 30d 22:23:24) due to the it's value size;
ru: **uptime** - строковое поле, которое преобразует продолжительность времени (количество секунд) в один из наиболее подходящих вариантов (23:59:59 / 01d 00:00:00 / 01m 30d 00:00:00 / 99y 11m 30d 22:23:24) в зависимости от его размера;

source: **time_interval** - number field, that converts time from milliseconds into seconds;
ru: **time_interval** - числовое поле, которое преобразует время из миллисекунд в секунды;

source: **crontab** - string field, that has additional form for creation schedule in 'crontab' format;
ru: **crontab** - строковое поле, которое имеет дополнительную форму для создания расписания в формате 'crontab';

source: **json** - field of JSON format, during representation it uses another guiFields for representation of current field properties;
ru: **json** - поле в формате JSON, во время представления использует другие guiFields для представления текущих свойств поля;

source: **api_object** - field, that is used for representation of some Model Instance from API (value of this field is the whole Model Instance data). This is read only field;
ru: **api_object** - поле, используемое для представления некоторого экземпляра модели из API (значение этого поля - все данные экземпляра модели). Это только для чтения поле;

source: **fk** - field, that is used for representation of some Model Instance from API (value of this field is the Model Instance Primary Key). During edit mode this field has strict set of preset values to choose;
ru: **fk** - поле, используемое для представления некоторого экземпляра модели из API (значение этого поля - первичный ключ экземпляра модели). Во время режима редактирования у этого поля есть строгий набор предопределенных значений для выбора;
