Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/quickstart-front.po
Languages: ru

source: Frontend Quickstart
ru: Быстрый старт фронтенда

source: VST utils framework uses Vue ecosystem to render frontend. The quickstart manual will guide you through the most important steps to customize frontend features. App installation and setting up described in - :doc:`Backend Section <quickstart>` of this docs.
ru: Фреймворк VST utils использует экосистему Vue для отображения фронтенда. Руководство по быстрому старту проведет вас через наиболее важные шаги по настройке функций фронтенда. Установка приложения и настройка описаны в - :doc:`разделе Backend <quickstart>` этой документации.

source: There are several stages in vstutils app:
ru: Есть несколько этапов в приложении VST utils:

source: Before app started:
ru: Перед запуском приложения:

source: `checkCacheVersions()` checks if app version has been changed since last visit and cleans all cached data if so;
ru: `checkCacheVersions()` проверяет, была ли изменена версия приложения с последнего посещения и очищает все кэшированные данные, если это так;

source: loading open api schema from backend. Emits 'openapi.loaded' signal;
ru: загрузка схемы OpenAPI с бэкенда. Генерирует сигнал 'openapi.loaded';

source: loading all static files from `SPA_STATIC` in setting.py;
ru: загрузка всех статических файлов из `SPA_STATIC` в setting.py;

source: sets `AppConfiguration` from OpenAPI schema;
ru: устанавливает `AppConfiguration` из схемы OpenAPI;

source: App started:
ru: Приложение запущено:

source: if there is centrifugoClient in settings.py connects it. To read more about centrifugo configuration check ":ref:`centrifugo`";
ru: если в settings.py есть centrifugoClient, подключается к нему. Дополнительные сведения о конфигурации centrifugo можно найти в разделе ":ref:`centrifugo`";

source: downloading a list of available languages and translations;
ru: загрузка списка доступных языков и переводов;

source: `api.loadUser()` returns user data;
ru: `api.loadUser()` возвращает данные пользователя;

source: `ModelsResolver` creates models from schema, emits signal `models[${modelName}].created` for each created model and `allModels.created` when all models created;
ru: `ModelsResolver` создает модели из схемы, генерирует сигнал `models[${modelName}].created` для каждой созданной модели и `allModels.created`, когда все модели созданы;

source: `ViewConstructor.generateViews()` inits `View` fieldClasses and modelClasses;
ru: `ViewConstructor.generateViews()` инициализирует `View` fieldClasses и modelClasses;

source: `QuerySetsResolver` finds appropriate queryset by model name and view path;
ru: `QuerySetsResolver` находит соответствующий queryset по имени модели и пути представления;

source: `global_components.registerAll()` registers Vue `global_components`;
ru: `global_components.registerAll()` регистрирует Vue `global_components`;

source: `prepare()` emits `app.beforeInit` with { app: this };
ru: `prepare()` генерирует сигнал `app.beforeInit` с { app: this };

source: initialize model with `LocalSettings`. Find out more about this in the section :ref:`localSettings`;
ru: инициализация модели с `LocalSettings`. Узнайте больше об этом в разделе :ref:`localSettings`;

source: creates routerConstructor from `this.views`, emits 'app.beforeInitRouter' with { routerConstructor } and gets new VueRouter({this.routes});
ru: создание routerConstructor из `this.views`, генерация сигнала 'app.beforeInitRouter' с { routerConstructor } и получение нового VueRouter({this.routes});

source: inits application `Vue()` from schema.info, pinia store and emits 'app.afterInit' with {app: this};
ru: инициализация приложения `Vue()` из schema.info, хранилища pinia и генерация сигнала 'app.afterInit' с {app: this};

source: Application mounted.
ru: Приложение смонтировано.

source: There is a flowchart representing application initialization process (signal names have red font):
ru: Есть схема, представляющая процесс инициализации приложения (названия сигналов красным шрифтом):

source: Field customization
ru: Настройка поля

source: To add custom script to the project, set script name in settings.py
ru: Чтобы добавить собственный скрипт в проект, укажите его имя в settings.py

source: and put the script (`main.js`) in `{appName}/static/` directory.
ru: и поместите скрипт (`main.js`) в каталог `{appName}/static/`.

source: In `main.js` create new field by extending it from BaseField (or any other appropriate field)
ru: В `main.js` создайте новое поле, расширив его от BaseField (или любого другого соответствующего поля)

source: For example lets create a field that renders HTML h1 element with 'Hello World!` text:
ru: Например, создадим поле, которое отображает элемент HTML h1 с текстом 'Привет, мир!'

source: Or render person's name with some prefix
ru: Или отобразите имя человека с некоторым префиксом

source: Register this field to `app.fieldsResolver` to provide appropriate field format and type to a new field
ru: Зарегистрируйте это поле в `app.fieldsResolver`, чтобы предоставить соответствующий формат и тип поля для нового поля

source: Listen for a appropriate `models[ModelWithFieldToChange].fields.beforeInit` signal to change field Format
ru: Слушайте подходящий сигнал `models[ModelWithFieldToChange].fields.beforeInit` для изменения формата поля

source: List of models and their fields is available during runtime in console at `app.modelsClasses`
ru: Список моделей и их полей доступен во время выполнения в консоли по адресу `app.modelsClasses`

source: To change Filed behavior, create new field class with a desired logic. Let's say you need to send number of milliseconds to API, user however wants to type in number of seconds. A solution would be to override field's `toInner` and `toRepresent` methods.
ru: Чтобы изменить поведение поля, создайте новый класс поля с необходимой логикой. Допустим, вам нужно отправить API количество миллисекунд, но пользователь хочет вводить количество секунд. Решением будет переопределить методы `toInner` и `toRepresent` поля.

source: Now you have field that show seconds, but saves/receives data in milliseconds on detail view of AllFieldsModel.
ru: Теперь у вас есть поле, которое отображает секунды, но сохраняет/получает данные в миллисекундах в виде детализированного представления модели AllFieldsModel.

source: If you need to show some warning or error to developer console you can use field `warn` and `error` methods. You can pass some message and it will print it with field type, model name and field name.
ru: Если вам нужно показать какое-то предупреждение или ошибку в консоли разработчика, вы можете использовать методы `warn` и `error` поля. Вы можете передать сообщение, и оно будет выведено с типом поля, именем модели и именем поля.

source: Change path to FkField
ru: Изменение пути к полю FkField

source: Sometime you may need to request different set of objects for FkField. For example to choose from only famous authors, create `famous_author` endpoint on backend and set FkField request path to `famous_author`. Listen for `app.beforeInit` signal.
ru: Иногда вам может потребоваться запросить другой набор объектов для FkField. Например, чтобы выбрать только известных авторов, создайте конечную точку `famous_author` на бэкенде и установите путь запроса FkField в `famous_author`. Слушайте сигнал `app.beforeInit`.

source: Now when we create new post on `/post/` endpoint Author FkField makes get request to `/famous_author/` instead of `/author/`. It's useful to get different set of authors (that may have been previously filtered on backend).
ru: Теперь, когда мы создаем новый пост на конечной точке `/post/`, Author FkField выполняет GET-запрос к `/famous_author/` вместо `/author/`. Это полезно для получения другого набора авторов (которые могли быть ранее отфильтрованы на бэкенде).

source: CSS Styling
ru: Стилизация CSS

source: Like scripts, css files may be added to SPA_STATIC in setting.py
ru: Как и скрипты, файлы CSS можно добавить в SPA_STATIC в setting.py

source: Let's inspect page and find css class for our customField. It is `column-format-customField` and generated with `column-format-{Field.format}` pattern.
ru: Давайте проанализируем страницу и найдем класс CSS для нашего пользовательского поля. Это `column-format-customField` и создается с использованием шаблона `column-format-{Field.format}`.

source: Use regular css styling to change appearance of the field.
ru: Используйте обычные стили CSS для изменения внешнего вида поля.

source: Other page elements are also available for styling: for example, to hide certain column set corresponding field to none.
ru: Другие элементы страницы также доступны для стилизации: например, чтобы скрыть определенный столбец, установите соответствующее поле в значение none.

source: Show primary key column on list
ru: Показать столбец первичных ключей в списке

source: Every pk column has `pk-column` CSS class and hidden by default (using `display: none;`).
ru: Каждый столбец первичного ключа имеет класс CSS `pk-column` и по умолчанию скрыт (с использованием `display: none;`).

source: For example this style will show pk column on all list views of `Order` model:
ru: Например, этот стиль покажет столбец первичных ключей во всех представлениях списка модели `Order`.

source: View customization
ru: Настройка представления

source: Listen for signal `"allViews.created"` and add new custom mixin to the view.
ru: Слушайте сигнал `"allViews.created"` и добавьте новый пользовательский миксин в представление.

source: Next code snippet depicts rendering new view instead of default view.
ru: В следующем фрагменте кода показано отображение нового представления вместо представления по умолчанию.

source: Learn more about Vue `render()` function at `Vue documentation <https://v3.vuejs.org/guide/render-function.html>`_.
ru: Узнайте больше о функции `render()` Vue в `документации Vue <https://v3.vuejs.org/guide/render-function.html>`_.

source: It is also possible to fine tune View by overriding default computed properties and methods of existing mixins. For example, override breadcrumbs computed property to turn off breadcrumbs on Author list View
ru: Также можно настроить представление, переопределив вычисляемые свойства и методы по умолчанию существующих миксинов. Например, переопределите вычисляемое свойство `breadcrumbs` для отключения хлебных крошек в представлении списка авторов.

source: Sometimes you may need to hide detail page for some reason, but still want all actions and sublinks to be accessible from list page. To do it you also should listen signal `"allViews.created"` and change parameter `hidden` from default `false` to `true`, for example:
ru: Иногда вам может потребоваться скрыть страницу с деталями по какой-то причине, но при этом сохранить доступ ко всем действиям и подссылкам с страницы списка. Чтобы сделать это, также следует слушать сигнал `"allViews.created"` и изменить параметр `hidden` с значения `false` по умолчанию на `true`, например:

source: Changing title of the view
ru: Изменение заголовка представления

source: To change title and string displayed in the breadcrumbs change `title` property of the view or method `getTitle` for more complex logic.
ru: Чтобы изменить заголовок и строку, отображаемую в хлебных крошках, измените свойство `title` представления или метод `getTitle` для более сложной логики.

source: Basic Webpack configuration
ru: Базовая конфигурация Webpack

source: To use webpack in you project rename `webpack.config.js.default` to `webpack.config.js`. Every project based on vst-utils contains `index.js` in `/frontend_src/app/` directory. This file is intended for your code. Run `yarn` command to install all dependencies. Then run `yarn devBuild` from root dir of your project to build static files. Final step is to add built file to `SPA_STATIC` in `settings.py`
ru: Чтобы использовать webpack в вашем проекте, переименуйте `webpack.config.js.default` в `webpack.config.js`. Каждый проект, основанный на vst-utils, содержит `index.js` в каталоге `/frontend_src/app/`. Этот файл предназначен для вашего кода. Запустите команду `yarn` для установки всех зависимостей. Затем выполните `yarn devBuild` из корневого каталога вашего проекта для сборки статических файлов. Последним шагом является добавление собранного файла в `SPA_STATIC` в `settings.py`.

source: Webpack configuration file allows to add more static files. In `webpack.config.js` add more entries
ru: Файл конфигурации Webpack позволяет добавлять дополнительные статические файлы. В `webpack.config.js` добавьте дополнительные записи

source: Output files will be built into `frontend_src/{AppName}/static/{AppName}/bundle` directory. Name of output file corresponds to name of entry in `config`. In the example above output files will have names `app.js` and `myapp.js`. Add all of these files to `STATIC_SPA` in `settings.py`. During vstutils installation trough `pip` frontend code are being build automatically, so you may need to add `bundle` directory to `gitignore`.
ru: Выходные файлы будут собраны в каталоге `frontend_src/{AppName}/static/{AppName}/bundle`. Имя выходного файла соответствует имени записи в `config`. В приведенном выше примере выходные файлы будут называться `app.js` и `myapp.js`. Добавьте все эти файлы в `STATIC_SPA` в `settings.py`. Во время установки vstutils через `pip` фронтенд-код собирается автоматически, поэтому вам может потребоваться добавить каталог `bundle` в `gitignore`.

source: Page store
ru: Хранилище страницы

source: Every page has store that can be accessed globally `app.store.page` or from page component using `this.store`.
ru: У каждой страницы есть хранилище, которое можно получить глобально `app.store.page` или из компонента страницы с использованием `this.store`.

source: View method `extendStore` can be used to add custom logic to page's store.
ru: Метод представления `extendStore` можно использовать для добавления пользовательской логики в хранилище страницы.

source: Overriding root component
ru: Переопределение корневого компонента

source: Root component of the application can be overridden using `app.beforeInit` signal. This can be useful for such things as changing layout CSS classes, back button behaviour or main layout components.
ru: Корневой компонент приложения можно переопределить с использованием сигнала `app.beforeInit`. Это может быть полезно, например, для изменения классов CSS макета, поведения кнопки назад или основных компонентов макета.

source: Example of customizing sidebar component:
ru: Пример настройки компонента боковой панели:

source: Translating values of fields
ru: Перевод значений полей

source: Values tha displayed by `FKField` of `ChoicesField` can be translated using standard translations files.
ru: Значения, отображаемые с использованием `FKField` или `ChoicesField`, могут быть переведены с использованием стандартных файлов перевода.

source: Translation key must be defined as `:model:<ModelName>:<fieldName>:<value>`. For example:
ru: Ключ перевода должен быть определен как `:model:<ModelName>:<fieldName>:<value>`. Например:

source: Translation of values can be taxing as every model on backend usually generates more than one model on frontend, To avoid this, add `_translate_model = 'Category'` attribute to model on backend. It shortens
ru: Перевод значений может быть трудоемким, поскольку каждая модель на бэкенде обычно генерирует более одной модели на фронтенде. Для избежания этого добавьте атрибут `_translate_model = 'Category'` к модели на бэкенде. Это сокращает

source: to
ru: в

source: For `FKField` name of the related model is used. And `fieldName` should be equal to `viewField`.
ru: Для `FKField` используется имя связанной модели. И `fieldName` должно быть равно `viewField`.

source: Changing actions or sublinks
ru: Изменение действий или подссылок

source: Sometimes using only schema for defining actions or sublinks is not enough.
ru: Иногда использование только схемы для определения действий или подссылок недостаточно.

source: For example we have an action to make user a superuser (`/user/{id}/make_superuser/`) and we want to hide that action if user is already a superuser (`is_superuser` is `true`). `<${PATH}>filterActions` signal can be used to achieve such result.
ru: Например, у нас есть действие, которое делает пользователя суперпользователем (`/user/{id}/make_superuser/`), и мы хотим скрыть это действие, если пользователь уже является суперпользователем (`is_superuser` равно `true`). Сигнал `<${PATH}>filterActions` может быть использован для достижения такого результата.

source: `<${PATH}>filterActions` recieves {actions, data}
ru: `<${PATH}>filterActions` получает {actions, data}

source: `<${PATH}>filterSublinks` recieves {sublinks, data}
ru: `<${PATH}>filterSublinks` получает {sublinks, data}

source: Data property will contain instance's data. Actions and sublinks properties will contain arrays with default items (not hidden action or sublinks), it can be changed or replaced completely.
ru: Свойство `data` будет содержать данные экземпляра. Свойства `actions` и `sublinks` будут содержать массивы с элементами по умолчанию (не скрытыми действиями или подссылками), их можно изменить или полностью заменить.

source: LocalSettings
ru: Локальные настройки

source: This model's fields are displayed in the left sidebar. All data from this model saves in browser Local Storage. If you want to add another options, you can do it using `beforeInit` signal, for example:
ru: Поля этой модели отображаются в левой боковой панели. Все данные из этой модели сохраняются в локальном хранилище браузера. Если вы хотите добавить другие варианты, вы можете сделать это, используя сигнал `beforeInit`, например:

source: Store
ru: Хранилище

source: There are three ways to store data:
ru: Есть три способа сохранения данных:

source: userSettingsStore - saves data on the server. By default, there are options for changing language and a button to turn on/off the dark mode. Data to userSettingsStore comes from schema.
ru: userSettingsStore - сохраняет данные на сервере. По умолчанию есть варианты изменения языка и кнопка включения/выключения темного режима. Данные для userSettingsStore поступают из схемы.

source: localSettingsStore - saves data in the browser Local Storage. This is where you can store your own fields, as described in :ref:`localSettings`.
ru: localSettingsStore - сохраняет данные в локальном хранилище браузера. Здесь вы можете хранить свои собственные поля, как описано в :ref:`localSettings`.

source: store - stores current page data.
ru: store - хранит данные текущей страницы.

source: To use any of this stores you need to run the following command: :code:`app.[storeName]`, for example: :code:`app.userSettingsStore`.
ru: Чтобы использовать любое из этих хранилищ, вам нужно выполнить следующую команду: :code:`app.[storeName]`, например: :code:`app.userSettingsStore`.

source: If you are accessing the userSettingsStore from within the component then you need to use :code:`this.$app` instead :code:`app`.
ru: Если вы обращаетесь к userSettingsStore изнутри компонента, тогда вам нужно использовать :code:`this.$app` вместо :code:`app`.

source: From `app.store` you may need:
ru: Из `app.store` вам может потребоваться:

source: `vewsItems` and `viewItemsMap` - stores information about parent views for this page. It is used for example in breadcrumbs. The difference between them is only in the way information is stored: `viewItems` is an Array of Objects and `viewItemsMap` is a Map.
ru: `vewsItems` и `viewItemsMap` - хранят информацию о родительских представлениях для этой страницы. Они используются, например, в хлебных крошках. Различие между ними заключается только в способе хранения информации: `viewItems` - это массив объектов, а `viewItemsMap` - это карта.

source: `page` - saves all information about current page.
ru: `page` - сохраняет всю информацию о текущей странице.

source: `title` - title of current page.
ru: `title` - заголовок текущей страницы.
