Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/quickstart.po
Languages: ru

source: ``_detail_operations_availability_field_name`` - name of field which indicates availability of operations, field value can be dict where key is operation name and value is boolean flag or simply list of available operations.
ru: ``_detail_operations_availability_field_name`` - имя поля, которое указывает доступность операции, значение может быть словарем, где ключ это имя операции, а значение - логическое значение или просто список доступных операций.

source: In common, you can also add custom attributes to override or extend the default list of processing classes. Supported view attributes are ``filter_backends``, ``permission_classes``, ``authentication_classes``, ``throttle_classes``, ``renderer_classes`` and ``parser_classes``. List of meta-attributes for settings of view is looks like:
ru: Также вы также можете добавлять пользовательские атрибуты для переопределения или расширения списка обрабатываемых классов по умолчанию. Поддерживаемые атрибуты view: ``filter_backends``, ``permission_classes``, ``authentication_classes``, ``throttle_classes``, ``renderer_classes`` и ``parser_classes``. Список мета-атрибутов для настроек view выглядит следующим образом:

source: ``_pre_{attribute}`` - List of classes included before defaults.
ru: ``_pre_{attribute}`` - список классов, включаемых перед значениями по умолчанию.

source: ``_{attribute}`` - List of classes included after defaults.
ru: ``_{attribute}`` - список классов, включаемых после значений по умолчанию.

source: ``_override_{attribute}`` - boolean flag indicates that attribute override default viewset (otherwise appends). Default is ``False``.
ru: ``_override_{attribute}`` - флаг-булево значение, указывающее, переопределяет ли атрибут view по умолчанию (в противном случае добавляется). По умолчанию False.

source: You may need to create an `action <https://www.django-rest-framework.org/api-guide/viewsets/#marking-extra-actions-for-routing>`_ on generated view. Use :class:`vstutils.models.decorators.register_view_action` decorator with the ``detail`` argument to determine applicability to a list or detail entry. In this case, the decorated method will take an instance of the view object as ``self`` attribute.
ru: Возможно, вам понадобится создать `action <https://www.django-rest-framework.org/api-guide/viewsets/#marking-extra-actions-for-routing>`_ в сгенерированном view. Используйте декоратор :class:`vstutils.models.decorators.register_view_action` с аргументом ``detail``, чтобы определить применимость к списку или детальной записи. В этом случае декорированный метод будет принимать объект view в качестве атрибута ``self``.

source: In some cases, inheriting models may require to inherit Meta class from the base model. If the Meta is explicitly declared in the base class, then you can get it through the attribute `OriginalMeta` and use it for inheritance.
ru: В некоторых случаях при наследовании моделей может потребоваться наследовать класс Meta от базовой модели. Если Meta явно объявлена в базовом классе, вы можете получить ее через атрибут `OriginalMeta` и использовать для наследования.

source: Docstring of model will be reused for view descriptions. It is possible to write both a general description for all actions and description for each action using the following syntax:
ru: Docstring модели будет использоваться для описания view. Можно написать как общее описание для всех действий, так и описание для каждого действия, используя следующий синтаксис:

source: The ``get_view_class()`` method is a utility method in the Django ORM model designed to facilitate the configuration and instantiation of Django Rest Framework (DRF) Generic ViewSets. It allows developers to define and customize various aspects of the associated DRF view class. The arguments passed to the function fully correspond to those specified earlier for the ``Meta`` class of the model, but without the underscore prefix.
ru: Метод ``get_view_class()`` — это служебный метод в ORM Django моделях, предназначенный для облегчения настройки и создания экземпляров представлений Django Rest Framework (DRF). Это позволяет разработчикам определить и настроить различные аспекты класса представления DRF.Аргументы, переданные в функцию, полностью соответствуют тем, которые были указаны ранее для класса ``Meta`` модели, но без префикса подчёркивания.

source: Developers can use this method to customize various aspects of the associated view, such as serializer classes, field configurations, filter backends, permission classes, etc. It uses attributes declared in meta attributes, but allows individual parts to be overriden.
ru: Разработчики могут использовать этот метод для изменения различных аспектов получаемого представления, таких как классы сериализаторов, конфигурацию полей, фильтры,классы разрешений и т.п. Этот метод использует такие же атрибуты, которые были объявлены в мета-атрибутах, но позволяет перегружать отдельные части.

source: An important aspect that distinguishes ``get_view_class()`` is the ``ignore_meta`` argument. It takes ``True`` when it's necessary to completely ignore the values set in the model's ``Meta`` class. This allows ``get_view_class()`` to generate a fully independent view.
ru: Важным аспектом, который отличает ``get_view_class()``, является аргумент ``ignore_meta``. Он принимает значение ``True``, когда необходимо полностью игнорировать значения, установленные в классе ``Meta`` модели. Это позволяет ``get_view_class()`` создать полностью независимое представление.

source: More information about Models you can find in `Django Models documentation <https://docs.djangoproject.com/en/4.1/topics/db/models/>`_.
ru: Более подробную информацию о моделях вы можете найти в документации `Django Models <https://docs.djangoproject.com/en/3.2/topics/db/models/>`_.

source: If you don't need to create custom :ref:`serializers<SerializerCreateTag>` or :ref:`view sets<ViewSetCreateTag>`, you can go to this :ref:`stage<AddModelsToApiTag>`.
ru: Если вам не нужно создавать пользовательские :ref:`сериализаторы<SerializerCreateTag>` или :ref:`view sets<ViewSetCreateTag>`, вы можете перейти к этому :ref:`этапу<AddModelsToApiTag>`.

source: Serializers creation
ru: Создание сериализаторов

source: *Note - If you don't need custom serializer you can skip this section*
ru: *Примечание - Если вам не нужен пользовательский сериализатор, вы можете пропустить этот раздел.*

source: Firstly, you need to create file ``serializers.py`` in the ``/{{app_dir}}/{{app_name}}/{{app_name}}/`` directory.
ru: В первую очередь вам необходимо создать файл ``serializers.py`` в директории ``/{{app_dir}}/{{app_name}}/{{app_name}}/``.

source: Then you need to add some code like this to ``serializers.py``:
ru: Затем вам нужно добавить некоторый код, подобный следующему, в файл ``serializers.py``:

source: More information about Serializers you can find in `Django REST Framework documentation for Serializers <https://www.django-rest-framework.org/api-guide/serializers/#modelserializer>`_.
ru: Более подробную информацию о сериализаторах вы можете найти в документации `Django REST Framework по сериализаторам <https://www.django-rest-framework.org/api-guide/serializers/#modelserializer>`_.

source: Views creation
ru: Создание views

source: *Note - If you don't need custom view set you can skip this section*
ru: *Примечание - Если вам не нужен пользовательский view set, вы можете пропустить этот раздел.*

source: Firstly, you need to create file ``views.py`` in the ``/{{app_dir}}/{{app_name}}/{{app_name}}/`` directory.
ru: В первую очередь вам необходимо создать файл ``views.py`` в директории ``/{{app_dir}}/{{app_name}}/{{app_name}}/``.

source: Then you need to add some code like this to ``views.py``:
ru: Затем вам нужно добавить некоторый код, подобный следующему, в файл ``views.py``:

source: More information about Views and ViewSets you can find in `Django REST Framework documentation for views <https://www.django-rest-framework.org/api-guide/viewsets/>`_.
ru: Больше информации о view и viewset вы можете найти в `документации Django REST Framework для view <https://www.django-rest-framework.org/api-guide/viewsets/>`_.

source: Adding Models to API
ru: Добавление моделей в API

source: To add created Models to the API you need to write something like this at the end of your ``settings.py`` file:
ru: Для добавления моделей в APi вам нужно написать код, подобный этому в в конце файла ``settings.py``:

source: Migrations creation
ru: Создание миграций

source: To make migrations open ``/{{app_dir}}/{{app_name}}/`` directory and execute following command:
ru: Для создания миграций откройте директорию ``/{{app_dir}}/{{app_name}}/`` и выполните следующую команду:

source: More information about Migrations you can find in `Django Migrations documentation <https://docs.djangoproject.com/en/4.1/topics/migrations/>`_.
ru: Более подробную информацию о миграциях вы можете найти в `документации Django Migrations <https://docs.djangoproject.com/en/3.2/topics/migrations/>`_.

source: Migrations applying
ru: Применение миграций

source: To apply migrations you need to open ``/{{app_dir}}/{{app_name}}/`` directory and execute following command:
ru: Для применения миграций вам необходимо открыть директорию ``/{{app_dir}}/{{app_name}}/`` и выполнить следующую команду:

source: Restart of Application
ru: Перезапуск приложения

source: To restart your application, firstly, you need to stop it (if it was started before):
ru: Для перезапуска вашего приложения вам сначала нужно остановить его (если оно было запущено ранее):

source: And then start it again:
ru: Затем запустите его снова:

source: After cache reloading you will see following page:
ru: После перезагрузки кэша вы увидите следующую страницу:

source: As you can see, link to new Task View has been added to the sidebar menu. Let's click on it.
ru: Как вы можете видеть, ссылка на новое Task view добавлена в боковое меню. Давайте нажмем на нее.

source: There is no task instance in your app. Add it using 'new' button.
ru: В вашем приложении нет экземпляра задачи. Добавьте его, используя кнопку 'new'.

source: After creating a new task you'll see a following page:
ru: После создания новой задачи вы увидите следующую страницу:

source: As you can see, there is 'stages' button, that opens page with this task's stages list. Let's click on it.
ru: Как видите, есть кнопка 'stages', которая открывает страницу со списком этапов этой задачи. Давайте на нее нажмем.

source: There is no stage instances in your app. Let's create 2 new stages.
ru: В вашем приложении нет экземпляров этапов. Давайте создадим 2 новых этапа.

source: After stages creation page with stages list will looks like this:
ru: После создания этапов страница со списком этапов будет выглядеть так:

source: Sorting by 'order' field works, as we mentioned in the our ``models.py`` file for Stage Model.
ru: Сортировка по полю `order` работает, как мы указали в нашем файле ``models.py`` для модели Stage.

source: Additional information about Django and Django REST Framework you can find in `Django documentation <https://docs.djangoproject.com/en/4.1/>`_ and `Django REST Framework documentation <https://www.django-rest-framework.org/>`_.
ru: Дополнительную информацию о Django и Django REST Framework вы можете найти в `документации Django <https://docs.djangoproject.com/en/3.2/>`_ и `документации Django REST Framework <https://www.django-rest-framework.org/>`_.
