Repository: vstconsulting/vstutils
Catalog: doc/locale/*/LC_MESSAGES/quickstart.po
Languages: ru

source: Quick Start
ru: Быстрый старт

source: Starting of new project, based on VST Utils Framework, is rather simple. We recommend to create a virtual environment for each project to avoid conflicts in the system.
ru: Создать новый проект, основанный на фреймворке VST Utils, довольно просто. Мы рекомендуем создавать виртуальное окружение отдельно для каждого из ваших проектов, чтобы избежать конфликтов в системе.

source: Let’s learn by example. All you need to do is run several commands. This manual consist of two parts:
ru: Давайте учиться на примерах. Все что вам нужно сделать это запустить несколько команд. Этот мануал состоит из двух частей:

source: Description of the process of creating a new application and the main commands for launching and deploying.
ru: Описание процесса создания нового приложения и основных команд для запуска и развертывания.

source: Description of the process of creating new entities in the application.
ru: Описание процесса создания новых сущностей в приложении.

source: New application creation
ru: Создание нового приложения

source: Throughout this tutorial, we’ll go through a creation of a basic poll application.
ru: В этом руководстве мы создадим базовое приложение.

source: **Install VST Utils**
ru: **Установка VST Utils**

source: In this case, we install a package with the minimum required set of dependencies for creating new projects. However, inside the project, the extra argument `prod` is used, which additionally installs the packages necessary for working in the production environment. There is also a set of test dependencies, which contains everything you need for testing and analyzing code coverage.
ru: В данном случае мы устанавливаем пакет с минимальным набором зависимостей для создания новых проектов. Однако, внутри проекта используется специальный аргумент `prod` который дополнительно устанавливает все пакеты, необходимые для работы в окружении для развертывания. Также имеется набор зависимостей для тестирования, в котором содержится все, что нужно для тестирования и анализа покрытия кода.

source: It is also worth noting extra dependencies as:
ru: Также стоит отметить дополнительно зависимости, такие как:

source: **rpc** - install dependencies for asynchronous tasks working
ru: **rpc** - установка зависимостей для выполнения асинхронных задач

source: **ldap** - a set of dependencies for ldap authorization support
ru: **ldap** - набор зависимостей для поддержки авторизации ldap

source: **doc** - everything which needed to build documentation and to implement the delivery of documentation inside a running server
ru: **doc** - все, что нужно для построения документации и осуществления доставки документации на запущенный сервер

source: **pil** - library for correct work of image validators
ru: **pil** - библиотека для корректной работы валидации изображений

source: **boto3** - an additional set of packages for working with S3 storage outside of AWS
ru: **boto3** - дополнительный набор зависимостей для работы с S3 хранилищем вне AWS

source: **sqs** - a set of dependencies for connecting asynchronous tasks to SQS queues (can be used instead of the **rpc**).
ru: **sqs** - набор зависимостей для соединения асинхронных задач с SQS очередями (может использоваться вместо **rpc**).

source: You can combine multiple dependencies at the same time to assemble your set of functionality into a project. For example, to work an application with asynchronous tasks and media storage in MinIO, you will need the following command:
ru: Вы можете комбинировать разные зависимости одновременно, чтобы собрать ваш функциональный набор в проекте. Например, для работы приложения с асинхронными задачами и медиахранилищем в MinIO вам потребуется следующая команда:

source: To install the most complete set of dependencies, you can use the common parameter **all**.
ru: Чтобы установить наиболее полный набор зависимостей, вы можете использовать обычный параметр **all**.

source: **Create new project, based on VST Utils**
ru: **Создание нового проекта, основанного на VST Utils**

source: If this is your first time using vstutils, you’ll have to take care of some initial setup. Namely, you’ll need to auto-generate some code that establishes a vstutils application – a collection of settings for an instance of vstutils, including database configuration, Django-specific and vstutils-specific options and application-specific settings. To create new project execute following command:
ru: Если вы впервые используете vstutils, вам нужно позаботиться о начальной настройке. А именно: вам необходимо будет автоматически сгенерировать код, создающий приложение vstutils, включая конфигурацию базы данных, специфичные опции для Django и vstutils, а также настройки, специфичные для приложения. Для создания нового проекта выполните следующую команду:

source: This command will offer you to specify such options of new app, as:
ru: Эта команда предложит указать такие параметры нового приложения, как:

source: **project name** - name of your new application;
ru: **project name** - имя вашего нового приложения;

source: **project guiname** - name of your new application, that will be used in GUI (web-interface);
ru: **project guiname** - имя вашего нового приложения, которое будет использоваться в GUI(веб-интерфейсе);

source: **project directory** - path to directory, where project will be created.
ru: **project directory** - путь к директории, в которой будет создан проект.

source: Or you can execute following command, that includes all needed data for new project creation.
ru: Или вы можете выполнить следующую команду, которая содержит всю необходимую информацию для создания нового проекта.

source: This command creates new project without confirming any data.
ru: Эта команда создает новый проект без подтверждения какой-либо информации.

source: These commands create several files in ``project directory``.
ru: Эти команды создают несколько файлов в ``project directory``:

source: where:
ru: где

source: **frontend_src** - directory that contains all sources for frontend;
ru: **frontend_src** - директория, содержащая все исходные файлы для фронтенда;

source: **MANIFEST.in** - this file is used for building installation package;
ru: **MANIFEST.in** - этот файл используется для создания установочного пакета;

source: **{{app_name}}** - directory with files of your application;
ru: **{{app_name}}** - директория с файлами вашего приложения;

source: **package.json** - this file contains list of frontend dependencies and commands to build;
ru: **package.json** - этот файл содержит список зависимостей фронтенда и команд для сборки;

source: **README.rst** - default README file for your application (this file includes base commands for starting/stopping your application);
ru: **README.rst** - стандартный README файл для вашего приложения (этот файл включает базовые команды для запуска/остановки вашего приложения);

source: **requirements-test.txt** - file with list of requirements for test environment;
ru: **requirements-test.txt** - файл со списком зависимостей для тестирования вашего окружения;

source: **requirements.txt** - file with list of requirements for your application;
ru: **requirements.txt** - файл со списком зависимостей вашего приложения;

source: **pyproject.toml** - this file is used for building installation package;
ru: **pyproject.toml** - файл, используемый для сборки установочного пакета;

source: **setup.py** - this file is used for building installation package;
ru: **setup.py** - файл, используемый для сборки установочного пакета;

source: **test.py** - this file is used for tests creation;
ru: **test.py** - этот файл используется для создания тестов;

source: **tox.ini** - this file is used for tests execution;
ru: **tox.ini** - этот файл используется для выполнения тестов;

source: **webpack.config.js.default** - this file contain minimal script for webpack (replace '.default' if write smthg in 'app.js').
ru: **webpack.config.js.default** - этот файл содержит минимальный скрипт для webpack (замените '.default', если пишите что-то в 'app.js').

source: You should execute below commands from the ``/{{app_dir}}/{{app_name}}/`` directory. It is good practice to use tox (should be installed before use) to create a debugging environment for your application. For these purposes, it is recommended to use ``tox -e contrib`` in the project directory, which will automatically create a new environment with the required dependencies.
ru: Вам нужно выполнять приведенные ниже команды из директории ``/{{app_dir}}/{{app_name}}/``. Хорошей практикой будет использование tox (должен быть установлен перед использованием) для создания отладочной среды для вашего приложения. Для этих целей рекомендуется использовать ``tox -e contrib`` в директории проекта, что автоматически создаст новое окружение с необходимыми зависимостями.

source: **Apply migrations**
ru: **Применение миграций**

source: Let’s verify a newly created vstutils project does work. Change into the outer ``/{{app_dir}}/{{app_name}}`` directory, if you haven’t already, and run the following command:
ru: Давайте проверим, работает ли новый проект vstutils. Перейдите во внешний каталог ``/{{app_dir}}/{{app_name}}``, если вы еще этого не сделали, и выполните следующую команду:

source: This command create SQLite (by default) database with default SQL-schema. VSTUTILS supports all databases `Django does <https://docs.djangoproject.com/en/4.1/ref/databases/#databases>`_.
ru: Эта команда создаст базу данных SQLite (по умолчанию) с SQL схемой по умолчанию. VSTUTILS поддерживает все базы данных которые поддерживает `Django. <https://docs.djangoproject.com/en/4.1/ref/databases/#databases>`_

source: **Create superuser**
ru: **Создание суперпользователя**

source: **Start your application**
ru: **Запуск приложения**

source: Web-interface of your application has been started on the port 8080. You’ve started the vstutils production server based on `uWSGI <https://uwsgi-docs.readthedocs.io/>`_.
ru: Веб-интерфейс вашего приложения будет запущен на порту 8080. Вы запустили сервер vstutils для продакшена на основе `uWSGI <https://uwsgi-docs.readthedocs.io/>`_.

source: Now’s a good time to note: if you want to run the web-server with a debugger, then you should run `the standard Django's dev-server <https://docs.djangoproject.com/en/4.1/intro/tutorial01/#the-development-server>`_.
ru: Сейчас хорошее время отметить: если вы хотите запустить веб-сервер с отладчиком, то вам следует запустить стандартный сервер разработки Django <https://docs.djangoproject.com/en/3.2/intro/tutorial01/#the-development-server>`_

source: If you need to stop the server, use following command:
ru: Если вам нужно остановить сервер, используйте следующую команду:

source: You've created the simplest application, based on VST Utils framework. This application only contains User Model. If you want to create your own models look at the section below.
ru: Вы создали простейшее приложение, основанное на фреймворке VST Utils. Это приложение содержит только модель пользователя. Если вы хотите создать свои собственные модели, обратитесь к разделу ниже.

source: Adding new models to application
ru: Добавление новых моделей в приложение

source: If you want to add some new entities to your application, you need to do following on the back-end:
ru: Если вы хотите добавить новые сущности в ваше приложение, вам необходимо выполнить следующие действия на серверной стороне:

source: Create Model;
ru: Создайте модель;

source: Create Serializer (optional);
ru: Создайте сериализатор (опционально);

source: Create View (optional);
ru: Создайте view (опционально);

source: Add created Model or View to the API;
ru: Добавьте созданную модель или view в API;

source: Make migrations;
ru: Создайте миграции;

source: Apply migrations;
ru: Примените миграции;

source: Restart your application.
ru: Перезапустите ваше приложение.

source: Let's look how you can do it on the AppExample - application, that has 2 custom models:
ru: Давайте посмотрим, как это можно сделать на примере приложения AppExample которое содержит 2 пользовательские модели:

source: Task (abstraction for some tasks/activities, that user should do);
ru: Task (абстракция для некоторых задач/активностей, которые пользователь должен выполнить);

source: Stage (abstraction for some stages, that user should do to complete the task. This model is nested into the Task Model).
ru: Stage (абстракция для некоторых этапов, которые пользователь должен пройти для выполнения задачи. Эта модель вложена в модель Task).

source: Models creation
ru: Создание моделей

source: Firstly, you need to create file ``{{model_name}}.py`` in the ``/{{app_dir}}/{{app_name}}/{{app_name}}/models`` directory.
ru: Сначала вам необходимо создать файл ``{{model_name}}.py`` в директории ``/{{app_dir}}/{{app_name}}/{{app_name}}/models``.

source: Let make out an example from **BModel**:
ru: Давайте рассмотрим пример с моделью **BModel**:

source: Default model class that generates model viewset, separate serializers for list() and retrieve(), filters, api endpoints and nested views.
ru: Класс модели по умолчанию, который генерирует viewset, отдельные сериализаторы для list() и retrieve(), фильтры, эндпоинты API и вложенные view

source: Examples:
ru: Примеры:

source: In this case, you create models which could converted to simple view, where:
ru: В данном случае вы создаете модели, которые могут быть преобразованы в простое view, где:

source: ``POST``/``GET`` to ``/api/version/task/`` - creates new or get list of tasks
ru: ``POST``/``GET`` по адресу ``/api/version/task/`` - создает новую задачу или получает список задач

source: ``PUT``/``PATCH``/``GET``/``DELETE`` to ``/api/version/task/:id/`` - updates, retrieves or removes instance of task
ru: ``PUT``/``PATCH``/``GET``/``DELETE`` по адресу ``/api/version/task/:id/`` - обновляет, извлекает или удаляет экземпляр задачи

source: ``POST``/``GET`` to ``/api/version/task/:id/stage/`` - creates new or get list of stages in task
ru: ``POST``/``GET`` по адресу ``/api/version/task/:id/stage/`` - создает новую или получает список стадий в задаче

source: ``PUT``/``PATCH``/``GET``/``DELETE`` to ``/api/version/task/:id/stage/:stage_id`` - updates, retrieves or removes instance of stage in task.
ru: ``PUT``/``PATCH``/``GET``/``DELETE`` по адресу ``/api/version/task/:id/stage/:stage_id`` - обновляет, извлекает или удаляет экземпляр стадии в задаче.

source: To attach a view to an API insert the following code in `settings.py`:
ru: Для привязки view к API вставьте следующий код в файл `settings.py`:

source: For primary access to generated view inherit from `Task.generated_view` property.
ru: Для основного доступа к сгенерированному view унаследуйтесь от свойства `Task.generated_view`.

source: To make translation on frontend easier use ``_translate_model`` attribute with model_name.
ru: Чтобы упростить перевод на фронтенде используйте атрибут ``_translate_model`` с model_name

source: List of meta-attributes for generating a view:
ru: Список мета-атрибутов для создания view:

source: ``_view_class`` - list of additional view classes to inherit from, class or string to import with base class ViewSet. Constants are also supported:
ru: ``_view_class`` - список дополнительных классов view для наследования, класс или строка для импорта с базовым классом viewSet. Также поддерживаются константы:

source: ``read_only`` - to create a view only for viewing;
ru: ``read_only`` - для создания view только для просмотра;

source: ``list_only`` - to create a view with list only;
ru: ``list_only`` - для создания view только со списком;

source: ``history`` - to create a view only for viewing and deleting records.
ru: ``history`` - для создания view только для просмотра и удаления записей

source: CRUD-view is applied by default.
ru: CRUD-view применяется по умолчанию.

source: ``_serializer_class`` - class of API serializer; use this attribute to specify parent class for autogenerated serializers. Default is :class:`vstutils.api.serializers.VSTSerializer`. Can take a string to import, serializer class or :class:`django.utils.functional.SimpleLazyObject`.
ru: ``_serializer_class`` - класс сериализатора API; используйте этот атрибут, чтобы указать родительский класс для автоматически создаваемых сериализаторов. По умолчанию используется :class:`vstutils.api.serializers.VSTSerializer`. Может принимать строку для импорта, класс сериализатора или :class:`django.utils.functional.SimpleLazyObject`.

source: ``_serializer_class_name`` - model name for OpenAPI definitions.This would be a model name in generated admin interface. Default is name of model class.
ru: ``_serializer_class_name`` - имя модели для определений OpenAPI. Это будет имя модели в сгенерированном интерфейсе администратора. По умолчанию используется имя класса модели.

source: ``_list_fields`` or ``_detail_fields`` - list of fields which will be listed in entity list or detail view accordingly. Same as DRF serializers meta-attribute "fields".
ru: ``_list_fields`` или ``_detail_fields`` - список полей, которые будут перечислены списке сущностей или детальном view соответственно. То же самое, что и мета-атрибут "fields" сериализаторов DRF.

source: ``_override_list_fields`` or ``_override_detail_fields`` - mapping with names and field types that will be redeclared in serializer attributes(think of it as declaring fields in DRF ModelSerializer). Keep in mind that the fields specified here do not necessarily end up in the serializer class, but only if they are included in the corresponding lists.
ru: ``_override_list_fields`` или ``_override_detail_fields`` — отображение с именами и типами полей, которые будут переопределены в атрибутах сериализатора (считайте это как объявление полей в DRF ModelSerializer). Имейте в виду, что указанные здесь поля не обязательно окажутся в классе сериализатора, а только если они включены в соответствующие списки.

source: ``_properties_groups`` - dict with key as group name and value as list of fields(str). Allows to group fields in sections on frontend.
ru: ``_properties_groups`` - словарь с ключом в виде имени группы и значением в виде списка полей (строк). Позволяет группировать поля в разделы на фронтенде.

source: ``_view_field_name`` - name of field frontend shows as main view name.
ru: ``_view_field_name`` - имя поля, которое фронтенд показывает в качестве основного имени view.

source: ``_non_bulk_methods`` - list of methods which must not used via bulk requests.
ru: ``_non_bulk_methods`` - список методов, которые не должны использоваться через пакетные запросы.

source: ``_extra_serializer_classes`` - mapping with additional serializers in viewset. For example, custom serializer, which will compute smth in action (mapping name). Value can be string for import. Important note: setting `model` attribute to None allows to use standard serializer generation mechanism and get fields from a list or detail serializer (set `__inject_from__` serializer's meta attribute to `list` or `detail` accordingly). In some cases, it is required to pass the model to the serializer. For these purposes, the constant `LAZY_MODEL` can be used as a meta attribute. Each time the serializer is used, the exact model where this serializer was declared will be set.
ru: ``_extra_serializer_classes`` - отображение с дополнительными сериализаторами в viewset. Например, пользовательский сериализатор, который будет вычислять что-то в действии (имя отображения). Значение может быть строкой для импорта. Важное замечание: установка атрибута модели в None позволяет использовать стандартный механизм создания сериализатора и получать поля из сериализатора списка или детальной записи (установите `__inject_from__` мета-атрибут сериализатора в `list` или `detail` соответственно). В некоторых случаях требуется передать модель в сериализатор. Для этого можно использовать константу `LAZY_MODEL` в качестве мета-атрибута. Каждый раз при использовании сериализатора будет установлена точная модель, в которой был объявлен этот сериализатор.

source: ``_filterset_fields`` - list/dict of filterset names for API-filtering. Default is list of fields in list view. During processing a list of fields checks for the presence of special field names and inherit additional parent classes. If the list contains ``id``, class will inherit from :class:`vstutils.api.filters.DefaultIDFilter`. If the list contains ``name``, class will inherit from :class:`vstutils.api.filters.DefaultNameFilter`. If both conditions are present, inheritance will be from all of the above classes. Possible values include `list` of fields to filter or `dict` where key is a field name and value is a Filter class. Dict extends attribute functionality and provides ability to override filter field class (None value disables overriding).
ru: ``_filterset_fields`` - список/словарь имен фильтров для фильтрации API. По умолчанию это список полей в view списке. При обработке списка полей проверяется наличие специальных имен полей и наследуются дополнительные родительские классы. Если список содержит ``id``, класс будет наследоваться от :class:`vstutils.api.filters.DefaultIDFilter`. Если список содержит ``name``, класс будет наследоваться от :class:`vstutils.api.filters.DefaultNameFilter`. Если присутствуют оба условия, наследование будет происходить от всех вышеперечисленных классов. Возможные значения включают список (`list`) полей для фильтрации или словарь (`dict`), где ключ - это имя поля, а значение - класс Filter. Словарь расширяет функциональность атрибута и позволяет переопределять класс поля фильтра (значение None отключает переопределение).

source: ``_search_fields`` - tuple or list of fields using for search requests. By default (or `None`) get all filterable fields in detail view.
ru: ``_search_fields`` - кортеж или список полей, используемых для поисковых запросов. По умолчанию (или `None`) получаются все поля, по которым можно фильтровать в детальном view.

source: ``_copy_attrs`` - list of model-instance attributes indicates that object is copyable with this attrs.
ru: ``_copy_attrs`` - список атрибутов экземпляра модели, указывающих, что объект можно скопировать с этими атрибутами.

source: ``_nested`` - key-value mapping with nested views (key - nested name, kwargs for :class:`vstutils.api.decorators.nested_view` decorator but supports ``model`` attribute as nested). ``model`` can be string for import. Use ``override_params`` when you need to override generated view parameters for nested view (works only with ``model`` as view).
ru: ``_nested`` - сопоставление ключ-значение вложенных view (ключ - имя вложенного view, kwargs для декоратора :class:`vstutils.api.decorators.nested_view`, но поддерживает атрибут ``model`` в качестве вложенного). ``model`` может быть строкой для импорта. Используйте параметр ``override_params`` в тех случаях, когда необходимо перегрузить параметры генерируемого представления в качестве вложенного (работает только когда задан ``model`` как вложенное представление).

source: ``_extra_view_attributes`` - key-value mapping with additional view attributes, but has less priority over generated attributes.
ru: ``_extra_view_attributes`` - отображение ключ-значение с дополнительными атрибутами view, но имеет меньший приоритет перед сгенерированными атрибутами.

source: ``_hidden_on_frontend_list_fields`` - list with fields names which will be hidden in list view on frontend.
ru: ``_hidden_on_frontend_list_fields`` - список имен полей, которые будут скрыты в списковом представлении на фронтенде.

source: ``_hidden_on_frontend_detail_fields`` - list with fields names which will be hidden in detail view on frontend.
ru: ``_hidden_on_frontend_detail_fields`` - список имен полей, которые будут скрыты в детальном представлении на фронтенде.
